  CREATE OR REPLACE TABLE BENEDETTI.BENINFF0 (
  ID NUMERIC(9) NOT NULL GENERATED ALWAYS AS IDENTITY
  (START WITH 1, INCREMENT BY 1),
  DATA DATE,
  ORA TIME,
  STATO VARCHAR(3),
  SETTORE VARCHAR(3),
  NOME VARCHAR(100),
  INDIRIZZO VARCHAR(100),
  DOMINIO VARCHAR(50),
  UTENTE VARCHAR(128) FOR BIT DATA,
  PAROLA VARCHAR(128) FOR BIT DATA,
  NOTA VARCHAR(300),
  PRIMARY KEY(ID)
  )
  RCDFMT BENINF

  LABEL ON TABLE BENEDETTI.BENINFF0 IS
  'Info varie BENEDETTI SpA'

  LABEL ON COLUMN BENEDETTI.BENINFF0 (
  ID IS 'Numero progressivo',
  DATA IS 'Data validità',
  ORA IS 'Ora Validità',
  STATO IS 'OLD=vecchia, ACT=actual',
  SETTORE IS 'Tabella Settore',
  NOME IS 'Argomento in oggetto',
  INDIRIZZO IS 'Indirizzo',
  DOMINIO IS 'Dominio',
  UTENTE IS 'Utente',
  PAROLA IS 'Parola d''ordine',
  NOTA IS 'Note'
  )

