      ****************************************************************
      *   TABELLA       : BENRETF0                                   *
      *   DESCRIZIONE   : Rete Mauro Benedetti SpA                   *
      *   PREFISSO      : MBR                                        *
      ****************************************************************
     A          R BENRET
      *
     A            MBRSTX0        1A         COLHDG('Stato ..............')
     A            MBRUTI0       10A         COLHDG('Utente Immissione...')
     A            MBRDAI0         L         COLHDG('Data Immissione.....')
     A            MBRORI0         T         COLHDG('Ora Immissione......')
     A            MBRPGI0       10A         COLHDG('Programma Immissione')
     A            MBRUTA0       10A         COLHDG('Utente Aggiornamento')
     A            MBRDAA0         L         COLHDG('Data Aggiornamento..')
     A            MBRORA0         T         COLHDG('Ora Aggiornamento...')
     A            MBRPGA0       10A         COLHDG('Progra.Aggiornamento')
      *
     A            MBRATT0        1S 0       COLHDG('1=Attivo 0=non attiv')
     A            MBRNUM0        9S 0       COLHDG('Numero sequenziale..')
     A            MBRTIP0        3A         COLHDG('Tipo apparato.......')
     A            MBRREP0        3A         COLHDG('Reparto aziendale...')
     A            MBRPRD0        3A         COLHDG('Produttore..........')
     A            MBROPE0        3A         COLHDG('Sistema operativo...')
     A            MBRCAR0      200A         COLHDG('Proc-Ram-Disk.......')
     A            MBRCLP0        3A         COLHDG('Classe IP...........')
     A            MBRIP40       15A         COLHDG('Indirizzo IPv4......')
     A            MBRNOM0       30A         COLHDG('Nome fisico.........')
     A            MBRSER0       30A         COLHDG('Serial Number.......')
     A            MBRMAC0       20A         COLHDG('Mac Address.........')
     A            MBRDES0      200A         COLHDG('Descrizione.........')
     A            MBRDOM0       40A         COLHDG('Dominio.............')
     A            MBRMOD0       50A         COLHDG('Modello.............')
     A            MBRUTE0       40A         COLHDG('Utente assegnato....')
     A            MBRNOT0      300A         COLHDG('Note................')
     A            MBRLOC0      200A         COLHDG('Locazione...........')
     A            MBRFRN0        6A         COLHDG('Codice Fornitore ...')
     A            MBRNUP0        3S 0       COLHDG('Numero Porte........')
     A            MBRVEL0        5S 0       COLHDG('Velocità in bit.....')
     A            MBRPOE0        1A         COLHDG('S/N poe.............')
     A            MBRUSR0       30A         COLHDG('User................')
     A            MBRORD0       30A         COLHDG('D ordine............')
     A            MBRSET0        3A         COLHDG('Settore ............')
     A            MBRPIA0        3A         COLHDG('Piano ..............')
     A            MBRCES0       30A         COLHDG('Codice Cespite .....')
     A            MBRDAD0         L         COLHDG('Data Dismissione ...')
     A            MBRSEP0       10A         COLHDG('Service Pack .......')
     A            MBRTII0        3A         COLHDG('Tipo IP fisso,DHCP..')
     A            MBRNAT0        1A         COLHDG('N=noleggio, P=propr.')
     A            MBRDAP0         L         COLHDG('Data Inizio.........')
     A            MBRDAF0         L         COLHDG('Data Fine...........')
     A            MBRIM10       20A         COLHDG('Imei 1 .............')
     A            MBRIM20       20A         COLHDG('Imei 2 .............')
     A            MBRICC0       20A         COLHDG('ICCD per sim .......')
     A            MBRMAN0        1A         COLHDG('Managed S/N ........')
     A            MBRIP60       39A         COLHDG('Indirizzo IPv6......')
     A            MBRLET0        1A         COLHDG('Gest.Contatori S/N .')
     A            MBRTIS0        1A         COLHDG('Se stamp.1=BN 2=Col.')
