      * ================================================================ *
      *  Richiesta  avvio progetto                                       *
      *  CEPRO1F0                                                        *
      * ================================================================ *
     A                                      REF(DIZMIGNI01)
     A          R CEPRO1
      *
     A            A1STX0    R               TEXT('Stato ...........')
     A            A1USE0    R               TEXT('Utente ..........')
     A            A1GRX0    R               TEXT('gg.  variazione .')
     A            A1MSX0    R               TEXT('mm.  variazione .')
     A            A1SCX0    R               TEXT('ss.  variazione .')
     A            A1ANX0    R               TEXT('aa.  variazione .')
     A            A1NRX0    R               TEXT('Numero Azione ...')
     A            A1ORX0    R               TEXT('Ora Variazione...')
      *
     A            A1PRG0    R               TEXT('Cod.progetto.....')
     A            A1SCR0    R               TEXT('Secolo richiesta.')
     A            A1ANR0    R               TEXT('Anno   richiesta.')
     A            A1MER0    R               TEXT('Mese   richiesta.')
     A            A1GIR0    R               TEXT('Giorno richiesta.')
     A            A1R010    R               TEXT('Riched. 01 ......')
     A            A1R020    R               TEXT('Riched. 02 ......')
     A            A1R030    R               TEXT('Riched. 03 ......')
     A            A1R040    R               TEXT('Riched. 04 ......')
     A            A1R050    R               TEXT('Riched. 05 ......')
     A            A1R060    R               TEXT('Riched. 06 ......')
     A            A1R070    R               TEXT('Riched. 07 ......')
     A            A1R080    R               TEXT('Riched. 08 ......')
     A            A1R090    R               TEXT('Riched. 09 ......')
     A            A1R100    R               TEXT('Riched. 10 ......')
     A            A1D010    R               TEXT('Descriz. lav. 01.')
     A            A1D020    R               TEXT('Descriz. lav. 02.')
     A            A1D030    R               TEXT('Descriz. lav. 03.')
     A            A1D040    R               TEXT('Descriz. lav. 04.')
     A            A1D050        60A         TEXT('Descriz. lav. 05.')
     A            A1D060        60A         TEXT('Descriz. lav. 06.')
     A            A1D070        60A         TEXT('Descriz. lav. 07.')
     A            A1P010    R               TEXT('Partec. 01 ......')
     A            A1P020    R               TEXT('Partec. 02 ......')
     A            A1P030    R               TEXT('Partec. 03 ......')
     A            A1P040    R               TEXT('Partec. 04 ......')
     A            A1P050    R               TEXT('Partec. 05 ......')
     A            A1P060    R               TEXT('Partec. 06 ......')
     A            A1P070    R               TEXT('Partec. 07 ......')
     A            A1P080    R               TEXT('Partec. 08 ......')
     A            A1P090    R               TEXT('Partec. 09 ......')
     A            A1P100    R               TEXT('Partec. 10 ......')
     A            A1SCS0    R               TEXT('Secolo Scadenza..')
     A            A1ANS0    R               TEXT('Anno   Scadenza..')
     A            A1MES0    R               TEXT('Mese   Scadenza..')
     A            A1GIS0    R               TEXT('Giorno Scadenza..')
     A            A1PRI0    R               TEXT('Priorità progetto')
     A            A1F010    R               TEXT('99 Prog. termin. ')
     A            A1F020    R               TEXT('GG chiusura......')
     A            A1F030    R               TEXT('MM chiusura .....')
     A            A1F040    R               TEXT('SS chiusura .....')
     A            A1F050    R               TEXT('AA chiusura .....')
     A            A1F060    R               TEXT('Raggruppamento 1.')
     A            A1F070    R               TEXT('NO -> No stampa..')
     A            A1F080    R               TEXT('MI=Mign. PE=Petr.')
      *                                           EN=Entrambi
     A            A1F090    R               TEXT('Flag 09 .........')
     A            A1F100    R               TEXT('Flag 10 .........')
