     A          R DIZMI2
     * =============================================================== *
     *  ARCHIVIO      : INCBANF0                                     *
     *  DESCRIZIONE   : Registrazione incassi agenti - BANCHE        *
     *  PREFISSO      : CNC                                          *
     * =============================================================== *
     A            CNCSTAT0       1A         COLHDG('Stato ..............')
     A            CNCIMUT0      10A         COLHDG('Immissione utente...')
     A            CNCIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNCIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNCIMPG0      10A         COLHDG('Immissione programma')
     A            CNCIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNCAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNCAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNCAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNCAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNCAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNCSOCI0       2A         COLHDG('Società ............')
      *
     A            CNCAGEN0       3          COLHDG('Codice agente ......')
     A            CNCDTRM0       8  0       COLHDG('Data registrazione..')
     A            CNCNURM0       9  0       COLHDG('Num.registr.manuale.')
     A            CNCNURA0       9  0       COLHDG('Num.registr.automat.')
     A            CNCDTRB0       8  0       COLHDG('Data operaz. banca..')
     A            CNCCOBA0      12          COLHDG('Conto banca ........')
     A            CNCCOCB0       8          COLHDG('Codice conto banca .')
     A            CNCTIOP0       3          COLHDG('Tipo operaz.bancaria')
     A            CNCCOTR0      12          COLHDG('Conto transitorio ..')
     A            CNCNURE0       9  0       COLHDG('Num.regist.contab...')
     A            CNCDARE0       8  0       COLHDG('Dat.regist.contab...')
     A            CNCIMPO0      18  8       COLHDG('Importo ............')
     A            CNCNOT10      40          COLHDG('Nota 01 ............')
     A            CNCNOT20      40          COLHDG('Nota 02 ............')
     A            CNCCHIU0       2          COLHDG('SI = Chiuso ........')
     A            CNCCNTB0       2          COLHDG('SI = Contabilizzato.')
      *
     A            CNCFL010       2          COLHDG('Flag 01 ............')
     A            CNCFL020       2          COLHDG('Flag 02 ............')
     A            CNCFL030       2          COLHDG('Flag 03 ............')
     A            CNCFL040       2          COLHDG('Flag 04 ............')
     A            CNCFL050       2          COLHDG('Flag 05 ............')
     A            CNCFL060      10          COLHDG('Flag 06 ............')
     A            CNCFL070      10          COLHDG('Flag 07 ............')
     A            CNCFL080      10          COLHDG('Flag 08 ............')
     A            CNCFL090      10          COLHDG('Flag 09 ............')
     A            CNCFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : INCBAVF0                                     *
     *  DESCRIZIONE   : Registrazione incassi agenti - BANCHE/Valute *
     *  PREFISSO      : CND                                          *
     * =============================================================== *
     A            CNDSTAT0       1A         COLHDG('Stato ..............')
     A            CNDIMUT0      10A         COLHDG('Immissione utente...')
     A            CNDIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNDIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNDIMPG0      10A         COLHDG('Immissione programma')
     A            CNDIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNDAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNDAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNDAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNDAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNDAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNDSOCI0       2A         COLHDG('Società ............')
      *
     A            CNDDTRM0       8  0       COLHDG('Data registrazione..')
     A            CNDNURA0       9  0       COLHDG('Num.registr.automat.')
     A            CNDCODI0       6          COLHDG('Codice intestatario.')
     A            CNDCODC0       6          COLHDG('Codice associato....')
     A            CNDASNO0      40          COLHDG('Nominativo assegno..')
     A            CNDBABI0       5          COLHDG('Banca ABI ..........')
     A            CNDBCAB0       5          COLHDG('Banca CAB ..........')
     A            CNDASBA0      40          COLHDG('Banca trassata .....')
     A            CNDASPI0      40          COLHDG('Piazza pagamento....')
     A            CNDASCC0      20          COLHDG('Conto corrente .....')
     A            CNDASNU0      20          COLHDG('Numero assegno .....')
     A            CNDDTVA0       8  0       COLHDG('Data valuta  banca..')
     A            CNDIMPO0      18  8       COLHDG('Importo valuta .....')
     A            CNDNOT10      40          COLHDG('Nota 01 ............')
     A            CNDNURR0       4  0       COLHDG('Num.rig.regist.cont.')
     A            CNDRIGA0       4  0       COLHDG('Num.riga interno....')
     A            CNDTIPO0       1          COLHDG('Tipo versamento.....')
      *
     A            CNDFL010       2          COLHDG('SI=creato CSC.......')
     A            CNDFL020       2          COLHDG('Flag 02 ............')
     A            CNDFL030       2          COLHDG('Flag 03 ............')
     A            CNDFL040       2          COLHDG('Flag 04 ............')
     A            CNDFL050       2          COLHDG('SP=spostato ........')
     *                                           'SP'=Spostato da Titoli a Contanti
     A            CNDFL060      10          COLHDG('Flag 06 ............')
     A            CNDFL070      10          COLHDG('Flag 07 ............')
     A            CNDFL080      10          COLHDG('Flag 08 ............')
     A            CNDFL090      10          COLHDG('Flag 09 ............')
     A            CNDFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : INCAGEF0                                     *
     *  DESCRIZIONE   : Registrazione incassi agenti                 *
     *  PREFISSO      : CNE                                          *
     * =============================================================== *
     A            CNESTAT0       1A         COLHDG('Stato ..............')
     A            CNEIMUT0      10A         COLHDG('Immissione utente...')
     A            CNEIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNEIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNEIMPG0      10A         COLHDG('Immissione programma')
     A            CNEIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNEAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNEAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNEAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNEAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNEAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNESOCI0       2A         COLHDG('Società ............')
      *
     A            CNETIPC0       1          COLHDG('Tipo codice ........')
     A            CNEAGEN0       3          COLHDG('Codice agente ......')
     A            CNEDTRM0       8  0       COLHDG('Data registrazione..')
     A            CNENURM0       9  0       COLHDG('Num.registr.manuale.')
     A            CNENURA0       9  0       COLHDG('Num.registr.automat.')
     A            CNEDTRB0       8  0       COLHDG('Data operaz. agente.')
     A            CNECOTR0      12          COLHDG('Conto transitorio ..')
     A            CNEIMPO0      18  8       COLHDG('Importo ............')
     A            CNENOT10      40          COLHDG('Nota 01 ............')
     A            CNENOT20      40          COLHDG('Nota 02 ............')
     A            CNENURE0       9  0       COLHDG('Num.regist.contab...')
     A            CNEDARE0       8  0       COLHDG('Dat.regist.contab...')
     A            CNECHIU0       2          COLHDG('SI = Chiuso ........')
     A            CNEFL010       2          COLHDG('SI = Contabilizzato.')
     A            CNEFL020       2          COLHDG('Flag 02 ............')
     A            CNEFL030       2          COLHDG('Flag 03 ............')
     A            CNEFL040       2          COLHDG('Flag 04 ............')
     A            CNEFL050       2          COLHDG('Flag 05 ............')
     A            CNEFL060      10          COLHDG('Flag 06 ............')
     A            CNEFL070      10          COLHDG('Flag 07 ............')
     A            CNEFL080      10          COLHDG('Flag 08 ............')
     A            CNEFL090      10          COLHDG('Flag 09 ............')
     A            CNEFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : INCAGCF0                                     *
     *  DESCRIZIONE   : Registrazione incassi agenti - CLIENTI       *
     *  PREFISSO      : CNF                                          *
     * =============================================================== *
     A            CNFSTAT0       1A         COLHDG('Stato ..............')
     A            CNFIMUT0      10A         COLHDG('Immissione utente...')
     A            CNFIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNFIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNFIMPG0      10A         COLHDG('Immissione programma')
     A            CNFIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNFAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNFAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNFAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNFAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNFAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNFSOCI0       2A         COLHDG('Società ............')
      *
     A            CNFDTRM0       8  0       COLHDG('Data registrazione..')
     A            CNFNURA0       9  0       COLHDG('Num.registr.automat.')
     A            CNFAGEN0       3          COLHDG('Codice agente ......')
     A            CNFCODI0       6          COLHDG('Codice intestatario.')
     A            CNFCODC0       6          COLHDG('Codice associato....')
     A            CNFDATF0       8  0       COLHDG('Data fattura .......')
     A            CNFNUMF0       6  0       COLHDG('Numero fattura .....')
     A            CNFSIGF0       4          COLHDG('Sigla fattura ......')
     A            CNFNOCR0       1          COLHDG('"N" nota credito....')
     A            CNFIMPF0      18  8       COLHDG('Importo fattura ....')
     A            CNFIMPI0      18  8       COLHDG('Importo incassato ..')
     A            CNFIMMN0      18  8       COLHDG('Importo manuale ....')
     A            CNFIMSS0      18  8       COLHDG('Importo utilizzabile')
     A            CNFSCAB0       5  2       COLHDG('% sconto finanziario')
     A            CNFIMSF0      18  8       COLHDG('Importo sc.finanzia.')
     A            CNFSCSC0       5  2       COLHDG('% sc.finanz.riconosc')
     A            CNFIMSR0      18  8       COLHDG('Importo sc.fin.rico.')
     A            CNFIMAB0      18  8       COLHDG('Importo abbuono +/-.')
     A            CNFIMDP0      18  8       COLHDG('Importo differ.prez.')
     A            CNFNOT10      40          COLHDG('Nota 01 ............')
     A            CNFNOT20      40          COLHDG('Nota 02 ............')
     A            CNFTIPI0       1          COLHDG('Tipo incasso  ......')
     *                                             1-Saldo fattura al 100%
     *                                             2-In acconto
     *                                             3-Saldo fattura con differenza
     *                                             4-Saldo fattura con precedente acconto
     A            CNFDIPQ0       2          COLHDG('"on"= sconto H42 ...')
     A            CNFDIPI0       2          COLHDG('"on"= sconto H44 ...')
     A            CNFTIPA0       1          COLHDG('Tipo accettazione...')
     *                                             1-Accettato sconto finanziario.
     *                                             2-Non accettato sconto finanziario.
     *                                             3-Accettato parzialmente sconto finanziario.
     A            CNFIMAD0      18  8       COLHDG('Importo da addebitar')
     A            CNFMIXP0       1          COLHDG('* =mix personalizza.')
     A            CNFECCG0       1          COLHDG('* =eccedenza giorni.')
     A            CNFDIFP0       1          COLHDG('* =differenza prezzo')
     A            CNFDIFQ0       1          COLHDG('* =differenza quant.')
     A            CNFFL010       2          COLHDG('MA=prz.inser.manual.')
     A            CNFFL020       2          COLHDG('SI=emessa NC sc.fin.')
     A            CNFFL030       2          COLHDG('SI=Stampato ........')
     A            CNFFL040       2          COLHDG('SI=favorevole NO=no.')
     A            CNFFL050       2          COLHDG('Flag 05 ............')
     A            CNFFL060      10          COLHDG('Utente che ha autor.')
     A            CNFFL070      10          COLHDG('1-6 cli.Not.Deb.....')
     A            CNFFL080      10          COLHDG('NUMOV di EFPO2 .....')
     A            CNFFL090      10          COLHDG('Flag 09 ............')
     A            CNFFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : INCAGFF0                                     *
     *  DESCRIZIONE   : Registrazione incassi agenti (FATTURA)       *
     *  PREFISSO      : AN4                                          *
     * =============================================================== *
     A            AN4STAT0       1A         COLHDG('Stato ..............')
     A            AN4IMUT0      10A         COLHDG('Immissione utente...')
     A            AN4IMDA0       8  0       COLHDG('Immissione data ....')
     A            AN4IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AN4IMPG0      10A         COLHDG('Immissione programma')
     A            AN4IMAZ0       4A         COLHDG('Immissione azione...')
     A            AN4AGUT0      10A         COLHDG('Aggiornamento utente')
     A            AN4AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            AN4AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            AN4AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            AN4AGAZ0       4A         COLHDG('Aggiornamento azione')
     A            AN4SOCI0       2A         COLHDG('Società ............')
      *
     A            AN4DTRM0       8  0       COLHDG('Data registrazione..')
     A            AN4NURA0       9  0       COLHDG('Num.registr.automat.')
     A            AN4DATF0       8  0       COLHDG('Data fattura........')
     A            AN4NUMF0       6  0       COLHDG('Numero fattura......')
     A            AN4PROD0      15          COLHDG('Codice prodotto.....')
     A            AN4NURI0       4  0       COLHDG('Numero riga.........')
     A            AN4OMAG0       1          COLHDG('Tipo omaggio .......')
     A            AN4QUAN0      12  3       COLHDG('Quantità ...........')
     A            AN4PREZ0      18  8       COLHDG('Prezzo .............')
     A            AN4SCON0      18  8       COLHDG('Sconto .............')
     A            AN4PREP0      18  8       COLHDG('Prezzo incassato....')
     A            AN4PRES0      18  8       COLHDG('Prezzo con sconto...')
     A            AN4QUAP0      12  3       COLHDG('Quantità pagata ....')
     A            AN4CAUS0       2          COLHDG('Causale ............')
     A            AN4NOTE0      60          COLHDG('Annotazioni ........')
      *
     A            AN4FL010       2          COLHDG('"on" = sacco rotto..')
     A            AN4FL020       2          COLHDG('Flag 02 ............')
     A            AN4FL030       2          COLHDG('Flag 03 ............')
     A            AN4FL040       2          COLHDG('Flag 04 ............')
     A            AN4FL050       2          COLHDG('Flag 05 ............')
     A            AN4FL060      10          COLHDG('Quota Discr.(6dec)->')
     A            AN4FL070      10          COLHDG('Flag 07 ............')
     A            AN4FL080      10          COLHDG('Flag 08 ............')
     A            AN4FL090      10          COLHDG('Flag 09 ............')
     A            AN4FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MF3MAFA0                                     *
     *  DESCRIZIONE   : MacinaFarm Budget obbiettivo RURAL - PETFOOD  *
     *                  RIEPILOGO DISTRETTO                           *
     *  PREFISSO      : MF3                                          *
     * =============================================================== *
     A            MF3STATO0      1          COLHDG('Stato ..............')
     A            MF3IMMUT0     10          COLHDG('Immissione utente...')
     A            MF3IMMDA0      8  0       COLHDG('Immissione data ....')
     A            MF3IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            MF3IMMPG0     10A         COLHDG('Immissione programma')
     A            MF3IMMAZ0      4A         COLHDG('Immissione azione...')
     A            MF3AGGUT0     10          COLHDG('Aggiornamento utente')
     A            MF3AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            MF3AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            MF3AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            MF3AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            MF3SOCIE0      2          COLHDG('Società ............')
      *
     A            MF3ANBDG0      4          COLHDG('Anno Budget....... .')
     A            MF3CDFAT0      6          COLHDG('Cliente fatturaz.. .')
     A            MF3PAIVA0     11          COLHDG('Partita iva......  .')
     A            MF3OBRUR0     18  6       COLHDG('Obbiet. EURO RURAL..')
     A            MF3OBFOD0     18  6       COLHDG('Obbiet. EURO FOOD...')
     A            MF3OBBI30     18  6       COLHDG('Obbiet. EURO      ..')
     A            MF3OBBI40     18  6       COLHDG('Obbiet. EURO     ...')
     A            MF3QTRUR0     18  6       COLHDG('Quantità RURAL......')
     A            MF3QTFOD0     18  6       COLHDG('Quantità FOOD.......')
     A            MF3QUAN30     18  6       COLHDG('Quantità      ......')
     A            MF3QUAN40     18  6       COLHDG('Quantità     .......')
     A            MF3CANAL0      1          COLHDG('Canale..............')
     A            MF3DISTR0      3          COLHDG('Distretto...........')
     A            MF3AGENT0      3          COLHDG('Agente..............')
      *
     A            MF3RIRUR0     18  6       COLHDG('Risult. EURO RURAL..')
     A            MF3RIFOD0     18  6       COLHDG('Risult. EURO FOOD...')
     A            MF3RIBI30     18  6       COLHDG('Risult. EURO      ..')
     A            MF3RIBI40     18  6       COLHDG('Risult. EURO     ...')
     A            MF3RIQTRU0    18  6       COLHDG('Risult. Qta Rural...')
     A            MF3RIQTFO0    18  6       COLHDG('Risult. Qta Food....')
     A            MF3RIQT30     18  6       COLHDG('Quantità      ......')
     A            MF3RIQT40     18  6       COLHDG('Quantità     .......')
     A            MF3LINEA0      4          COLHDG('Linea        .......')
      *
     A            MF3FLG010      2          COLHDG('Flag 01 ............')
     A            MF3FLG020      2          COLHDG('Flag 02 ............')
     A            MF3FLG030      2          COLHDG('Flag 03 ............')
     A            MF3FLG040      2          COLHDG('Flag 04 ............')
     A            MF3FLG050      2          COLHDG('Flag 05 ............')
     A            MF3FLG060     10          COLHDG('Flag 06 ............')
     A            MF3FLG070     10          COLHDG('Flag 07 ............')
     A            MF3FLG080     10          COLHDG('Flag 08 ............')
     A            MF3FLG090     10          COLHDG('Flag 09 ............')
     A            MF3FLG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : STOVIAF0                                     *
     *  DESCRIZIONE   : Storico viaggi.                              *
     *  PREFISSO      : CNG                                          *
     * =============================================================== *
     A            CNGSTAT0       1A         COLHDG('Stato ..............')
     A            CNGIMUT0      10A         COLHDG('Immissione utente...')
     A            CNGIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNGIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNGIMPG0      10A         COLHDG('Immissione programma')
     A            CNGIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNGAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNGAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNGAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNGAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNGAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNGSOCI0       2A         COLHDG('Società ............')
      *
     A            CNGSTAB0       3          COLHDG('Codice stabilimento.')
     A            CNGMAGA0       3          COLHDG('Codice magazzino ...')
     A            CNGVIAG0       9  0       COLHDG('Numero viaggio .....')
     A            CNGDATV0       8  0       COLHDG('Data viaggio .......')
     A            CNGVETT0       4          COLHDG('Codice vettore .....')
     A            CNGTIVE0       2          COLHDG('Tipo veicolo .......')
     A            CNGFOVE0       6          COLHDG('Codice fornit.vetto.')
     A            CNGSFUS0       1          COLHDG('I=sacchi R=rinfusa..')
     A            CNGCONS0       2  0       COLHDG('Numero consegne and.')
     A            CNGZOAN0       6          COLHDG('Zona andata ........')
     A            CNGZORI0       6          COLHDG('Zona ritorno .......')
     A            CNGKMAN0       4  0       COLHDG('KM andata ..........')
     A            CNGKMRI0       4  0       COLHDG('KM ritorno .........')
     A            CNGKMTT0       4  0       COLHDG('KM totali ..........')
     A            CNGKGAN0      12  2       COLHDG('KG lordi andata ....')
     A            CNGKGRI0      12  2       COLHDG('KG lordi ritorno ...')
     A            CNGKGCA0      12  2       COLHDG('KG per calcolo .....')
     A            CNGKGPA0       9  2       COLHDG('KG pallet andata ...')
     A            CNGKGPR0       9  2       COLHDG('KG pallet ritorno ..')
     A            CNGCLAS0      12  2       COLHDG('Classe di peso veic.')
     A            CNGTARI0      18  9       COLHDG('Tariffa fissa ......')
     A            CNGIMPO0      18  6       COLHDG('Importo viaggio and.')
     A            CNGIMPR0      18  6       COLHDG('Importo viaggio rit.')
     A            CNGPALA0       4  0       COLHDG('N.pallet andata ....')
     A            CNGPALR0       4  0       COLHDG('N.pallet ritorno ...')
     A            CNGSIGF0       4          COLHDG('Fattura forn.Sigla .')
     A            CNGNUMF0       6  0       COLHDG('Fattura forn.Numero.')
     A            CNGDATF0       8  0       COLHDG('Fattura forn.Data ..')
     A            CNGPROF0       9  0       COLHDG('Fattura forn.NumProt')
     A            CNGPROD0       8  0       COLHDG('Fattura forn.DatProt')
     A            CNGIMFF0      18  6       COLHDG('Fattura forn.Impor..')
     A            CNGFDEF0       2          COLHDG('SI = definitivo ....')
      *
     A            CNGIMSC0      12  6       COLHDG('Importo x scarichi .')
     A            CNGVSCA0      18  6       COLHDG('Valore scarico .....')
     A            CNGSCON0       5  2       COLHDG('% Sconto ...........')
     A            CNGVSCO0      18  6       COLHDG('Valore sconto ......')
     A            CNGMAGS0       5  2       COLHDG('% maggior. x sfusi..')
     A            CNGVMAS0      18  6       COLHDG('Valore maggior.sfusi')
     A            CNGMAGG0       5  2       COLHDG('% Maggiorazioni ....')
     A            CNGVMAG0      18  6       COLHDG('Valore maggiorazioni')
     A            CNGIMFA0      12  6       COLHDG('Importo x facchinag.')
     A            CNGVFAC0      18  6       COLHDG('Valore facchinaggio.')
     A            CNGVADD0      18  6       COLHDG('Valore addebito ....')
     A            CNGVAVI0      18  6       COLHDG('Valore viaggio .....')
     A            CNGIMTR0      12  6       COLHDG('Importo x trasbordi.')
     A            CNGVTRA0      18  6       COLHDG('Valore trasbordi ...')
     A            CNGIMPA0      12  6       COLHDG('Importo x pallet ...')
     A            CNGVPAL0      18  6       COLHDG('Valore pallet ......')
      *
     A            CNGFL010       2          COLHDG('Flag 01 ............')
     A            CNGFL020       2          COLHDG('Flag 02 ............')
     A            CNGFL030       2          COLHDG('Flag 03 ............')
     A            CNGFL040       2          COLHDG('Flag 04 ............')
     A            CNGFL050       2          COLHDG('Flag 05 ............')
     A            CNGFL060      10          COLHDG('Flag 06 ............')
     A            CNGFL070      10          COLHDG('Flag 07 ............')
     A            CNGFL080      10          COLHDG('Flag 08 ............')
     A            CNGFL090      10          COLHDG('Flag 09 ............')
     A            CNGFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TARFORF0                                     *
     *  DESCRIZIONE   : Tariffe a forcella.                          *
     *  PREFISSO      : CNH                                          *
     * =============================================================== *
     A            CNHSTAT0       1A         COLHDG('Stato ..............')
     A            CNHIMUT0      10A         COLHDG('Immissione utente...')
     A            CNHIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNHIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNHIMPG0      10A         COLHDG('Immissione programma')
     A            CNHIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNHAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNHAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNHAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNHAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNHAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNHSOCI0       2A         COLHDG('Società ............')
      *
     A            CNHDATV0       8  0       COLHDG('Data validità ......')
     A            CNHTIVE0       2          COLHDG('Tipo veicolo .......')
     A            CNHKILO0       5  0       COLHDG('Kilometri ..........')
     A            CNHPESO0      12  3       COLHDG('Peso ...............')
     A            CNHEUSC0      18  9       COLHDG('Euro per scarico ...')
     A            CNHEUQL0      18  9       COLHDG('Euro x q.le x km ...')
      *
     A            CNHFL010       2          COLHDG('Flag 01 ............')
     A            CNHFL020       2          COLHDG('Flag 02 ............')
     A            CNHFL030       2          COLHDG('Flag 03 ............')
     A            CNHFL040       2          COLHDG('Flag 04 ............')
     A            CNHFL050       2          COLHDG('Flag 05 ............')
     A            CNHFL060      10          COLHDG('Flag 06 ............')
     A            CNHFL070      10          COLHDG('Flag 07 ............')
     A            CNHFL080      10          COLHDG('Flag 08 ............')
     A            CNHFL090      10          COLHDG('Flag 09 ............')
     A            CNHFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TRACONF0                                     *
     *  DESCRIZIONE   : Tariffe a forcella per trsportatore CONTRATTO*
     *  PREFISSO      : CNL                                          *
     * =============================================================== *
     A            CNLSTAT0       1A         COLHDG('Stato ..............')
     A            CNLIMUT0      10A         COLHDG('Immissione utente...')
     A            CNLIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNLIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNLIMPG0      10A         COLHDG('Immissione programma')
     A            CNLIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNLAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNLAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNLAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNLAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNLAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNLSOCI0       2A         COLHDG('Società ............')
      *
     A            CNLFORT0       6          COLHDG('Codice Fornitore....')
     A            CNLDATV0       8  0       COLHDG('Inizio data validità')
     A            CNLTIVE0       2          COLHDG('Tipo veicolo .......')
      *
     A            CNLKILO0       5  0       COLHDG('Fino a Kilometri....')
     A            CNLEUKM0       8  4       COLHDG('Euro x Km...........')
      *
     A            CNLPESO0      12  3       COLHDG('Peso ...............')
     A            CNLTIVA0       2          COLHDG('Tipo Valorizzazione.')
      *                                            AR Andata/Ritorno
      *                                            AN Solo andata
     A            CNLTIPO0       1          COLHDG('Tipo Record ........')
      *                                             B=Budget
      *                                             E=Effettivo
      *
     A            CNLFL010       2          COLHDG('Flag 01 ............')
     A            CNLFL020       2          COLHDG('Flag 02 ............')
     A            CNLFL030       2          COLHDG('Flag 03 ............')
     A            CNLFL040       2          COLHDG('Flag 04 ............')
     A            CNLFL050       2          COLHDG('Flag 05 ............')
     A            CNLFL060      10          COLHDG('Flag 06 ............')
     A            CNLFL070      10          COLHDG('Flag 07 ............')
     A            CNLFL080      10          COLHDG('Flag 08 ............')
     A            CNLFL090      10          COLHDG('Flag 09 ............')
     A            CNLFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : VIAABBF0                                     *
     *  DESCRIZIONE   : Viaggi abbinati                              *
     *  PREFISSO      : CNN                                          *
     * =============================================================== *
     A            CNNSTAT0       1A         COLHDG('Stato ..............')
     A            CNNIMUT0      10A         COLHDG('Immissione utente...')
     A            CNNIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNNIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNNIMPG0      10A         COLHDG('Immissione programma')
     A            CNNIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNNAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNNAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNNAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNNAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNNAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNNSOCI0       2A         COLHDG('Società ............')
      *
     A            CNNVIAN0       9  0       COLHDG('Num.Viaggio Andata..')
     A            CNNVIRI0       9  0       COLHDG('Num.Viaggio Ritorno.')
     A            CNNVIUS0       9  0       COLHDG('Num.Viaggio Uscita..')
      *
     A            CNNTIRI0       2          COLHDG('Tipo ritorno MP/CO  ')
     A            CNNVETT0       3          COLHDG('Vettore.............')
     A            CNNFORN0       6          COLHDG('Cod. Fornitore......')
      *
     A            CNNFL010       2          COLHDG('VU = Ritorno Vuoto..')
     A            CNNFL020       2          COLHDG('DF = Definitivo ....')
     A            CNNFL030       2          COLHDG('Flag 03 ............')
     A            CNNFL040       2          COLHDG('Flag 04 ............')
     A            CNNFL050       2          COLHDG('Flag 05 ............')
     A            CNNFL060      10          COLHDG('Flag 06 ............')
     A            CNNFL070      10          COLHDG('Flag 07 ............')
     A            CNNFL080      10          COLHDG('Flag 08 ............')
     A            CNNFL090      10          COLHDG('Flag 09 ............')
     A            CNNFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TRA370F0                                     *
     *  DESCRIZIONE   : Dati da consuntivo per Zona Trasporti        *
     *  PREFISSO      : CNO                                          *
     * =============================================================== *
     A            CNOSTAT0       1A         COLHDG('Stato ..............')
     A            CNOIMUT0      10A         COLHDG('Immissione utente...')
     A            CNOIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNOIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNOIMPG0      10A         COLHDG('Immissione programma')
     A            CNOIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNOAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNOAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNOAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNOAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNOAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNOSOCI0       2A         COLHDG('Società ............')
      *
     A            CNOMAGA0       2          COLHDG('Magazzino ..........')
     A            CNOANNO0       4  0       COLHDG('Anno ...............')
     A            CNOZONA0       5          COLHDG('Zona Trasporto......')
     A            CNOTAUT0       2          COLHDG('Tipo Automezzo......')
     A            CNOSASF0       1          COLHDG('Sacchi/Sfusi I/S....')
     A            CNOQTAV0      12  2       COLHDG('Q.ta Viaggio .......')
     A            CNOKILO0      12  0       COLHDG('Num.Km..............')
     A            CNOCOVI0      12  0       COLHDG('Conta Nr Viaggi ....')
     A            CNOMEKM0      12  0       COLHDG('Media Km ...........')
     A            CNOQTFA0      12  2       COLHDG('Qta Facchinaggio....')
     A            CNOIMFA0      12  2       COLHDG('Imp Facchinaggio....')
     A            CNONRSC0      12  0       COLHDG('Nr. Scarichi .......')
     A            CNOIMSC0      12  2       COLHDG('Imp Scarichi .......')
     A            CNONRPL0      12  0       COLHDG('Nr  Pallet .........')
     A            CNOIMPL0      12  2       COLHDG('Imp Pallet .........')
      *
     A            CNOFL010       2          COLHDG('Flag 01 ............')
     A            CNOFL020       2          COLHDG('Flag 02 ............')
     A            CNOFL030       2          COLHDG('Flag 03 ............')
     A            CNOFL040       2          COLHDG('Flag 04 ............')
     A            CNOFL050       2          COLHDG('Flag 05 ............')
     A            CNOFL060      10          COLHDG('Flag 06 ............')
     A            CNOFL070      10          COLHDG('Flag 07 ............')
     A            CNOFL080      10          COLHDG('Flag 08 ............')
     A            CNOFL090      10          COLHDG('Flag 09 ............')
     A            CNOFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TRA372F0                                     *
     *  DESCRIZIONE   : Dati Budget Zona Trasporto E/Km              *
     *  PREFISSO      : CNP                                          *
     * =============================================================== *
     A            CNPSTAT0       1A         COLHDG('Stato ..............')
     A            CNPIMUT0      10A         COLHDG('Immissione utente...')
     A            CNPIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNPIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNPIMPG0      10A         COLHDG('Immissione programma')
     A            CNPIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNPAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNPAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNPAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNPAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNPAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNPSOCI0       2A         COLHDG('Società ............')
      *
     A            CNPMAGA0       2          COLHDG('Magazzino ..........')
     A            CNPANNO0       4  0       COLHDG('Anno ..............')
     A            CNPZONA0       5          COLHDG('Zona Trasporto......')
     A            CNPSASF0       1          COLHDG('Sacchi/Sfusi I/S....')
     A            CNPTAUT0       2          COLHDG('Tipo Automezzo......')
     A            CNPKILO0      12  0       COLHDG('Km da percorrere ...')
     A            CNPNVIA0      12  0       COLHDG('Nr Viaggi ..........')
     A            CNPKMME0      12  0       COLHDG('Km Medi ............')
     A            CNPEUKM0      12  4       COLHDG('E/Km ...............')
     A            CNPCOZO0      12  2       COLHDG('Costo Zona .........')
     A            CNPQTAV0      12  2       COLHDG('Volumi .............')
     A            CNPQTFA0      12  2       COLHDG('Q.tà Facchinato ....')
     A            CNPIMFA0      12  2       COLHDG('Imp. Facchinato ....')
     A            CNPEFAC0      12  4       COLHDG('E/Q.le Faccinato ...')
     A            CNPNRSC0      12  0       COLHDG('Nr Scarichi ........')
     A            CNPNRPL0      12  0       COLHDG('Nr Pallet ..........')
      *
     A            CNPFL010       2          COLHDG('Flag 01 ............')
     A            CNPFL020       2          COLHDG('Flag 02 ............')
     A            CNPFL030       2          COLHDG('Flag 03 ............')
     A            CNPFL040       2          COLHDG('Flag 04 ............')
     A            CNPFL050       2          COLHDG('Flag 05 ............')
     A            CNPFL060      10          COLHDG('Flag 06 ............')
     A            CNPFL070      10          COLHDG('Flag 07 ............')
     A            CNPFL080      10          COLHDG('Flag 08 ............')
     A            CNPFL090      10          COLHDG('Flag 09 ............')
     A            CNPFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TRABDGF0                                     *
     *  DESCRIZIONE   : Budget Q.li Consegne-Ritiri-Consegne seza Rit*
     *  PREFISSO      : CNQ                                          *
     * =============================================================== *
     A            CNQSTAT0       1A         COLHDG('Stato ..............')
     A            CNQIMUT0      10A         COLHDG('Immissione utente...')
     A            CNQIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNQIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNQIMPG0      10A         COLHDG('Immissione programma')
     A            CNQIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNQAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNQAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNQAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNQAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNQAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNQSOCI0       2A         COLHDG('Società ............')
      *
     A            CNQESER0       4          COLHDG('esercizio...........')
     A            CNQMAGA0       2          COLHDG('Magazzino...........')
     A            CNQSFSA0       1          COLHDG('Sfuso-Sacchi S-I....')
     A            CNQZONA0       5          COLHDG('Zona................')
     A            CNQTIVE0       2          COLHDG('Tipo Automezzo......')
     A            CNQFORT0       6          COLHDG('Codice Fornitore....')
      *
     A            CNQPECO0      12  3       COLHDG('Peso Consegna.......')
     A            CNQPERI0      12  3       COLHDG('Peso Ritorno .......')
     A            CNQPESR0      12  3       COLHDG('Peso Consegna.......')
      *
     A            CNQFL010       2          COLHDG('Flag 01 ............')
     A            CNQFL020       2          COLHDG('Flag 02 ............')
     A            CNQFL030       2          COLHDG('Flag 03 ............')
     A            CNQFL040       2          COLHDG('Flag 04 ............')
     A            CNQFL050       2          COLHDG('Flag 05 ............')
     A            CNQFL060      10          COLHDG('Flag 06 ............')
     A            CNQFL070      10          COLHDG('Flag 07 ............')
     A            CNQFL080      10          COLHDG('Flag 08 ............')
     A            CNQFL090      10          COLHDG('Flag 09 ............')
     A            CNQFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LGSBDGF0                                     *
     *  DESCRIZIONE   : Budget LGS Andate/Ritorno                    *
     *  PREFISSO      : CNR                                          *
     * =============================================================== *
     A            CNRSTAT0       1A         COLHDG('Stato ..............')
     A            CNRIMUT0      10A         COLHDG('Immissione utente...')
     A            CNRIMDA0       8  0       COLHDG('Immissione data ....')
     A            CNRIMOR0       6  0       COLHDG('Immissione ora .....')
     A            CNRIMPG0      10A         COLHDG('Immissione programma')
     A            CNRIMAZ0       4A         COLHDG('Immissione azione...')
     A            CNRAGUT0      10A         COLHDG('Aggiornamento utente')
     A            CNRAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CNRAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CNRAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            CNRAGAZ0       4A         COLHDG('Aggiornamento azione')
     A            CNRSOCI0       2A         COLHDG('Società ............')
      *
     A            CNRESER0       4          COLHDG('esercizio...........')
     A            CNRMAGA0       2          COLHDG('Magazzino...........')
     A            CNRSFSA0       1          COLHDG('Sfuso-Sacchi S-I....')
     A            CNRZONA0       5          COLHDG('Zona................')
     A            CNRTIVE0       2          COLHDG('Tipo Automezzo......')
      *
     A            CNRPECO0      12  3       COLHDG('Peso Consegna.......')
     A            CNRPERI0      12  3       COLHDG('Peso Ritorno .......')
     A            CNRPESR0      12  3       COLHDG('Peso Consegna.......')
     A            CNRTQTA0      12  3       COLHDG('Tot. Trasportati ...')
     A            CNRNVIA0      12  0       COLHDG('Nr. dei Viaggi .....')
     A            CNRKMZO0      12  0       COLHDG('Media Km per Zona ..')
     A            CNRTOKM0      12  0       COLHDG('Totale Km ..........')
     A            CNREUKM0      12  4       COLHDG('Tariffa E/Km .......')
     A            CNRVAZO0      12  3       COLHDG('Valore Zona con E/Km')
     A            CNREUQL0      12  4       COLHDG('Tariffa E/Q.le .....')
     A            CNRVAZ10      12  3       COLHDG('Valore Zona con E/Ql')
     A            CNRDIFV0      12  3       COLHDG('Differenza Valori ..')
     A            CNRVAAC0      12  3       COLHDG('Val.Zona + Acces....')
     A            CNREQFI0      12  4       COLHDG('E/Qle finale .......')
     A            CNREQ010      12  4       COLHDG('E/Qle 1 ............')
     A            CNREQ020      12  4       COLHDG('E/Qle 2 ............')
     A            CNREQ030      12  4       COLHDG('E/Qle 3 ............')
      *
     A            CNRFL010       2          COLHDG('Flag 01 ............')
     A            CNRFL020       2          COLHDG('Flag 02 ............')
     A            CNRFL030       2          COLHDG('Flag 03 ............')
     A            CNRFL040       2          COLHDG('Flag 04 ............')
     A            CNRFL050       2          COLHDG('Flag 05 ............')
     A            CNRFL060      10          COLHDG('Flag 06 ............')
     A            CNRFL070      10          COLHDG('Flag 07 ............')
     A            CNRFL080      10          COLHDG('Flag 08 ............')
     A            CNRFL090      10          COLHDG('Flag 09 ............')
     A            CNRFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCO1F0                                     *
     *  DESCRIZIONE   : Archivio guida per Budget e Contribuzione    *
     *  PREFISSO      : BC1                                          *
     * =============================================================== *
     A            BC1STAT0       1A         COLHDG('Stato ..............')
     A            BC1IMUT0      10A         COLHDG('Immissione utente...')
     A            BC1IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC1IMPG0      10A         COLHDG('Immissione programma')
     A            BC1IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC1AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC1AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC1SOCI0       2A         COLHDG('Società ............')
      *
     A            BC1TIPO0       3          COLHDG('Tipo record ........')
     A            BC1MAGA0       3          COLHDG('Codice magazzino ...')
     A            BC1CLIE0       6          COLHDG('Codice cliente .....')
     A            BC1PROD0      15          COLHDG('Codice prodotto ....')
     A            BC1TIOM0       1          COLHDG('Tipo omaggio .......')
     A            BC1ANNO0       4  0       COLHDG('Anno competenza ....')
     A            BC1MESE0       2  0       COLHDG('Mese competenza ....')
     A            BC1DATS0       8  0       COLHDG('Data statistica ....')
     A            BC1RAG10       3          COLHDG('Raggruppamento 1....')
     A            BC1RAG20       3          COLHDG('Raggruppamento 2....')
     A            BC1RAG30       3          COLHDG('Raggruppamento 3....')
     A            BC1QUAN0      12  3       COLHDG('Quantità ...........')
     A            BC1IMPL0      18  6       COLHDG('Importo lordo ......')
     A            BC1IMPN0      18  6       COLHDG('Importo netto ......')
     A            BC1PROG0       9  0       COLHDG('Progressivo ........')
      *
     A            BC1FL010       2          COLHDG('Flag 01 ............')
     A            BC1FL020       2          COLHDG('Flag 02 ............')
     A            BC1FL030       2          COLHDG('Flag 03 ............')
     A            BC1FL040       2          COLHDG('Flag 04 ............')
     A            BC1FL050       2          COLHDG('Flag 05 ............')
     A            BC1FL060      10          COLHDG('Flag 06 ............')
     A            BC1FL070      10          COLHDG('Flag 07 ............')
     A            BC1FL080      10          COLHDG('Flag 08 ............')
     A            BC1FL090      10          COLHDG('Flag 09 ............')
     A            BC1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCO2F0                                     *
     *  DESCRIZIONE   : Storico dati cliente.                        *
     *  PREFISSO      : BC2                                          *
     * =============================================================== *
     A            BC2STAT0       1A         COLHDG('Stato ..............')
     A            BC2IMUT0      10A         COLHDG('Immissione utente...')
     A            BC2IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC2IMPG0      10A         COLHDG('Immissione programma')
     A            BC2IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC2AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC2AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC2SOCI0       2A         COLHDG('Società ............')
      *
     A            BC2ARES0       3          COLHDG('Area statistica ....')
     A            BC2AREV0       3          COLHDG('Area vendite .......')
     A            BC2REGI0       3          COLHDG('Regione ............')
     A            BC2ZONA0       6          COLHDG('Zona ...............')
     A            BC2PROV0       2          COLHDG('Provincia ..........')
     A            BC2MERC0       2          COLHDG('Mercato ............')
     A            BC2ISPE0       3          COLHDG('Ispettore ..........')
     A            BC2AGEN0       3          COLHDG('Codice agente ......')
     A            BC2CLIE0       6          COLHDG('Codice cliente .....')
     A            BC2DADO0       8  0       COLHDG('Data documento .....')
      *
     A            BC2FL010       2          COLHDG('Flag 01 ............')
     A            BC2FL020       2          COLHDG('Flag 02 ............')
     A            BC2FL030       2          COLHDG('Flag 03 ............')
     A            BC2FL040       2          COLHDG('Flag 04 ............')
     A            BC2FL050       2          COLHDG('Flag 05 ............')
     A            BC2FL060      10          COLHDG('Flag 06 ............')
     A            BC2FL070      10          COLHDG('Flag 07 ............')
     A            BC2FL080      10          COLHDG('Flag 08 ............')
     A            BC2FL090      10          COLHDG('Flag 09 ............')
     A            BC2FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCO3F0                                     *
     *  DESCRIZIONE   : Storico dati prodotto.                       *
     *  PREFISSO      : BC3                                          *
     * =============================================================== *
     A            BC3STAT0       1A         COLHDG('Stato ..............')
     A            BC3IMUT0      10A         COLHDG('Immissione utente...')
     A            BC3IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC3IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC3IMPG0      10A         COLHDG('Immissione programma')
     A            BC3IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC3AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC3AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC3AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC3AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC3AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC3SOCI0       2A         COLHDG('Società ............')
      *
     A            BC3PROD0      15          COLHDG('Codice prodotto ....')
     A            BC3COMM0       1          COLHDG('Commercializzato ...')
     A            BC3MEIN0       1          COLHDG('M=medicato/I=integr.')
     A            BC3LIST0       2          COLHDG('Codice listino .....')
     A            BC3SETT0       2          COLHDG('Codice settore .....')
     A            BC3LINE0       2          COLHDG('Codice linea .......')
     A            BC3FORM0       2          COLHDG('Codice forma .......')
     A            BC3SPEC0       2          COLHDG('Codice specialità ..')
     A            BC3MARC0       2          COLHDG('Codice marchio .....')
     A            BC3DADO0       8  0       COLHDG('Data documento .....')
      *
     A            BC3FL010       2          COLHDG('Flag 01 ............')
     A            BC3FL020       2          COLHDG('Flag 02 ............')
     A            BC3FL030       2          COLHDG('Flag 03 ............')
     A            BC3FL040       2          COLHDG('Flag 04 ............')
     A            BC3FL050       2          COLHDG('Flag 05 ............')
     A            BC3FL060      10          COLHDG('Flag 06 ............')
     A            BC3FL070      10          COLHDG('Flag 07 ............')
     A            BC3FL080      10          COLHDG('Flag 08 ............')
     A            BC3FL090      10          COLHDG('Flag 09 ............')
     A            BC3FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCO4F0                                     *
     *  DESCRIZIONE   : Dettaglio voci.                              *
     *  PREFISSO      : BC4                                          *
     * =============================================================== *
     A            BC4STAT0       1A         COLHDG('Stato ..............')
     A            BC4IMUT0      10A         COLHDG('Immissione utente...')
     A            BC4IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC4IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC4IMPG0      10A         COLHDG('Immissione programma')
     A            BC4IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC4AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC4AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC4AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC4AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC4AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC4SOCI0       2A         COLHDG('Società ............')
      *
     A            BC4PROG0       9  0       COLHDG('Progressivo ........')
     A            BC4COVO0       4          COLHDG('Codice voce ........')
     A            BC4SEGN0       1          COLHDG('Segno "+" o "-" ....')
     A            BC4IMPO0      18  6       COLHDG('Importo voce .......')
      *
     A            BC4FL010       2          COLHDG('Flag 01 ............')
     A            BC4FL020       2          COLHDG('Flag 02 ............')
     A            BC4FL030       2          COLHDG('Flag 03 ............')
     A            BC4FL040       2          COLHDG('Flag 04 ............')
     A            BC4FL050       2          COLHDG('Flag 05 ............')
     A            BC4FL060      10          COLHDG('Flag 06 ............')
     A            BC4FL070      10          COLHDG('Flag 07 ............')
     A            BC4FL080      10          COLHDG('Flag 08 ............')
     A            BC4FL090      10          COLHDG('Flag 09 ............')
     A            BC4FL100      10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  TABELLA       : TABE52                                    *
     *  DESCRIZIONE   : Tipo record.                              *
     *  PREFISSO      : T52                                       *
     ****************************************************************
     A            T52DE0        40          COLHDG('Descrizione ........')
     ****************************************************************
     *  TABELLA       : TABE53                                    *
     *  DESCRIZIONE   : Voce                                      *
     *  PREFISSO      : T53                                       *
     ****************************************************************
     A            T53DE0        40          COLHDG('Descrizione ........')
     A            T53TP0         1          COLHDG('Tipologia voce .....')
     *                                             C=Costo  S=Sconto  M=Maggiorazione
     A            T53SG0         1          COLHDG('Segno "+" o "-" ....')
     ****************************************************************
     *  TABELLA       : TABE54                                    *
     *  DESCRIZIONE   : Raggruppamento 1.                         *
     *  PREFISSO      : T54                                       *
     ****************************************************************
     A            T54DE0        40          COLHDG('Descrizione ........')
     ****************************************************************
     *  TABELLA       : TABE55                                    *
     *  DESCRIZIONE   : Raggruppamento 2.                         *
     *  PREFISSO      : T55                                       *
     ****************************************************************
     A            T55DE0        40          COLHDG('Descrizione ........')
     ****************************************************************
     *  TABELLA       : TABE56                                    *
     *  DESCRIZIONE   : Raggruppamento 3.                         *
     *  PREFISSO      : T56                                       *
     ****************************************************************
     A            T56DE0        40          COLHDG('Descrizione ........')
     ****************************************************************
     *  ARCHIVIO      : MGZI41F0                                  *
     *  DESCRIZIONE   : Magazzinaggi INDESIL: % miscelazione.     *
     *  PREFISSO      : MMI                                       *
     ****************************************************************
     A            MMISTX0        1          COLHDG('Stato ..............')
     A            MMIUSX0       10A         COLHDG('Utente immissione...')
     A            MMIDAX0        8  0       COLHDG('Data immissione ....')
     A            MMIORX0        6  0       COLHDG('Ora immissione .....')
     A            MMICAZ0       10A         COLHDG('Codice azione ......')
     A            MMIPGI0       10A         COLHDG('Programma immissione')
     A            MMIUSA0       10A         COLHDG('Utente aggiornam....')
     A            MMIDAA0        8  0       COLHDG('Data aggiornam. ....')
     A            MMIORA0        6  0       COLHDG('Ora aggiornam. .....')
     A            MMICAV0       10A         COLHDG('Codice azione varia.')
     A            MMIPGV0       10A         COLHDG('Programma variazione')
     A            MMISOC0        2          COLHDG('Società ............')
      *
     A            MMIDAO0        8  0       COLHDG('Data ordine ........')
     A            MMISGO0        4          COLHDG('Sig. ordine ........')
     A            MMINRO0        9  0       COLHDG('nr.  ordine ........')
     A            MMIDOR0        8  0       COLHDG('Data ord.miscelaz...')
     A            MMISOR0        4          COLHDG('Sigla ord.miscelaz..')
     A            MMINOR0        9  0       COLHDG('Nume.ord.miscelaz...')
     A            MMIPER0        5  2       COLHDG('% miscelazione .....')
     A            MMIDAI0        8  0       COLHDG('Data inizio ........')
     A            MMIDAF0        8  0       COLHDG('Data fine ..........')
      *
     A            MMIF010        1          COLHDG('Flag 01 ............')
     A            MMIF020        1          COLHDG('Flag 02 ............')
     A            MMIF030        2          COLHDG('Flag 03 ............')
     A            MMIF040        2          COLHDG('Flag 04 ............')
     A            MMIF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MMIF060       10          COLHDG('Flag 06 ............')
     A            MMIF070        2          COLHDG('Flag 07 ............')
     A            MMIF080        2          COLHDG('Flag 08 ............')
     A            MMIF090        2          COLHDG('Flag 09 ............')
     A            MMIF100        2          COLHDG('Flag 10 ............')
     ********************************************************************
     *  ARCHIVIO      : ORDF38F0                                      *
     *  DESCRIZIONE   : Ordini fornitori: Declassamento materia prima *
     *  PREFISSO      : NOS                                           *
     ********************************************************************
     A            NOSSTX0        1          COLHDG('Stato ..............')
     A            NOSUSX0       10          COLHDG('Immissione utente...')
     A            NOSDAX0        8  0       COLHDG('Immissione data ....')
     A            NOSORX0        6  0       COLHDG('Immissione ora .....')
     A            NOSCAX0       10          COLHDG('Immissione azione...')
     A            NOSPGX0       10          COLHDG('Immissione programma')
     A            NOSUSA0       10          COLHDG('Aggiorname.utente...')
     A            NOSDAA0        8  0       COLHDG('Aggiorname.utente...')
     A            NOSORA0        6  0       COLHDG('Aggiorname.ora .....')
     A            NOSCAA0       10          COLHDG('Aggiorname.azione...')
     A            NOSPGA0       10          COLHDG('Aggiorname.programma')
     A            NOSSOC0        2          COLHDG('Società ............')
      *
     A            NOSSCO0        2S 0       COLHDG('Sec. ordine ........')
     A            NOSANO0        2S 0       COLHDG('aa.  ordine ........')
     A            NOSMSO0        2S 0       COLHDG('mm.  ordine ........')
     A            NOSGRO0        2S 0       COLHDG('gg.  ordine ........')
     A            NOSSGO0        4          COLHDG('Sig. ordine ........')
     A            NOSNRO0        9  0       COLHDG('nr.  ordine ........')
     A            NOSNRI0        4  0       COLHDG('nr.  riga ordine....')
     A            NOSNRP0        4  0       COLHDG('nr.progress.quota...')
      *                                       riguardante (ORDF33)
     A            NOSNRR0        4  0       COLHDG('nr.progress.disp....')
      *                                       riguardante (ORDF12)
     A            NOSNOO0        4  0       COLHDG('nr.progress.ordi....')
      *                                       riguardante (ORDF34)
     A            NOSNOE0        4  0       COLHDG('nr.  progressivo....')
     A            NOSPRO0       15          COLHDG('Prodotto declassato.')
     A            NOSSI10        6          COLHDG('Silos 1 ............')
     A            NOSQT10       12  3       COLHDG('Quantità 1 .........')
     A            NOSSI20        6          COLHDG('Silos 2 ............')
     A            NOSQT20       12  3       COLHDG('Quantità 2 .........')
     A            NOSDE10       60          COLHDG('Nota ...............')
     A            NOSDE20       60          COLHDG('Nota ...............')
     A            NOSSES0        9  0       COLHDG('Numero sessione ....')
     A            NOSNU10        4  0       COLHDG('Numero movimento ...')
     A            NOSNU20        4  0       COLHDG('Numero movimento ...')
     A            NOSF010        1          COLHDG('R = registrato......')
     A            NOSF020        1          COLHDG('Flag 02 ............')
     A            NOSF030        2          COLHDG('Flag 03 ............')
     A            NOSF040        2          COLHDG('Flag 04 ............')
     A            NOSF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            NOSF060       10          COLHDG('Flag 06 ............')
     A            NOSF070       10          COLHDG('Flag 07 ............')
     A            NOSF080        2          COLHDG('Flag 08 ............')
     A            NOSF090        2          COLHDG('Flag 09 ............')
     A            NOSF100        2          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : ANASILF0                                                               *
     *  DESCRIZIONE   : Anagrafico Silos                                                       *
     *  PREFISSO      : AA2                                                                    *
     * ========================================================================================= *
     A            AA2STX0        1          COLHDG('Stato ..............')
      *
     A            AA2USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA2DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA2ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA2CAZ0       10          COLHDG('Azione immissione...')
     A            AA2PGI0       10          COLHDG('Programma immissione')
     A            AA2USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA2DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA2ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA2CAA0       10          COLHDG('Azione modifica.....')
     A            AA2PGA0       10          COLHDG('Programma modifica..')
     A            AA2NRX0        9  0       COLHDG('Numero Azione ......')
      *
     A            AA2STB0        2          COLHDG('Stabilimento .......')
     A            AA2MAG0        3          COLHDG('Magazzino ..........')
     A            AA2LIN0        2          COLHDG('Linea ..............')
     A            AA2SIL0        6          COLHDG('Codice silos .......')
     A            AA2DES0       40          COLHDG('Descrizione ........')
     A            AA2ALC0        6          COLHDG('Altra codifica .....')
     A            AA2CAP0       18  6       COLHDG('Capacità MC totali..')
     A            AA2MLC0       18  6       COLHDG('Coeff.MTlin/MTcub...')
     A            AA2FOS0        2          COLHDG('Forma silos.........')
     *                                             CL - Cilindrico
     *                                             QD - Quadrato
     *                                             RE - Rettangolare
     *                                             SA - Saccone
     *                                             PI - Piano
     A            AA2MAS0        2          COLHDG('Materiale silos.....')
     *                                             ME - Metallico
     *                                             PL - Plastica
     *                                             CA - Cemento
     A            AA2CON0        2          COLHDG('Contenuto ..........')
     *                                             MP - Materia Prima
     *                                             SL - Semilavorato
     *                                             PF - Prodotto Finito
     *                                             ML - Materia Prima Liquidi
     A            AA2PRO0       15          COLHDG('Prodotto interno....')
     *    ---- Corpo principale.
     A            AA2ALT0        6  2       COLHDG('MT altezza .........')
     A            AA2LAR0        6  2       COLHDG('MT larghezza .......')
     A            AA2LUN0        6  2       COLHDG('MT lunghezza .......')
     A            AA2DIA0        6  2       COLHDG('MT diametro ........')
     *    ---- Cono 1.
     A            AA2AC10        6  2       COLHDG('MT altezza cono 1...')
     A            AA2MC10        6  2       COLHDG('MT area magg.cono 1.')
     A            AA2IC10        6  2       COLHDG('MT area mino.cono 1.')
     A            AA2CC10        6  2       COLHDG('MC cono 1 ..........')
     *    ---- Cono 2.
     A            AA2AC20        6  2       COLHDG('MT altezza cono 2...')
     A            AA2MC20        6  2       COLHDG('MT area magg.cono 2.')
     A            AA2IC20        6  2       COLHDG('MT area mino.cono 2.')
     A            AA2CC20        6  2       COLHDG('MC cono 2 ..........')
     *    ---- Cono 3.
     A            AA2AC30        6  2       COLHDG('MT altezza cono 3...')
     A            AA2MC30        6  2       COLHDG('MT area magg.cono 3.')
     A            AA2IC30        6  2       COLHDG('MT area mino.cono 3.')
     A            AA2CC30        6  2       COLHDG('MC cono 3 ..........')
     *    ---- Flags.
     A            AA2F010        2          COLHDG('Tipo Silos..........')
     *                                             1 - Stoccaggio
     *                                             2 - Macinazione
     *                                             3 - Farine
     *                                             4 - Dosaggio
     A            AA2F020        2          COLHDG('Forme coni 1-2 .....')
     A            AA2F030        2          COLHDG('Forme cono 3 .......')
     *                                             C - Tronco di cono.
     *                                             P - Tronco di piramide.
     *                                             I - Cilindro.
     *                                             A - Parallelepipedo.
     A            AA2F040        2          COLHDG('Metri da NON calcol.')
     *                                             1 intero e 1 decimale
     A            AA2F050        2          COLHDG('NO=non svuota ......')
     A            AA2F060        2          COLHDG('NO=non gest.riord.MP')
     A            AA2F070        2          COLHDG('S=crea file Elektron')
     A            AA2F080       10          COLHDG('Flag 08 ............')
     A            AA2F090       10          COLHDG('Flag 09 ............')
     A            AA2F100       10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : LISMAGF0                                                               *
     *  DESCRIZIONE   : Legame tra Listino e Magazzino                                         *
     *  PREFISSO      : LM2                                                                    *
     * ========================================================================================= *
     A            LM2STX0        1          COLHDG('Stato ..............')
      *
     A            LM2USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            LM2DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            LM2ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            LM2CAZ0       10          COLHDG('Azione immissione...')
     A            LM2PGI0       10          COLHDG('Programma immissione')
     A            LM2USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            LM2DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            LM2ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            LM2CAA0       10          COLHDG('Azione modifica.....')
     A            LM2PGA0       10          COLHDG('Programma modifica..')
     A            LM2NRX0        9  0       COLHDG('Numero Azione ......')
      *
     A            LM2LIS0        2          COLHDG('Cod. Listino .......')
     A            LM2MAG0        2          COLHDG('Magazzino ..........')
     * ========================================================================================= *
     *  ARCHIVIO      : SIGILLF0                                                               *
     *  DESCRIZIONE   : Archivio sigilli consegne Molino                                       *
     *  PREFISSO      : SI1                                                                    *
     * ========================================================================================= *
     A            SI1STX0        1          COLHDG('Stato ..............')
      *
     A            SI1USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            SI1DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            SI1ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            SI1CAZ0       10          COLHDG('Azione immissione...')
     A            SI1PGI0       10          COLHDG('Programma immissione')
     A            SI1USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            SI1DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            SI1ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            SI1CAA0       10          COLHDG('Azione modifica.....')
     A            SI1PGA0       10          COLHDG('Programma modifica..')
     *
     A            SI1DTO0        8  0       COLHDG('Data ordine.........')
     A            SI1NRO0        6  0       COLHDG('Numero ordine.......')
     A            SI1NRR0        6  0       COLHDG('Numero riga.........')
     A            SI1COC0        6          COLHDG('Codice cliente......')
     A            SI1NRD0        9  0       COLHDG('Numero sigillo da...')
     A            SI1NRA0        9  0       COLHDG('Numero sigilllo a...')
     A            SI1VIA0        6  0       COLHDG('Numero foglio viagg.')
     *    ---- Flags.
     A            SI1F010        2          COLHDG('Flag 01 ............')
     A            SI1F020        2          COLHDG('Flag 02 ............')
     A            SI1F030        2          COLHDG('Flag 03 ............')
     A            SI1F040        2          COLHDG('Flag 04 ............')
     A            SI1F050        2          COLHDG('Flag 05 ............')
     A            SI1F060        2          COLHDG('Flag 06 ............')
     A            SI1F070        2          COLHDG('Flag 07 ............')
     A            SI1F080       10          COLHDG('Flag 08 ............')
     A            SI1F090       10          COLHDG('Flag 09 ............')
     A            SI1F100       10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : ANALINF0                                                               *
     *  DESCRIZIONE   : Anagrafico linee prodotto.                                             *
     *  PREFISSO      : AA3                                                                    *
     * ========================================================================================= *
     A            AA3STX0        1          COLHDG('Stato ..............')
      *
     A            AA3USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA3DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA3ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA3CAZ0       10          COLHDG('Azione immissione...')
     A            AA3PGI0       10          COLHDG('Programma immissione')
     A            AA3USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA3DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA3ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA3CAA0       10          COLHDG('Azione modifica.....')
     A            AA3PGA0       10          COLHDG('Programma modifica..')
     *
     A            AA3CVT0        3          COLHDG('Codice vecchia tabe.')
     A            AA3LIN0        2          COLHDG('Codice linea .......')
     A            AA3DES0       40          COLHDG('Descrizione linea...')
     A            AA3RG10        3          COLHDG('Raggruppamento 1 ...')
     A            AA3RG20        1          COLHDG('Raggruppamento 2 ...')
     A            AA3MCO0       10  6       COLHDG('Margine contribuzio.')
     *    ---- Flags.
     A            AA3F010        2          COLHDG('Flag 01 ............')
     A            AA3F020        2          COLHDG('Flag 02 ............')
     A            AA3F030        2          COLHDG('Flag 03 ............')
     A            AA3F040        2          COLHDG('Flag 04 ............')
     A            AA3F050        2          COLHDG('Flag 05 ............')
     A            AA3F060        2          COLHDG('Flag 06 ............')
     A            AA3F070        2          COLHDG('Flag 07 ............')
     A            AA3F080       10          COLHDG('Flag 08 ............')
     A            AA3F090       10          COLHDG('Flag 09 ............')
     A            AA3F100       10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : ANLIVEF0                                                               *
     *  DESCRIZIONE   : Archivio per analisi listini di vendita.                               *
     *  PREFISSO      : AA4                                                                    *
     * ========================================================================================= *
     A            AA4STX0        1          COLHDG('Stato ..............')
      *
     A            AA4USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA4DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA4ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA4CAZ0       10          COLHDG('Azione immissione...')
     A            AA4PGI0       10          COLHDG('Programma immissione')
     A            AA4USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA4DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA4ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA4CAA0       10          COLHDG('Azione modifica.....')
     A            AA4PGA0       10          COLHDG('Programma modifica..')
     *
     A            AA4STB0        3          COLHDG('Stabilimento .......')
     A            AA4MAG0        3          COLHDG('Magazzino ..........')
     A            AA4PRO0       15          COLHDG('Codice prodotto ....')
     A            AA4LIN0        2          COLHDG('Linea  prodotto ....')
     A            AA4DES0       40          COLHDG('Descrizione ........')
     A            AA4UNI0        2          COLHDG('Unità di misura ....')
     A            AA4VOV0       12  2       COLHDG('Volumi di vendita ..')
     A            AA4TOV0       12  2       COLHDG('Totale dei volumi ..')
     *
     A            AA4RIC0       15  6       COLHDG('Ricavo netto .......')
     A            AA4COF0       15  6       COLHDG('Costo formula ......')
     A            AA4IN30       15  6       COLHDG('Incr.3% su cost.for.')
     A            AA4IMB0       15  6       COLHDG('Costi imballo ......')
     A            AA4FAC0       15  6       COLHDG('Costi facchinaggio..')
     A            AA4MAP0       15  6       COLHDG('Mano d''opera ......')
     A            AA4PRI0       15  6       COLHDG('Importo provvigioni.')
     A            AA4PRP0       15  6       COLHDG('% provvigioni ......')
     A            AA4IN10       15  6       COLHDG('Incr.1,5% su costi..')
     A            AA4CNT0       15  6       COLHDG('Contribuz.del perio.')
     A            AA4COT0       15  6       COLHDG('Costo totale .......')
     A            AA4PRL0       15  6       COLHDG('Prezzo listino .....')
     A            AA4PRM0       15  6       COLHDG('Prezzo medio di ven.')
     A            AA4FEM0        9  0       COLHDG('Totale fatture emess')
     A            AA4NEM0        9  0       COLHDG('Totale not.cre.emess')
     *    ---- Flags.
     A            AA4F010        2          COLHDG('Flag 01 ............')
     A            AA4F020        2          COLHDG('Flag 02 ............')
     A            AA4F030        2          COLHDG('Flag 03 ............')
     A            AA4F040        2          COLHDG('Flag 04 ............')
     A            AA4F050        2          COLHDG('Flag 05 ............')
     A            AA4F060        2          COLHDG('Flag 06 ............')
     A            AA4F070        2          COLHDG('Flag 07 ............')
     A            AA4F080       10          COLHDG('Flag 08 ............')
     A            AA4F090       10          COLHDG('Flag 09 ............')
     A            AA4F100       10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : INVFISF0                                                               *
     *  DESCRIZIONE   : Archivio Inventario Fisico.  (nuovo)                                   *
     *  PREFISSO      : AA5                                                                    *
     * ========================================================================================= *
     A            AA5STX0        1          COLHDG('Stato ..............')
      *
     A            AA5USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA5DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA5ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA5CAZ0       10          COLHDG('Azione immissione...')
     A            AA5PGI0       10          COLHDG('Programma immissione')
     A            AA5USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA5DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA5ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA5CAA0       10          COLHDG('Azione modifica.....')
     A            AA5PGA0       10          COLHDG('Programma modifica..')
     *
     A            AA5STB0        3          COLHDG('Stabilimento .......')
     A            AA5MAG0        3          COLHDG('Magazzino ..........')
     A            AA5DTI0        8  0       COLHDG('Data Inventario ....')
     A            AA5NBL0        6  0       COLHDG('Nr Blocco ..........')
     A            AA5NFO0        6  0       COLHDG('Nr Foglio ..........')
     A            AA5PRO0       15          COLHDG('Codice prodotto ....')
     A            AA5LOT0        9  0       COLHDG('Nr Lotto ...........')
     A            AA5UN10        2          COLHDG('Un. mis. inventario.')
     A            AA5QTA0       13  2       COLHDG('Quantità inventario.')
     A            AA5UN20        2          COLHDG('Un. mis. stoccaggio.')
     A            AA5QTM0       13  2       COLHDG('Quantità stoccaggio.')
     A            AA5PRD0        2          COLHDG('DF=defin.PR=provvis.')
     A            AA5NRS0        9  0       COLHDG('Numero sessione ....')
     A            AA5NRM0        4  0       COLHDG('Numero movimento....')
     A            AA5NPA0        5  0       COLHDG('Numero di pallet....')
     A            AA5UBI0        4          COLHDG('Codice ubicazione...')
     A            AA5PRG0        9  0       COLHDG('Num progressivo ....')
     *    ---- Flags.
     A            AA5F010        2          COLHDG('Tipo Prod. MP,PF,SL.')
     A            AA5F020        2          COLHDG('Flag 02 ............')
     A            AA5F030        2          COLHDG('Flag 03 ............')
     A            AA5F040        2          COLHDG('Flag 04 ............')
     A            AA5F050        2          COLHDG('Flag 05 ............')
     A            AA5F060        2          COLHDG('Flag 06 ............')
     A            AA5F070        2          COLHDG('Flag 07 ............')
     A            AA5F080       10          COLHDG('Cod.Silos ..........')
     A            AA5F090       10          COLHDG('Flag 09 ............')
     A            AA5F100       10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : AGETRAF0                                                               *
     *  DESCRIZIONE   : Associazione tra agente e conto transitorio.                           *
     *  PREFISSO      : AA6                                                                    *
     * ========================================================================================= *
     A            AA6STX0        1          COLHDG('Stato ..............')
      *
     A            AA6USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA6DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA6ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA6CAZ0       10          COLHDG('Azione immissione...')
     A            AA6PGI0       10          COLHDG('Programma immissione')
     A            AA6USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA6DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA6ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA6CAA0       10          COLHDG('Azione modifica.....')
     A            AA6PGA0       10          COLHDG('Programma modifica..')
     *
     A            AA6AGE0        3          COLHDG('Codice agente.......')
     A            AA6CON0       12          COLHDG('Conto transitorio...')
     A            AA6CCB0       12          COLHDG('Conto banca ........')
     A            AA6CBB0        8          COLHDG('Codice conto banca..')
     A            AA6NOT0       60          COLHDG('Annotazioni.........')
     *    ---- Flags.
     A            AA6F010        2          COLHDG('Flag 01 ............')
     A            AA6F020        2          COLHDG('Flag 02 ............')
     A            AA6F030        2          COLHDG('Flag 03 ............')
     A            AA6F040        2          COLHDG('Flag 04 ............')
     A            AA6F050        2          COLHDG('Flag 05 ............')
     A            AA6F060        2          COLHDG('Flag 06 ............')
     A            AA6F070        2          COLHDG('Flag 07 ............')
     A            AA6F080       10          COLHDG('Flag 08 ............')
     A            AA6F090       10          COLHDG('Flag 09 ............')
     A            AA6F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCOPF0                                     *
     *  DESCRIZIONE   : Contribuzione per prodotto.                  *
     *  PREFISSO      : BC5                                          *
     * =============================================================== *
     A            BC5STAT0       1A         COLHDG('Stato ..............')
     A            BC5IMUT0      10A         COLHDG('Immissione utente...')
     A            BC5IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC5IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC5IMPG0      10A         COLHDG('Immissione programma')
     A            BC5IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC5AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC5AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC5AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC5AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC5AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC5SOCI0       2A         COLHDG('Società ............')
      *
     A            BC5ANNO0       4  0       COLHDG('Anno validità ......')
     A            BC5REVI0       3  0       COLHDG('Numero revisione ...')
     A            BC5MERC0       2          COLHDG('Mercato ............')
     A            BC5PROD0      15          COLHDG('Prodotto ...........')
     A            BC5CONT0      18  8       COLHDG('Contribuzione ......')
     A            BC5CON20      18  8       COLHDG('Contribuzione 2 ....')
      *
     A            BC5FL010       2          COLHDG('Flag 01 ............')
     A            BC5FL020       2          COLHDG('Flag 02 ............')
     A            BC5FL030       2          COLHDG('Flag 03 ............')
     A            BC5FL040       2          COLHDG('Flag 04 ............')
     A            BC5FL050       2          COLHDG('Flag 05 ............')
     A            BC5FL060      10          COLHDG('Flag 06 ............')
     A            BC5FL070      10          COLHDG('Flag 07 ............')
     A            BC5FL080      10          COLHDG('Flag 08 ............')
     A            BC5FL090      10          COLHDG('Flag 09 ............')
     A            BC5FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCODF0                                     *
     *  DESCRIZIONE   : Contribuzione per prodotto (data).           *
     *  PREFISSO      : BC6                                          *
     * =============================================================== *
     A            BC6STAT0       1A         COLHDG('Stato ..............')
     A            BC6IMUT0      10A         COLHDG('Immissione utente...')
     A            BC6IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC6IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC6IMPG0      10A         COLHDG('Immissione programma')
     A            BC6IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC6AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC6AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC6AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC6AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC6AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC6SOCI0       2A         COLHDG('Società ............')
      *
     A            BC6STAB0       3A         COLHDG('Stabilimento .......')
     A            BC6MAGA0       3A         COLHDG('Magazzino ..........')
     A            BC6DAVA0       8  0       COLHDG('Data validità ......')
      *
     A            BC6FL010       2          COLHDG('Flag 01 ............')
     A            BC6FL020       2          COLHDG('Flag 02 ............')
     A            BC6FL030       2          COLHDG('Flag 03 ............')
     A            BC6FL040       2          COLHDG('Flag 04 ............')
     A            BC6FL050       2          COLHDG('Flag 05 ............')
     A            BC6FL060      10          COLHDG('Flag 06 ............')
     A            BC6FL070      10          COLHDG('Flag 07 ............')
     A            BC6FL080      10          COLHDG('Flag 08 ............')
     A            BC6FL090      10          COLHDG('Flag 09 ............')
     A            BC6FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LEGBASF0                                     *
     *  DESCRIZIONE   : Legame premiscele prodotti finiti.           *
     *  PREFISSO      : BC7                                          *
     * =============================================================== *
     A            BC7STAT0       1A         COLHDG('Stato ..............')
     A            BC7IMUT0      10A         COLHDG('Immissione utente...')
     A            BC7IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC7IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC7IMPG0      10A         COLHDG('Immissione programma')
     A            BC7IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC7AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC7AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC7AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC7AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC7AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC7SOCI0       2A         COLHDG('Società ............')
      *
     A            BC7STAB0       3          COLHDG('Stabilimento .......')
     A            BC7MAGA0       3          COLHDG('Magazzino ..........')
     A            BC7PROB0      15          COLHDG('Prodotto "base".....')
     A            BC7LOTB0       9  0       COLHDG('Lotto AS "base".....')
     A            BC7DATB0       8  0       COLHDG('Data  AS "base".....')
     A            BC7QTAB0      12  2       COLHDG('Q.tà lot."base".....')
     A            BC7PROP0      15          COLHDG('Prodotto "prod.fin".')
     A            BC7LOTP0       9  0       COLHDG('Lotto AS "prod.fin".')
     A            BC7DATP0       8  0       COLHDG('Data  AS "Prod.fin".')
     A            BC7QTAP0      12  2       COLHDG('Q.tà lot."prod.fin".')
     A            BC7QTAU0      12  2       COLHDG('Q.tà usata .........')
     A            BC7CHIU0       2          COLHDG('"SI"=chiuso.........')
     A            BC7ELAB0       2          COLHDG('"SI"=elaborato......')
      *
     A            BC7FL010       2          COLHDG('Flag 01 ............')
     A            BC7FL020       2          COLHDG('Flag 02 ............')
     A            BC7FL030       2          COLHDG('Flag 03 ............')
     A            BC7FL040       2          COLHDG('Flag 04 ............')
     A            BC7FL050       2          COLHDG('Flag 05 ............')
     A            BC7FL060      10          COLHDG('Flag 06 ............')
     A            BC7FL070      10          COLHDG('Flag 07 ............')
     A            BC7FL080      10          COLHDG('Flag 08 ............')
     A            BC7FL090      10          COLHDG('Flag 09 ............')
     A            BC7FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : CPTRA1F0                                     *
     *  DESCRIZIONE   : Contratti Sottozone Per trasportaore         *
     *  PREFISSO      : BC8                                          *
     * =============================================================== *
     A            BC8STAT0       1A         COLHDG('Stato ..............')
     A            BC8IMUT0      10A         COLHDG('Immissione utente...')
     A            BC8IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC8IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC8IMPG0      10A         COLHDG('Immissione programma')
     A            BC8IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC8AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC8AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC8AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC8AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC8AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC8SOCI0       2A         COLHDG('Società ............')
      *
     A            BC8STAB0       2          COLHDG('Stabilimento .......')
     A            BC8VETT0       4          COLHDG('Vettore ............')
     A            BC8ZONA0       5          COLHDG('Zona Consegna ......')
     A            BC8SZON0       5          COLHDG('Sottozona consegna..')
     A            BC8EQLA0      18  8       COLHDG('Euro q.le andata ...')
     A            BC8EURA0      18  8       COLHDG('Euro forfait andata.')
     A            BC8FACC0       2          COLHDG('Val.facchin. SI/NO .')
     A            BC8PALL0       2          COLHDG('Val.Pallett. SI/NO .')
     A            BC8SCAR0       2          COLHDG('Val.Scarico  SI/NO .')
     A            BC8PENT0      18  8       COLHDG('Penale add.trasport.')
     A            BC8EQLR0      18  8       COLHDG('Euro q.le ritorno...')
     A            BC8EURR0      18  8       COLHDG('Euro forfait ritorno')
      *
     A            BC8FL010       2          COLHDG('Flag 01 ............')
     A            BC8FL020       2          COLHDG('Flag 02 ............')
     A            BC8FL030       2          COLHDG('Flag 03 ............')
     A            BC8FL040       2          COLHDG('Flag 04 ............')
     A            BC8FL050       2          COLHDG('Flag 05 ............')
     A            BC8FL060      10          COLHDG('Flag 06 ............')
     A            BC8FL070      10          COLHDG('Flag 07 ............')
     A            BC8FL080      10          COLHDG('Flag 08 ............')
     A            BC8FL090      10          COLHDG('Flag 09 ............')
     A            BC8FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : VLTRA1F0                                     *
     *  DESCRIZIONE   : Valorizzazione trasporti:                     *
     *                : Valorizza il costo della zona del trasportat. *
     *                : e/o zona dei clienti                          *
     *  PREFISSO      : BC9                                          *
     * =============================================================== *
     A            BC9STAT0       1A         COLHDG('Stato ..............')
     A            BC9IMUT0      10A         COLHDG('Immissione utente...')
     A            BC9IMDA0       8  0       COLHDG('Immissione data ....')
     A            BC9IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BC9IMPG0      10A         COLHDG('Immissione programma')
     A            BC9IMAZ0      10A         COLHDG('Immissione azione...')
     A            BC9AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BC9AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BC9AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BC9AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BC9AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BC9SOCI0       2A         COLHDG('Società ............')
      *
     A            BC9FLAR0       1          COLHDG('A.Andata R.Ritorno .')
     A            BC9NVIA0       9  0       COLHDG('Numero Viaggio .....')
     A            BC9TCON0       1          COLHDG('Tipo consegna ......')
      *                                     R. Riconsegna
      *                                     D. Diretta
      *
     A            BC9DTVI0       8  0       COLHDG('Data Viaggio........')
     A            BC9STAB0       2          COLHDG('Stabilimento Part ..')
     A            BC9VETT0       4          COLHDG('Vettore ............')
     A            BC9ZONT0       5          COLHDG('Zona Trasportatore..')
      *
     A            BC9EQLT0      18  8       COLHDG('Euro q.le ..........')
     A            BC9EURF0      18  8       COLHDG('Euro forfait .......')
     A            BC9PENT0      18  8       COLHDG('Penale add.trasport.')
     A            BC9RIMT0      18  8       COLHDG('Rimborso   trasport.')
     A            BC9SCON0      18  8       COLHDG('Euro sconto.........')
     A            BC9EURR0      18  8       COLHDG('Euro Riconsegne ....')
     A            BC9PEST0      18  8       COLHDG('Peso Valorizzato....')
      *
     A            BC9FACT0       2          COLHDG('Val.facchin. SI/NO .')
     A            BC9FEQT0      18  8       COLHDG('Euro q.le facchinato')
     A            BC9FPET0      18  8       COLHDG('Peso      facchinato')
     A            BC9FEUT0      18  8       COLHDG('Euro tot. Facchinato')
      *
     A            BC9PALT0       2          COLHDG('Val.Pallett. SI/NO .')
     A            BC9PEQT0      18  8       COLHDG('Euro q.le pallet    ')
     A            BC9PPET0      18  8       COLHDG('Peso      pallet    ')
     A            BC9PEUT0      18  8       COLHDG('Euro tot. pallet    ')
      *
     A            BC9SCAT0       2          COLHDG('Val.Scarico  SI/NO .')
     A            BC9KM1T0       9  0       COLHDG('Km. percorsi .......')
     A            BC9KM2T0       9  0       COLHDG('Km. scarichi .......')
     A            BC9KM3T0       9  0       COLHDG('Km. aggiuntivi .....')
     A            BC9NSCT0       5  0       COLHDG('Numero scarichi ....')
     A            BC9IMSC0      18  8       COLHDG('Euro q.le scarico...')
     *
     A            BC9EUTR0      18  8       COLHDG('Euro q.le trasbordo ')
     A            BC9QTTR0      18  8       COLHDG('Q.tà trasbordo...KG.')
     A            BC9IMTR0      18  8       COLHDG('Euro tot. trasbordo ')
     *
     A            BC9EURE0      18  8       COLHDG('Euro q.le reso..... ')
     A            BC9QTRE0      18  8       COLHDG('Q.tà reso........KG.')
     A            BC9IMRE0      18  8       COLHDG('Euro tot. reso..... ')
     *
     A            BC9SFUS0       1          COLHDG('S.Sfusi I.Sacchi    ')
     A            BC9FORN0       6          COLHDG('Fornitore ..........')
     A            BC9TMEZ0       2          COLHDG('Tipo automezzo .....')
     A            BC9TARG0       8          COLHDG('Targa  Automezzo ...')
     A            BC9PORM0       5  0       COLHDG('Portata Motrice.....')
     A            BC9PORR0       5  0       COLHDG('Portata Rimorchio...')
     A            BC9CLAS0       5  0       COLHDG('Classe Automezzo ...')
     *
     A            BC9EURT0      18  8       COLHDG('Totale Valorizzaz. .')
     A            BC9IMVI0      18  8       COLHDG('Importo Viaggio... .')
     *
     A            BC9QTLO0      18  8       COLHDG('Quantità lorda..KG .')
     A            BC9QTCA0      18  8       COLHDG('Q.tà per calcolo KG.')
     *
     A            BC9FL010       2          COLHDG('Consolidato = SI....')
     A            BC9FL020       2          COLHDG('Flag 02 ............')
     A            BC9FL030       2          COLHDG('Flag 03 ............')
     A            BC9FL040       2          COLHDG('Flag 04 ............')
     A            BC9FL050       2          COLHDG('Flag 05 ............')
     A            BC9FL060      10          COLHDG('Flag 06 ............')
     A            BC9FL070      10          COLHDG('Flag 07 ............')
     A            BC9FL080      10          COLHDG('Flag 08 ............')
     A            BC9FL090      10          COLHDG('Flag 09 ............')
     A            BC9FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : VLTRA2F0                                     *
     *  DESCRIZIONE   : Valorizzazione trasporti:                     *
     *                : Valorizza il costo delle sottozone clienti    *
     *                : per le riconsegne                             *
     *  PREFISSO      : BCF                                          *
     * =============================================================== *
     A            BCFSTAT0       1A         COLHDG('Stato ..............')
     A            BCFIMUT0      10A         COLHDG('Immissione utente...')
     A            BCFIMDA0       8  0       COLHDG('Immissione data ....')
     A            BCFIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BCFIMPG0      10A         COLHDG('Immissione programma')
     A            BCFIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCFAGUT0      10A         COLHDG('Aggiornamento utente')
     A            BCFAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BCFAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BCFAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BCFAGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BCFSOCI0       2A         COLHDG('Società ............')
      *
     A            BCFFLAR0       1          COLHDG('A.Andata R.Ritorno .')
     A            BCFNVIA0       9  0       COLHDG('Numero Viaggio .....')
     A            BCFTCON0       1          COLHDG('Tipo consegna ......')
      *                                     R. Riconsegna
      *                                     D. Diretta
      *
     A            BCFNRCO0       3  0       COLHDG('Numero Consegna.....')
     A            BCFDTVI0       8  0       COLHDG('Data Viaggio........')
     A            BCFSTAB0       2          COLHDG('Stabilimento Part ..')
     A            BCFVETT0       4          COLHDG('Vettore ............')
     A            BCFZONT0       5          COLHDG('Zona Trasportatore..')
      *
     A            BCFEQLT0      18  8       COLHDG('Euro q.le ..........')
     A            BCFEURF0      18  8       COLHDG('Euro forfait .......')
     A            BCFPENT0      18  8       COLHDG('Penale add.trasport.')
     A            BCFRIMT0      18  8       COLHDG('Rimborso   trasport.')
     A            BCFSCON0      18  8       COLHDG('Euro sconto.........')
     A            BCFEURR0      18  8       COLHDG('Euro Riconsegne ....')
     A            BCFPEST0      18  8       COLHDG('Peso Valorizzato....')
      *
     A            BCFFACT0       2          COLHDG('Val.facchin. SI/NO .')
     A            BCFFEQT0      18  8       COLHDG('Euro q.le facchinato')
     A            BCFFPET0      18  8       COLHDG('Peso      facchinato')
     A            BCFFEUT0      18  8       COLHDG('Euro tot. Facchinato')
      *
     A            BCFPALT0       2          COLHDG('Val.Pallett. SI/NO .')
     A            BCFPEQT0      18  8       COLHDG('Euro q.le pallet    ')
     A            BCFPPET0      18  8       COLHDG('Peso      pallet    ')
     A            BCFPEUT0      18  8       COLHDG('Euro tot. pallet    ')
      *
     A            BCFSCAT0       2          COLHDG('Val.Scarico  SI/NO .')
     A            BCFKM1T0       9  0       COLHDG('Km. percorsi .......')
     A            BCFKM2T0       9  0       COLHDG('Km. scarichi .......')
     A            BCFKM3T0       9  0       COLHDG('Km. aggiuntivi .....')
     A            BCFNSCT0       5  0       COLHDG('Numero scarichi ....')
     A            BCFIMSC0      18  8       COLHDG('Euro q.le scarico...')
     *
     A            BCFEUTR0      18  8       COLHDG('Euro q.le trasbordo ')
     A            BCFQTTR0      18  8       COLHDG('Q.tà trasbordo...KG.')
     A            BCFIMTR0      18  8       COLHDG('Euro tot. trasbordo ')
     *
     A            BCFEURE0      18  8       COLHDG('Euro q.le reso..... ')
     A            BCFQTRE0      18  8       COLHDG('Q.tà reso........KG.')
     A            BCFIMRE0      18  8       COLHDG('Euro tot. reso..... ')
     *
     A            BCFSFUS0       1          COLHDG('S.Sfusi I.Sacchi    ')
     A            BCFFORN0       6          COLHDG('Fornitore ..........')
     A            BCFTMEZ0       2          COLHDG('Tipo automezzo .....')
     A            BCFTARG0       8          COLHDG('Targa  Automezzo ...')
     A            BCFPORM0       5  0       COLHDG('Portata Motrice.....')
     A            BCFPORR0       5  0       COLHDG('Portata Rimorchio...')
     A            BCFCLAS0       5  0       COLHDG('Classe Automezzo ...')
     *
     A            BCFEURT0      18  8       COLHDG('Totale Valorizzaz. .')
     A            BCFIMVI0      18  8       COLHDG('Importo Viaggio... .')
     *
     A            BCFQTLO0      18  8       COLHDG('Quantità lorda..KG .')
     A            BCFQTCA0      18  8       COLHDG('Q.tà per calcolo KG.')
     *
     A            BCFFL010       2          COLHDG('Flag 01 ............')
     A            BCFFL020       2          COLHDG('Stabil.Riconsegna...')
     A            BCFFL030       2          COLHDG('Flag 03 ............')
     A            BCFFL040       2          COLHDG('Flag 04 ............')
     A            BCFFL050       2          COLHDG('Flag 05 ............')
     A            BCFFL060      10          COLHDG('Flag 06 ............')
     A            BCFFL070      10          COLHDG('Flag 07 ............')
     A            BCFFL080      10          COLHDG('Flag 08 ............')
     A            BCFFL090      10          COLHDG('Flag 09 ............')
     A            BCFFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : COSTEWF0                                     *
     *  DESCRIZIONE   : Costi telefonici mensili WORK                *
     *  PREFISSO      : BCA                                          *
     * =============================================================== *
     A            BCAFORN0       6          COLHDG('Fornitore ..........')
     A            BCANOMI0      40          COLHDG('Nominativo .........')
     A            BCACSIM0      10          COLHDG('Codice Sim .........')
     A            BCAEURO0       4          COLHDG('Euro competenza ....')
     * =============================================================== *
     *  ARCHIVIO      : COSTELF0                                     *
     *  DESCRIZIONE   : Costi telefonici mensili                     *
     *  PREFISSO      : BCB                                          *
     * =============================================================== *
     A            BCBSTAT0       1A         COLHDG('Stato ..............')
     A            BCBIMUT0      10A         COLHDG('Immissione utente...')
     A            BCBIMDA0       8  0       COLHDG('Immissione data ....')
     A            BCBIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BCBIMPG0      10A         COLHDG('Immissione programma')
     A            BCBIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCBAGUT0      10A         COLHDG('Aggiornamento utente')
     *
     A            BCBANNO0       4S 0       COLHDG('Anno competenza ....')
     A            BCBMESE0       2S 0       COLHDG('Mese competenza ....')
     A            BCBFORN0       6          COLHDG('Fornitore ..........')
     A            BCBNOMI0      40          COLHDG('Nominativo .........')
     A            BCBCSIM0      10          COLHDG('Codice Sim .........')
     A            BCBEURO0      18  8       COLHDG('Euro competenza ....')
     *
     A            BCBDAMO0       8  0       COLHDG('Data Movimento .....')
     A            BCBNUMO0       9  0       COLHDG('Numero movimento....')
     A            BCBRIGA0       5  0       COLHDG('Riga Movimento .....')
     A            BCBRIGM0       3  0       COLHDG('Riga Movimento Anal.')
     A            BCBCCOA0      12          COLHDG('Centro di costo ....')
     A            BCBPVSP0       1          COLHDG('Prefisso voce di sp.')
     A            BCBVSPE0      12          COLHDG('Voce di spesa ......')
     *
     A            BCBFL010       2          COLHDG('SI. Accodato in Moan')
     A            BCBFL020       2          COLHDG('Segno D/A...........')
     A            BCBFL030       2          COLHDG('Flag 03 ............')
     A            BCBFL040       2          COLHDG('Flag 04 ............')
     A            BCBFL050       2          COLHDG('Flag 05 ............')
     A            BCBFL060      10          COLHDG('Flag 06 ............')
     A            BCBFL070      10          COLHDG('Flag 07 ............')
     A            BCBFL080      10          COLHDG('Flag 08 ............')
     A            BCBFL090      10          COLHDG('Flag 09 ............')
     A            BCBFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : COSAUTF0                                     *
     *  DESCRIZIONE   : Costi canoni auto mensili                    *
     *  PREFISSO      : BCG                                          *
     * =============================================================== *
     A            BCGSTAT0       1A         COLHDG('Stato ..............')
     A            BCGIMUT0      10A         COLHDG('Immissione utente...')
     A            BCGIMDA0       8  0       COLHDG('Immissione data ....')
     A            BCGIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BCGIMPG0      10A         COLHDG('Immissione programma')
     A            BCGIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCGAGUT0      10A         COLHDG('Aggiornamento utente')
     *
     A            BCGANNO0       4S 0       COLHDG('Anno competenza ....')
     A            BCGMESE0       2S 0       COLHDG('Mese competenza ....')
     A            BCGFORN0       6          COLHDG('Fornitore ..........')
     A            BCGNOMI0      40          COLHDG('Nominativo .........')
     A            BCGTARG0      10          COLHDG('Codice Targa........')
     A            BCGEURO0      18  8       COLHDG('Euro competenza ....')
     *
     A            BCGDAMO0       8  0       COLHDG('Data Movimento .....')
     A            BCGNUMO0       9  0       COLHDG('Numero movimento....')
     A            BCGRIGA0       5  0       COLHDG('Riga Movimento .....')
     A            BCGRIGM0       3  0       COLHDG('Riga Movimento Anal.')
     A            BCGCCOA0      12          COLHDG('Centro di costo ....')
     A            BCGPVSP0       1          COLHDG('Prefisso voce di sp.')
     A            BCGVSPE0      12          COLHDG('Voce di spesa ......')
     *
     A            BCGFL010       2          COLHDG('SI. Accodato in Moan')
     A            BCGFL020       2          COLHDG('Segno D/A...........')
     A            BCGFL030       2          COLHDG('Flag 03 ............')
     A            BCGFL040       2          COLHDG('Flag 04 ............')
     A            BCGFL050       2          COLHDG('Flag 05 ............')
     A            BCGFL060      10          COLHDG('Flag 06 ............')
     A            BCGFL070      10          COLHDG('Flag 07 ............')
     A            BCGFL080      10          COLHDG('Flag 08 ............')
     A            BCGFL090      10          COLHDG('Flag 09 ............')
     A            BCGFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TBCCFSF0                                     *
     *  DESCRIZIONE   : Tabella centri di costo/fornitori SIM        *
     *  PREFISSO      : BCC                                          *
     * =============================================================== *
     A            BCCSTAT0       1A         COLHDG('Stato ..............')
     A            BCCIMUT0      10A         COLHDG('Immissione utente...')
     A            BCCIMDA0       8  0       COLHDG('Immissione data ....')
     A            BCCIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BCCIMPG0      10A         COLHDG('Immissione programma')
     A            BCCIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCCAGUT0      10A         COLHDG('Aggiornamento utente')
     *
     A            BCCCSIM0      10          COLHDG('Codice Sim .........')
     A            BCCFORN0       6          COLHDG('Fornitore ..........')
     *
     A            BCCCCOA0      12          COLHDG('Centro di costo ....')
     A            BCCPVSP0       1          COLHDG('Prefisso voce di sp.')
     A            BCCCSPE0      12          COLHDG('Voce di spesa ......')
     *
     A            BCCFL010       2          COLHDG('Flag 01 ............')
     A            BCCFL020       2          COLHDG('Flag 02 ............')
     A            BCCFL030       2          COLHDG('Flag 03 ............')
     A            BCCFL040       2          COLHDG('Flag 04 ............')
     A            BCCFL050       2          COLHDG('Flag 05 ............')
     A            BCCFL060      10          COLHDG('Flag 06 ............')
     A            BCCFL070      10          COLHDG('Flag 07 ............')
     A            BCCFL080      10          COLHDG('Flag 08 ............')
     A            BCCFL090      10          COLHDG('Flag 09 ............')
     A            BCCFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TBCCFAF0                                     *
     *  DESCRIZIONE   : Tabella centri di costo/fornitori Automezzi  *
     *  PREFISSO      : BCD                                          *
     * =============================================================== *
     A            BCDSTAT0       1A         COLHDG('Stato ..............')
     A            BCDIMUT0      10A         COLHDG('Immissione utente...')
     A            BCDIMDA0       8  0       COLHDG('Immissione data ....')
     A            BCDIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BCDIMPG0      10A         COLHDG('Immissione programma')
     A            BCDIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCDAGUT0      10A         COLHDG('Aggiornamento utente')
     *
     A            BCDTARG0      15          COLHDG('Targa automezzo ....')
     A            BCDFORN0       6          COLHDG('Fornitore ..........')
     *
     A            BCDCCOA0      12          COLHDG('Centro di costo ....')
     A            BCDPVSP0       1          COLHDG('Prefisso voce di sp.')
     A            BCDCSPE0      12          COLHDG('Voce di spesa ......')
     *
     A            BCDFL010       2          COLHDG('Flag 01 ............')
     A            BCDFL020       2          COLHDG('Flag 02 ............')
     A            BCDFL030       2          COLHDG('Flag 03 ............')
     A            BCDFL040       2          COLHDG('Flag 04 ............')
     A            BCDFL050       2          COLHDG('Flag 05 ............')
     A            BCDFL060      10          COLHDG('Flag 06 ............')
     A            BCDFL070      10          COLHDG('Flag 07 ............')
     A            BCDFL080      10          COLHDG('Flag 08 ............')
     A            BCDFL090      10          COLHDG('Flag 09 ............')
     A            BCDFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : ANACLIF0                                     *
     *  DESCRIZIONE   : Analisi clienti                              *
     *  PREFISSO      : BCE                                          *
     * =============================================================== *
     A            BCESTAT0       1A         COLHDG('Stato ..............')
     A            BCEIMUT0      10A         COLHDG('Immissione utente...')
     A            BCEIMDA0       8S 0       COLHDG('Immissione data ....')
     A            BCEIMOR0       6S 0       COLHDG('Immissione ora .....')
     A            BCEIMPG0      10A         COLHDG('Immissione programma')
     A            BCEIMAZ0      10A         COLHDG('Immissione azione...')
     A            BCEAGUT0      10A         COLHDG('Aggiornamento utente')
     *
     A            BCEDIST0       3          COLHDG('Distretto ..........')
     A            BCENDIS0      30          COLHDG('Nominativo .........')
     A            BCEISPT0       3          COLHDG('Ispettore ..........')
     A            BCENISP0      30          COLHDG('Nominativo .........')
     A            BCEAGET0       3          COLHDG('Agente .............')
     A            BCENAGE0      30          COLHDG('Nominativo .........')
     A            BCECLIE0       6          COLHDG('Cliente ............')
     A            BCENCLI0      40          COLHDG('Ragione sociale ....')
     *
     A            BCEESPO0      18S 8       COLHDG('Esposizione ........')
     A            BCEGGUR0       9S 0       COLHDG('gg da ultimo ritiro.')
     A            BCEDAT10       8S 0       COLHDG('Data inizio statis..')
     A            BCEDAT20       8S 0       COLHDG('Data fine   statis..')
     A            BCEFATT0      18S 8       COLHDG('Fatturato   periodo.')
     *
     A            BCEESP10      18S 8       COLHDG('Esposizione R.Dir. .')
     A            BCEESP20      18S 8       COLHDG('Esposizione Insoluti')
     A            BCEESP30      18S 8       COLHDG('Esposizione Circolan')
     A            BCEESP40      18S 8       COLHDG('Esposizione Effetti ')
     A            BCEESP50      18S 8       COLHDG('Scaduto entro 30 gg.')
     A            BCEESP60      18S 8       COLHDG('Scaduto entro 60 gg.')
     A            BCEESP70      18S 8       COLHDG('Scaduto entro 90 gg.')
     A            BCEESP80      18S 8       COLHDG('Scaduto entro 120 gg')
     A            BCEULPA0       8S 0       COLHDG('Ultimo pagamento ...')
     A            BCEDATL0       8S 0       COLHDG('Data passaggio legal')
     A            BCEFIDO0      18S 8       COLHDG('Fido concesso ......')
     A            BCEROTA0       6S 2       COLHDG('% rotazione ........')
     A            BCEINSO0       5S 0       COLHDG('Insoluti ...........')
     A            BCENUIN0       5S 0       COLHDG('Numero insoluti ....')
     * =============================================================== *
     *  ARCHIVIO      : LIVEMZF0                                     *
     *  DESCRIZIONE   : Listini di vendita: Maggiorazione per zona   *
     *  PREFISSO      : BDA                                          *
     * =============================================================== *
     A            BDASTAT0       1A         COLHDG('Stato ..............')
     A            BDAIMUT0      10A         COLHDG('Immissione utente...')
     A            BDAIMDA0       8  0       COLHDG('Immissione data ....')
     A            BDAIMOR0       6  0       COLHDG('Immissione ora .....')
     A            BDAIMPG0      10A         COLHDG('Immissione programma')
     A            BDAIMAZ0      10A         COLHDG('Immissione azione...')
     A            BDAAGUT0      10A         COLHDG('Aggiornamento utente')
     A            BDAAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BDAAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BDAAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BDAAGAZ0      10A         COLHDG('Aggiornamento azione')
     *
     A            BDADIVL0       8S 0       COLHDG('Data inizio validità')
     A            BDAZONA0       5          COLHDG('Zona trasporto .....')
     A            BDAPRU10      18S 4       COLHDG('Variaz.Sfusi  e/q.le')
     A            BDAPRU20      18S 4       COLHDG('Variaz.Sacchi e/q.le')
     *
     A            BDAFL010       2          COLHDG('Flag 01 ............')
     A            BDAFL020       2          COLHDG('Flag 02 ............')
     A            BDAFL030       2          COLHDG('Flag 03 ............')
     A            BDAFL040       2          COLHDG('Flag 04 ............')
     A            BDAFL050       2          COLHDG('Flag 05 ............')
     A            BDAFL060      10          COLHDG('Flag 06 ............')
     A            BDAFL070      10          COLHDG('Flag 07 ............')
     A            BDAFL080      10          COLHDG('Flag 08 ............')
     A            BDAFL090      10          COLHDG('Flag 09 ............')
     A            BDAFL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVETEF0                                     *
     *  DESCRIZIONE   : Testata listini di vendita.                  *
     *  PREFISSO      : BD1                                          *
     * =============================================================== *
     A            BD1STAT0       1A         COLHDG('Stato ..............')
     A            BD1IMUT0      10A         COLHDG('Immissione utente...')
     A            BD1IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD1IMPG0      10A         COLHDG('Immissione programma')
     A            BD1IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD1AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD1AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD1SOCI0       2A         COLHDG('Società ............')
      *
     A            BD1CATL0       2          COLHDG('Categoria listino ..')
     A            BD1DALI0       8  0       COLHDG('Data listino .......')
     A            BD1COLI0       3          COLHDG('Codice listino .....')
     A            BD1DEPR0       2          COLHDG('DF = defin. PR = pr.')
     A            BD1MARC0       2          COLHDG('Marchio ............')
     A            BD1MERC0       2          COLHDG('Mercato ............')
     A            BD1NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD1FL010       2          COLHDG('Flag 01 ............')
     A            BD1FL020       2          COLHDG('Flag 02 ............')
     A            BD1FL030       2          COLHDG('Flag 03 ............')
     A            BD1FL040       2          COLHDG('Flag 04 ............')
     A            BD1FL050       2          COLHDG('Flag 05 ............')
     A            BD1FL060      10          COLHDG('Flag 06 ............')
     A            BD1FL070      10          COLHDG('Flag 07 ............')
     A            BD1FL080      10          COLHDG('Flag 08 ............')
     A            BD1FL090      10          COLHDG('Flag 09 ............')
     A            BD1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVEDEF0                                     *
     *  DESCRIZIONE   : Dettaglio listini di vendita.                *
     *  PREFISSO      : BD2                                          *
     * =============================================================== *
     A            BD2STAT0       1A         COLHDG('Stato ..............')
     A            BD2IMUT0      10A         COLHDG('Immissione utente...')
     A            BD2IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD2IMPG0      10A         COLHDG('Immissione programma')
     A            BD2IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD2AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD2AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD2SOCI0       2A         COLHDG('Società ............')
      *
     A            BD2CATL0       2          COLHDG('Categoria listino ..')
     A            BD2DALI0       8  0       COLHDG('Data listino .......')
     A            BD2COLI0       3          COLHDG('Codice listino .....')
     A            BD2LINE0       3          COLHDG('Linea prodotto .....')
     A            BD2RG010       3          COLHDG('Tipo ...............')
     A            BD2RG020       3          COLHDG('Fase ...............')
     A            BD2RG030       3          COLHDG('Stato ..............')
     A            BD2MERC0       2          COLHDG('Mercato ............')
     A            BD2PROD0      15          COLHDG('Codice prodotto ....')
     A            BD2PREZ0      18  8       COLHDG('Prezzo unitario ....')
     A            BD2PRE20      18  8       COLHDG('Prezzo .............')
     A            BD2PMI10      18  8       COLHDG('Prezzo minimo 1 ....')
     A            BD2PMI20      18  8       COLHDG('Prezzo minimo 2 ....')
     A            BD2PMI30      18  8       COLHDG('Prezzo minimo 3 ....')
     A            BD2DEPR0       2          COLHDG('DF = defin. PR = pr.')
     A            BD2NUME0       9  0       COLHDG('Numero interno .....')
     A            BD2RIGH0       6  0       COLHDG('Numero riga ........')
      *
     A            BD2FL010       2          COLHDG('Marchio ............')
     A            BD2FL020       2          COLHDG('T  = solo x trasfer.')
     A            BD2FL030       2          COLHDG('Flag 03 ............')
     A            BD2FL040       2          COLHDG('Flag 04 ............')
     A            BD2FL050       2          COLHDG('Flag 05 ............')
     A            BD2FL060      10          COLHDG('Flag 06 ............')
     *                                     Brand(XX) + TipoProd.(X)  all. sx
     A            BD2FL070      10          COLHDG('Tipo aggiunta ......')
     *                                     C = con aggiunta di cotone
     *                                     M = con aggiunta di m.p. a vista
     A            BD2FL080      10          COLHDG('Flag 08 ............')
     A            BD2FL090      10          COLHDG('Flag 09 ............')
     A            BD2FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVETRF0                                     *
     *  DESCRIZIONE   : Scaglione quant.per sconti listini vendita   *
     *  PREFISSO      : BD3                                          *
     * =============================================================== *
     A            BD3STAT0       1A         COLHDG('Stato ..............')
     A            BD3IMUT0      10A         COLHDG('Immissione utente...')
     A            BD3IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD3IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD3IMPG0      10A         COLHDG('Immissione programma')
     A            BD3IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD3AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD3AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD3AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD3AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD3AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD3SOCI0       2A         COLHDG('Società ............')
      *
     A            BD3CATL0       2          COLHDG('Categoria listino ..')
     A            BD3DALI0       8  0       COLHDG('Data listino .......')
     A            BD3COLI0       3          COLHDG('Codice listino .....')
      *
     A            BD3Q01D0      13  3       COLHDG('Scaglione 1 DA .....')
     A            BD3Q01A0      13  3       COLHDG('Scaglione 1 A ......')
     A            BD3PR010      18  8       COLHDG('Prezzo unitario 1 ..')
      *
     A            BD3Q02D0      13  3       COLHDG('Scaglione 2 DA .....')
     A            BD3Q02A0      13  3       COLHDG('Scaglione 2 A ......')
     A            BD3PR020      18  8       COLHDG('Prezzo unitario 2 ..')
      *
     A            BD3Q03D0      13  3       COLHDG('Scaglione 3 DA .....')
     A            BD3Q03A0      13  3       COLHDG('Scaglione 3 A ......')
     A            BD3PR030      18  8       COLHDG('Prezzo unitario 3 ..')
      *
     A            BD3Q04D0      13  3       COLHDG('Scaglione 4 DA .....')
     A            BD3Q04A0      13  3       COLHDG('Scaglione 4 A ......')
     A            BD3PR040      18  8       COLHDG('Prezzo unitario 4 ..')
      *
     A            BD3Q05D0      13  3       COLHDG('Scaglione 5 DA .....')
     A            BD3Q05A0      13  3       COLHDG('Scaglione 5 A ......')
     A            BD3PR050      18  8       COLHDG('Prezzo unitario 5 ..')
      *
     A            BD3Q06D0      13  3       COLHDG('Scaglione 6 DA .....')
     A            BD3Q06A0      13  3       COLHDG('Scaglione 6 A ......')
     A            BD3PR060      18  8       COLHDG('Prezzo unitario 6 ..')
      *
     A            BD3Q07D0      13  3       COLHDG('Scaglione 7 DA .....')
     A            BD3Q07A0      13  3       COLHDG('Scaglione 7 A ......')
     A            BD3PR070      18  8       COLHDG('Prezzo unitario 7 ..')
      *
     A            BD3Q08D0      13  3       COLHDG('Scaglione 8 DA .....')
     A            BD3Q08A0      13  3       COLHDG('Scaglione 8 A ......')
     A            BD3PR080      18  8       COLHDG('Prezzo unitario 8 ..')
      *
     A            BD3Q09D0      13  3       COLHDG('Scaglione 9 DA .....')
     A            BD3Q09A0      13  3       COLHDG('Scaglione 9 A ......')
     A            BD3PR090      18  8       COLHDG('Prezzo unitario 9 ..')
      *
     A            BD3Q10D0      13  3       COLHDG('Scaglione 10 DA ....')
     A            BD3Q10A0      13  3       COLHDG('Scaglione 10 A .....')
     A            BD3PR100      18  8       COLHDG('Prezzo unitario 10 .')
      *
     A            BD3DEPR0       2          COLHDG('DF = defin. PR = pr.')
     A            BD3MERC0       2          COLHDG('Mercato ............')
     A            BD3NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD3FL010       2          COLHDG('Eventuale Magazzino.')
     A            BD3FL020       2          COLHDG('Flag 02 ............')
     A            BD3FL030       2          COLHDG('Flag 03 ............')
     A            BD3FL040       2          COLHDG('Flag 04 ............')
     A            BD3FL050       2          COLHDG('Flag 05 ............')
     A            BD3FL060      10          COLHDG('Flag 06 ............')
     A            BD3FL070      10          COLHDG('Flag 07 ............')
     A            BD3FL080      10          COLHDG('Flag 08 ............')
     A            BD3FL090      10          COLHDG('Flag 09 ............')
     A            BD3FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVEPAF0                                     *
     *  DESCRIZIONE   : Altri sconti condizionati listini vendita    *
     *  PREFISSO      : BD5                                          *
     * =============================================================== *
     A            BD5STAT0       1A         COLHDG('Stato ..............')
     A            BD5IMUT0      10A         COLHDG('Immissione utente...')
     A            BD5IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD5IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD5IMPG0      10A         COLHDG('Immissione programma')
     A            BD5IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD5AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD5AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD5AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD5AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD5AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD5SOCI0       2A         COLHDG('Società ............')
      *
     A            BD5CATL0       2          COLHDG('Categoria listino ..')
     A            BD5DALI0       8  0       COLHDG('Data listino .......')
     A            BD5COLI0       3          COLHDG('Codice listino .....')
     A            BD5SCAR0      18  8       COLHDG('Sconto scarico .....')
     A            BD5ESCL0      18  8       COLHDG('Sconto esclusivista.')
     A            BD5TRAS0      18  8       COLHDG('Sconto trasporto ...')
     A            BD5DEPR0       2          COLHDG('DF = defin. PR = pr.')
     A            BD5MERC0       2          COLHDG('Mercato ............')
     A            BD5NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD5FL010       2          COLHDG('Flag 01 ............')
     A            BD5FL020       2          COLHDG('Flag 02 ............')
     A            BD5FL030       2          COLHDG('Flag 03 ............')
     A            BD5FL040       2          COLHDG('Flag 04 ............')
     A            BD5FL050       2          COLHDG('Flag 05 ............')
     A            BD5FL060      10          COLHDG('Flag 06 ............')
     A            BD5FL070      10          COLHDG('Flag 07 ............')
     A            BD5FL080      10          COLHDG('Flag 08 ............')
     A            BD5FL090      10          COLHDG('Flag 09 ............')
     A            BD5FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVEAGF0                                     *
     *  DESCRIZIONE   : Sconti finanziari listini vendita.           *
     *  PREFISSO      : BD6                                          *
     * =============================================================== *
     A            BD6STAT0       1A         COLHDG('Stato ..............')
     A            BD6IMUT0      10A         COLHDG('Immissione utente...')
     A            BD6IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD6IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD6IMPG0      10A         COLHDG('Immissione programma')
     A            BD6IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD6AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD6AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD6AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD6AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD6AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD6SOCI0       2A         COLHDG('Società ............')
      *
     A            BD6CATL0       2          COLHDG('Categoria listino ..')
     A            BD6DALI0       8  0       COLHDG('Data listino .......')
     A            BD6COLI0       3          COLHDG('Codice listino .....')
     A            BD6SCCO0       5  2       COLHDG('% sconto x contanti.')
     A            BD6SCR10       5  2       COLHDG('% sconto RD 15 gg ..')
     A            BD6SCR20       5  2       COLHDG('% sconto RD 30 gg ..')
     A            BD6SCR30       5  2       COLHDG('% sconto RD 45 gg ..')
     A            BD6SCR40       5  2       COLHDG('% sconto RD ........')
     A            BD6SCB10       5  2       COLHDG('% sconto RB 30 gg ..')
     A            BD6SCB20       5  2       COLHDG('% sconto RB 45 gg ..')
     A            BD6SCB30       5  2       COLHDG('% sconto RB ........')
     A            BD6SCB40       5  2       COLHDG('% sconto RB ........')
     A            BD6DEPR0       2          COLHDG('DF = defin. PR = pr.')
     A            BD6MERC0       2          COLHDG('Mercato ............')
     A            BD6NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD6FL010       2          COLHDG('Flag 01 ............')
     A            BD6FL020       2          COLHDG('Flag 02 ............')
     A            BD6FL030       2          COLHDG('Flag 03 ............')
     A            BD6FL040       2          COLHDG('Flag 04 ............')
     A            BD6FL050       2          COLHDG('Flag 05 ............')
     A            BD6FL060      10          COLHDG('Flag 06 ............')
     A            BD6FL070      10          COLHDG('Flag 07 ............')
     A            BD6FL080      10          COLHDG('Flag 08 ............')
     A            BD6FL090      10          COLHDG('Flag 09 ............')
     A            BD6FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : ZONREGF0                                     *
     *  DESCRIZIONE   : Associazione tra regioni e zone.             *
     *  PREFISSO      : BD4                                          *
     * =============================================================== *
     A            BD4STAT0       1A         COLHDG('Stato ..............')
     A            BD4IMUT0      10A         COLHDG('Immissione utente...')
     A            BD4IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD4IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD4IMPG0      10A         COLHDG('Immissione programma')
     A            BD4IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD4AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD4AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD4AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD4AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD4AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD4SOCI0       2A         COLHDG('Società ............')
      *
     A            BD4ZONA0       5          COLHDG('Codice zona ........')
     A            BD4REGI0       3          COLHDG('Regione ............')
      *
     A            BD4FL010       2          COLHDG('Flag 01 ............')
     A            BD4FL020       2          COLHDG('Flag 02 ............')
     A            BD4FL030       2          COLHDG('Flag 03 ............')
     A            BD4FL040       2          COLHDG('Flag 04 ............')
     A            BD4FL050       2          COLHDG('Flag 05 ............')
     A            BD4FL060      10          COLHDG('Flag 06 ............')
     A            BD4FL070      10          COLHDG('Flag 07 ............')
     A            BD4FL080      10          COLHDG('Flag 08 ............')
     A            BD4FL090      10          COLHDG('Flag 09 ............')
     A            BD4FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : DOCARCF0                                     *
     *  DESCRIZIONE   : Documenti archiviati                         *
     *  PREFISSO      : BD7                                          *
     * =============================================================== *
     A            BD7STAT0       1A         COLHDG('Stato ..............')
     A            BD7IMUT0      10A         COLHDG('Immissione utente...')
     A            BD7IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD7IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD7IMPG0      10A         COLHDG('Immissione programma')
     A            BD7IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD7AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD7AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD7AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD7AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD7AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD7SOCI0       2A         COLHDG('Società ............')
      *
     A            BD7STAB0       3          COLHDG('Stabilimento .......')
     A            BD7MAGA0       3          COLHDG('Magazzino ..........')
     A            BD7TIPD0       3          COLHDG('Tipo  documento ....')
     A            BD7ANND0       4S 0       COLHDG('Anno  documento ....')
     A            BD7SIGD0       4          COLHDG('Sigla documento ....')
     A            BD7NUMD0       4S 0       COLHDG('Num.  documento ....')
     A            BD7ARCD0       2          COLHDG('DF = Archiviaz.Defin')
      *
     A            BD7DIRE0      80          COLHDG('Directory archivio..')
     A            BD7NOME0      10          COLHDG('Nome archivio ......')
      *
     A            BD7FL010       2          COLHDG('Flag 01 ............')
     A            BD7FL020       2          COLHDG('Flag 02 ............')
     A            BD7FL030       2          COLHDG('Flag 03 ............')
     A            BD7FL040       2          COLHDG('Flag 04 ............')
     A            BD7FL050       2          COLHDG('Flag 05 ............')
     A            BD7FL060      10          COLHDG('Flag 06 ............')
     A            BD7FL070      10          COLHDG('Flag 07 ............')
     A            BD7FL080      10          COLHDG('Flag 08 ............')
     A            BD7FL090      10          COLHDG('Flag 09 ............')
     A            BD7FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCOGF0                                     *
     *  DESCRIZIONE   : Contribuzione per gruppo sconto.             *
     *  PREFISSO      : BD8                                          *
     * =============================================================== *
     A            BD8STAT0       1A         COLHDG('Stato ..............')
     A            BD8IMUT0      10A         COLHDG('Immissione utente...')
     A            BD8IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD8IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD8IMPG0      10A         COLHDG('Immissione programma')
     A            BD8IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD8AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD8AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD8AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD8AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD8AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD8SOCI0       2A         COLHDG('Società ............')
      *
     A            BD8ANNO0       4  0       COLHDG('Anno validità ......')
     A            BD8REVI0       3  0       COLHDG('Numero revisione ...')
     A            BD8MARC0       2          COLHDG('Marchio ............')
     A            BD8MERC0       2          COLHDG('Mercato ............')
     A            BD8LINE0       3          COLHDG('Linea prodotto .....')
     A            BD8CONI0      18  8       COLHDG('Contribuzione sacchi')
     A            BD8CON10      18  8       COLHDG('Contribuzione sacchi')
     A            BD8CONR0      18  8       COLHDG('Contribuzione sfuso.')
     A            BD8CON20      18  8       COLHDG('Contribuzione sfuso.')
      *
     A            BD8FL010       2          COLHDG('Flag 01 ............')
     A            BD8FL020       2          COLHDG('Flag 02 ............')
     A            BD8FL030       2          COLHDG('Flag 03 ............')
     A            BD8FL040       2          COLHDG('Flag 04 ............')
     A            BD8FL050       2          COLHDG('Flag 05 ............')
     A            BD8FL060      10          COLHDG('Flag 06 ............')
     A            BD8FL070      10          COLHDG('Flag 07 ............')
     A            BD8FL080      10          COLHDG('Flag 08 ............')
     A            BD8FL090      10          COLHDG('Flag 09 ............')
     A            BD8FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : CONSEGF0                                     *
     *  DESCRIZIONE   : Statistiche consegne.                        *
     *  PREFISSO      : BD9                                          *
     * =============================================================== *
     A            BD9STAT0       1A         COLHDG('Stato ..............')
     A            BD9IMUT0      10A         COLHDG('Immissione utente...')
     A            BD9IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD9IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD9IMPG0      10A         COLHDG('Immissione programma')
     A            BD9IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD9AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD9AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD9AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD9AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD9AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD9SOCI0       2A         COLHDG('Società ............')
      *
     A            BD9STAB0       3          COLHDG('Stabilimento .......')
     A            BD9MAGA0       3          COLHDG('Magazzino ..........')
     A            BD9SEZI0       3          COLHDG('Sezione ............')
     A            BD9DIST0       3          COLHDG('Distretto ..........')
     A            BD9AGEN0       3          COLHDG('Agente .............')
     A            BD9VETT0       4          COLHDG('Vettore ............')
     A            BD9CLIE0       6          COLHDG('Punto Consegna .....')
     A            BD9NORD0       6  0       COLHDG('Num. Ordine ........')
     A            BD9DORD0       8  0       COLHDG('Data Ordine ........')
     A            BD9NDOC0       6  0       COLHDG('Num. Documento .....')
     A            BD9DDOC0       8  0       COLHDG('Data Documento......')
     A            BD9TDOC0       1          COLHDG('Tipo Doc. B/F ......')
     A            BD9TFAT0       1          COLHDG('Tipo Fatturazione ..')
     A            BD9NGIO0       3  0       COLHDG('Numero Giorni Cons..')
     A            BD9QTAC0      12  4       COLHDG('Q.tà consegnata ....')
      *
     A            BD9FL010       2          COLHDG('Flag 01 ............')
     A            BD9FL020       2          COLHDG('Flag 02 ............')
     A            BD9FL030       2          COLHDG('Flag 03 ............')
     A            BD9FL040       2          COLHDG('Flag 04 ............')
     A            BD9FL050       2          COLHDG('Flag 05 ............')
     A            BD9FL060      10          COLHDG('Flag 06 ............')
     A            BD9FL070      10          COLHDG('Flag 07 ............')
     A            BD9FL080      10          COLHDG('Flag 08 ............')
     A            BD9FL090      10          COLHDG('Flag 09 ............')
     A            BD9FL100      10          COLHDG('Flag 10 ............')
     * ========================================================================================= *
     *  ARCHIVIO      : ANLIVAF0                                                               *
     *  DESCRIZIONE   : Archivio per analisi listini di vendita contribuzione x agente.        *
     *  PREFISSO      : AA7                                                                    *
     * ========================================================================================= *
     A            AA7STX0        1          COLHDG('Stato ..............')
      *
     A            AA7USI0       10          COLHDG('UTENTE IMMISSIONE...')
     A            AA7DAI0        8  0       COLHDG('DATA IMMISSIONE ....')
     A            AA7ORI0        6  0       COLHDG('ORA IMMISSIONE......')
     A            AA7CAZ0       10          COLHDG('Azione immissione...')
     A            AA7PGI0       10          COLHDG('Programma immissione')
     A            AA7USA0       10          COLHDG('UTENTE MODIFICA.....')
     A            AA7DAA0        8  0       COLHDG('DATA MODIFICA.......')
     A            AA7ORA0        6  0       COLHDG('ORA MODIFICA........')
     A            AA7CAA0       10          COLHDG('Azione modifica.....')
     A            AA7PGA0       10          COLHDG('Programma modifica..')
     *
     A            AA7STB0        3          COLHDG('Stabilimento .......')
     A            AA7MAG0        3          COLHDG('Magazzino ..........')
     A            AA7ARE0        3          COLHDG('Codice area ........')
     A            AA7ISP0        3          COLHDG('Codice ispettore ...')
     A            AA7AGE0        3          COLHDG('Codice agente ......')
     A            AA7LIN0        2          COLHDG('Linea  prodotto ....')
     A            AA7PRO0       15          COLHDG('Codice prodotto ....')
     A            AA7DES0       40          COLHDG('Descrizione ........')
     A            AA7UNI0        2          COLHDG('Unità di misura ....')
     A            AA7VOV0       12  2       COLHDG('Volumi di vendita ..')
     A            AA7CNT0       15  6       COLHDG('Contribuz.del perio.')
     A            AA7FEM0        9  0       COLHDG('Totale fatture emess')
     A            AA7NEM0        9  0       COLHDG('Totale not.cre.emess')
     *    ---- Flags.
     A            AA7F010        2          COLHDG('Mese elaborazione ..')
     A            AA7F020        2          COLHDG('Mercato ............')
     A            AA7F030        2          COLHDG('Flag 03 ............')
     A            AA7F040        2          COLHDG('Flag 04 ............')
     A            AA7F050        2          COLHDG('Flag 05 ............')
     A            AA7F060        2          COLHDG('Flag 06 ............')
     A            AA7F070        2          COLHDG('Flag 07 ............')
     A            AA7F080       10          COLHDG('Flag 08 ............')
     A            AA7F090       10          COLHDG('Flag 09 ............')
     A            AA7F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : BUDCOAF0                                     *
     *  DESCRIZIONE   : Contribuzione per agente/prodotto.           *
     *  PREFISSO      : BE1                                          *
     * =============================================================== *
     A            BE1STAT0       1A         COLHDG('Stato ..............')
     A            BE1IMUT0      10A         COLHDG('Immissione utente...')
     A            BE1IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE1IMPG0      10A         COLHDG('Immissione programma')
     A            BE1IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BE1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BE1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BE1AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BE1AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BE1SOCI0       2A         COLHDG('Società ............')
      *
     A            BE1STAB0       3          COLHDG('Stabilimento .......')
     A            BE1MAGA0       3          COLHDG('Magazzino ..........')
     A            BE1DAVA0       8  0       COLHDG('Data validità ......')
     A            BE1MERC0       2          COLHDG('Mercato ............')
     A            BE1LINE0       2          COLHDG('Linea prodotto .....')
     A            BE1AGEN0       3          COLHDG('Agente . ...........')
     A            BE1PROD0      15          COLHDG('Prodotto ...........')
     A            BE1CONT0      18  8       COLHDG('Contribuzione ......')
     A            BE1CON20      18  8       COLHDG('Contribuzione 2 ....')
     A            BE1SEGN0       1          COLHDG('Segno +/- ..........')
      *
     A            BE1FL010       2          COLHDG('Flag 01 ............')
     A            BE1FL020       2          COLHDG('Flag 02 ............')
     A            BE1FL030       2          COLHDG('Flag 03 ............')
     A            BE1FL040       2          COLHDG('Flag 04 ............')
     A            BE1FL050       2          COLHDG('Flag 05 ............')
     A            BE1FL060      10          COLHDG('Flag 06 ............')
     A            BE1FL070      10          COLHDG('Flag 07 ............')
     A            BE1FL080      10          COLHDG('Flag 08 ............')
     A            BE1FL090      10          COLHDG('Flag 09 ............')
     A            BE1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : DISTITF0                                     *
     *  DESCRIZIONE   : Testata Distinta Tecnica                     *
     *  PREFISSO      : DT1                                          *
     * =============================================================== *
     A            DT1STAT0       1A         COLHDG('Stato ..............')
     A            DT1IMUT0      10A         COLHDG('Immissione utente...')
     A            DT1IMDA0       8  0       COLHDG('Immissione data ....')
     A            DT1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            DT1IMPG0      10A         COLHDG('Immissione programma')
     A            DT1IMAZ0      10A         COLHDG('Immissione azione...')
     A            DT1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            DT1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            DT1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            DT1AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            DT1AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            DT1SOCI0       2A         COLHDG('Società ............')
      *
     A            DT1STAB0       3          COLHDG('Stabilimento .......')
     A            DT1MAGA0       3          COLHDG('Magazzino ..........')
     A            DT1CFOR0      15          COLHDG('Cod.Formula ........')
     A            DT1DFOR0      30          COLHDG('Des.Formula ........')
     A            DT1VERS0       5  0       COLHDG('Nr. Versione .......')
     A            DT1DVAL0       8  0       COLHDG('Data Validità ......')
     A            DT1COS10      10  4       COLHDG('Costo 1 ............')
     A            DT1COS20      10  4       COLHDG('Costo 2 ............')
     A            DT1COS30      10  4       COLHDG('Costo 3 ............')
     A            DT1TFOR0       1          COLHDG('M=Macin.,P=Produz. .')
     A            DT1TIPO0       1          COLHDG('B=Budbet,A=Standar .')
      *
     A            DT1FL010       2          COLHDG('Flag 01 ............')
     A            DT1FL020       2          COLHDG('Flag 02 ............')
     A            DT1FL030       2          COLHDG('Flag 03 ............')
     A            DT1FL040       2          COLHDG('Flag 04 ............')
     A            DT1FL050       2          COLHDG('Flag 05 ............')
     A            DT1FL060      10          COLHDG('Flag 06 ............')
     A            DT1FL070      10          COLHDG('Flag 07 ............')
     A            DT1FL080      10          COLHDG('Flag 08 ............')
     A            DT1FL090      10          COLHDG('Flag 09 ............')
     A            DT1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : DISTIRF0                                     *
     *  DESCRIZIONE   : Righe Distinta Tecnica                       *
     *  PREFISSO      : DT2                                          *
     * =============================================================== *
     A            DT2STAT0       1A         COLHDG('Stato ..............')
     A            DT2IMUT0      10A         COLHDG('Immissione utente...')
     A            DT2IMDA0       8  0       COLHDG('Immissione data ....')
     A            DT2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            DT2IMPG0      10A         COLHDG('Immissione programma')
     A            DT2IMAZ0      10A         COLHDG('Immissione azione...')
     A            DT2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            DT2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            DT2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            DT2AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            DT2AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            DT2SOCI0       2A         COLHDG('Società ............')
      *
     A            DT2STAB0       3          COLHDG('Stabilimento .......')
     A            DT2MAGA0       3          COLHDG('Magazzino ..........')
     A            DT2CFOR0      15          COLHDG('Cod.Formula ........')
     A            DT2VERS0       5  0       COLHDG('Nr. Versione .......')
     A            DT2DVAL0       8  0       COLHDG('Data Validità ......')
     A            DT2CCOM0      15          COLHDG('Cod.Componente .....')
     A            DT2PERC0       7  4       COLHDG('Percentuale ........')
     A            DT2CAUS0       2          COLHDG('Causale (PV,PP) ....')
     A            DT2SILO0       6          COLHDG('Cod.Silos ..........')
      *
     A            DT2FL010       2          COLHDG('Flag 01 ............')
     A            DT2FL020       2          COLHDG('Flag 02 ............')
     A            DT2FL030       2          COLHDG('Flag 03 ............')
     A            DT2FL040       2          COLHDG('Flag 04 ............')
     A            DT2FL050       2          COLHDG('Flag 05 ............')
     A            DT2FL060      10          COLHDG('Flag 06 ............')
     A            DT2FL070      10          COLHDG('Flag 07 ............')
     A            DT2FL080      10          COLHDG('Flag 08 ............')
     A            DT2FL090      10          COLHDG('Flag 09 ............')
     A            DT2FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : FARESPF0                                     *
     *  DESCRIZIONE   : Log fatturazione respinta.                   *
     *  PREFISSO      : BE2                                          *
     * =============================================================== *
     A            BE2STAT0       1A         COLHDG('Stato ..............')
     A            BE2IMUT0      10A         COLHDG('Immissione utente...')
     A            BE2IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE2IMPG0      10A         COLHDG('Immissione programma')
     A            BE2IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BE2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BE2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BE2AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BE2AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BE2SOCI0       2A         COLHDG('Società ............')
      *
     A            BE2STAB0       3          COLHDG('Stabilimento .......')
     A            BE2MAGA0       3          COLHDG('Magazzino ..........')
     A            BE2TASA0       2          COLHDG('Tasto di annullamen.')
     A            BE2NUMV0       9  0       COLHDG('Numero viaggio .....')
     A            BE2PROG0       4  0       COLHDG('Progressivo ........')
     A            BE2PEIN0       9  2       COLHDG('Peso in ingresso ...')
     A            BE2PEUS0       9  2       COLHDG('Peso in uscita .....')
     A            BE2PENE0       9  2       COLHDG('Peso netto prodotti.')
     A            BE2PELO0       9  2       COLHDG('Peso lordo prodotti.')
     A            BE2PEEF0       9  2       COLHDG('Peso effet.prodotti.')
     A            BE2PEDI0       9  2       COLHDG('Peso differenza ....')
     A            BE2ADF80       2          COLHDG('Esce da stabilimento')
     A            BE2PALL0       3  0       COLHDG('N.pallets ..........')
     A            BE2EURO0       3  0       COLHDG('N.europallets ......')
      *
     A            BE2FL010       2          COLHDG('Europallet teorici..')
     A            BE2FL020       2          COLHDG('Flag 02 ............')
     A            BE2FL030       2          COLHDG('Flag 03 ............')
     A            BE2FL040       2          COLHDG('Flag 04 ............')
     A            BE2FL050       2          COLHDG('Flag 05 ............')
     A            BE2FL060      10          COLHDG('Flag 06 ............')
     A            BE2FL070      10          COLHDG('Flag 07 ............')
     A            BE2FL080      10          COLHDG('Flag 08 ............')
     A            BE2FL090      10          COLHDG('Flag 09 ............')
     A            BE2FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : GIAUBIF0                                     *
     *  DESCRIZIONE   : Giacenza per ubicazione.                     *
     *  PREFISSO      : BE3                                          *
     *  Attenzione l'anagrafico ubicazioni si chiama MAPMAGF0 mentre *
     *  l'associazione ubicazione-prodotto si chiama UBIPROF0.       *
     * =============================================================== *
     A            BE3STAT0       1A         COLHDG('Stato ..............')
     A            BE3IMUT0      10A         COLHDG('Immissione utente...')
     A            BE3IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE3IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE3IMPG0      10A         COLHDG('Immissione programma')
     A            BE3IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE3AGUT0      10A         COLHDG('1 Aggiornam.  utente')
     A            BE3AGDA0       8  0       COLHDG('1 Aggiornam.  data..')
     A            BE3AGOR0       6  0       COLHDG('1 Aggiornam.  ora...')
     A            BE3AGPG0      10A         COLHDG('1 Aggiornam.  progr.')
     A            BE3AGAZ0      10A         COLHDG('1 Aggiornam.  azione')
     A            BE3AUUT0      10A         COLHDG('2 Aggiornam.  utente')
     A            BE3AUDA0       8  0       COLHDG('2 Aggiornam.  data..')
     A            BE3AUOR0       6  0       COLHDG('2 Aggiornam.  ora...')
     A            BE3AUPG0      10A         COLHDG('2 Aggiornam.  progr.')
     A            BE3AUAZ0      10A         COLHDG('2 Aggiornam.  azione')
     A            BE3SOCI0       2A         COLHDG('Società ............')
      *
     A            BE3ANNO0       4  0       COLHDG('Anno esercizio .....')
     A            BE3STAB0       3          COLHDG('Stabilimento .......')
     A            BE3MAGA0       3          COLHDG('Magazzino ..........')
     A            BE3UBIC0       4          COLHDG('Codice ubicazione ..')
     A            BE3PROD0      15          COLHDG('Codice prodotto ....')
     A            BE3UNIM0       2          COLHDG('Unità di misura ....')
     A            BE3QUAN0      12  2       COLHDG('Quantità ...........')
     A            BE3SCAV0       8  0       COLHDG('Data scad. + vecchia')
     A            BE3LOTV0       9  0       COLHDG('Lotto      + vecchio')
     A            BE3SCAN0       8  0       COLHDG('Data scad. + nuovo .')
     A            BE3LOTN0       9  0       COLHDG('Lotto      + nuovo .')
      *
     A            BE3FL010       2          COLHDG('Flag 01 ............')
     A            BE3FL020       2          COLHDG('Flag 02 ............')
     A            BE3FL030       2          COLHDG('Flag 03 ............')
     A            BE3FL040       2          COLHDG('Flag 04 ............')
     A            BE3FL050       2          COLHDG('Flag 05 ............')
     A            BE3FL060      10          COLHDG('Flag 06 ............')
     A            BE3FL070      10          COLHDG('Flag 07 ............')
     A            BE3FL080      10          COLHDG('Flag 08 ............')
     A            BE3FL090      10          COLHDG('Flag 09 ............')
     A            BE3FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : GIAUBMF0                                     *
     *  DESCRIZIONE   : Giacenza per ubicazione (movimenti).         *
     *  PREFISSO      : BE4                                          *
     * =============================================================== *
     A            BE4STAT0       1A         COLHDG('Stato ..............')
     A            BE4IMUT0      10A         COLHDG('Immissione utente...')
     A            BE4IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE4IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE4IMPG0      10A         COLHDG('Immissione programma')
     A            BE4IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE4AGUT0      10A         COLHDG('1 Aggiornam.  utente')
     A            BE4AGDA0       8  0       COLHDG('1 Aggiornam.  data..')
     A            BE4AGOR0       6  0       COLHDG('1 Aggiornam.  ora...')
     A            BE4AGPG0      10A         COLHDG('1 Aggiornam.  progr.')
     A            BE4AGAZ0      10A         COLHDG('1 Aggiornam.  azione')
     A            BE4SOCI0       2A         COLHDG('Società ............')
      *
     A            BE4ANNO0       4  0       COLHDG('Anno esercizio .....')
     A            BE4STAB0       3          COLHDG('Stabilimento .......')
     A            BE4MAGA0       3          COLHDG('Magazzino ..........')
     A            BE4UBIC0       4          COLHDG('Codice ubicazione ..')
     A            BE4PROD0      15          COLHDG('Codice prodotto ....')
     A            BE4RIPA0       9  0       COLHDG('Identificativo palle')
     A            BE4UNIM0       2          COLHDG('Unità di misura ....')
     A            BE4QUAN0      12  2       COLHDG('Quantità ...........')
      *
     A            BE4FL010       2          COLHDG('Flag 01 ............')
     A            BE4FL020       2          COLHDG('Flag 02 ............')
     A            BE4FL030       2          COLHDG('Flag 03 ............')
     A            BE4FL040       2          COLHDG('Flag 04 ............')
     A            BE4FL050       2          COLHDG('Flag 05 ............')
     A            BE4FL060      10          COLHDG('Flag 06 ............')
     A            BE4FL070      10          COLHDG('Flag 07 ............')
     A            BE4FL080      10          COLHDG('Flag 08 ............')
     A            BE4FL090      10          COLHDG('Flag 09 ............')
     A            BE4FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : ORCL11F0                                     *
     *  DESCRIZIONE   : Dettaglio ordini righe / unità di carico.    *
     *  PREFISSO      : BE5                                          *
     * =============================================================== *
     A            BE5STAT0       1A         COLHDG('Stato ..............')
     A            BE5IMUT0      10A         COLHDG('Immissione utente...')
     A            BE5IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE5IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE5IMPG0      10A         COLHDG('Immissione programma')
     A            BE5IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE5AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            BE5AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            BE5AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            BE5AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            BE5AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            BE5SOCI0       2A         COLHDG('Società ............')
      *
     A            BE5STAB0       3          COLHDG('Stabilimento .......')
     A            BE5MAGA0       3          COLHDG('Magazzino ..........')
     A            BE5VIAG0       9  0       COLHDG('Numero viaggio .....')
     A            BE5DAOR0       8  0       COLHDG('Data ordine ........')
     A            BE5SIOR0       4          COLHDG('Sigla ordine .......')
     A            BE5NUOR0       9  0       COLHDG('Numero ordine ......')
     A            BE5RIOR0       4  0       COLHDG('Riga ordine ........')
     A            BE5UDCA0       9  0       COLHDG('Unita di carico ....')
     A            BE5RUDC0       4  0       COLHDG('Riga Unità di carico')
     A            BE5PACH0       2          COLHDG('CH = chiuso ........')
     A            BE5UDCR0       9  0       COLHDG('Unita di carico Prel')
     A            BE5RUDR0       4  0       COLHDG('Riga Un.di car. Prel')
     A            BE5UBIC0       4          COLHDG('Stiva di appoggio ..')
      *
     A            BE5FL010       2          COLHDG('SI = pallet su camio')
     A            BE5FL020       2          COLHDG('S = opz. 1 no laser.')
     A            BE5FL030       2          COLHDG('SI = lett.da n.lotto')
     A            BE5FL040       2          COLHDG('Causale carico .....')
     A            BE5FL050       2          COLHDG('Flag 05 ............')
     A            BE5FL060      10          COLHDG('N.colli prelevati...')
     A            BE5FL070      10          COLHDG('Flag 07 ............')
     A            BE5FL080      10          COLHDG('Flag 08 ............')
     A            BE5FL090      10          COLHDG('Flag 09 ............')
     A            BE5FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : GIAPROF0                                     *
     *  DESCRIZIONE   : Giacenza per ubicazione (movimenti).         *
     *  PREFISSO      : BE6                                          *
     * =============================================================== *
     A            BE6STAT0       1A         COLHDG('Stato ..............')
     A            BE6IMUT0      10A         COLHDG('Immissione utente...')
     A            BE6IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE6IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE6IMPG0      10A         COLHDG('Immissione programma')
     A            BE6IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE6AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            BE6AGDA0       8  0       COLHDG('Aggiornam. data.....')
     A            BE6AGOR0       6  0       COLHDG('Aggiornam. ora......')
     A            BE6AGPG0      10A         COLHDG('Aggiornam. programm.')
     A            BE6AGAZ0      10A         COLHDG('Aggiornam. azione...')
     A            BE6SOCI0       2A         COLHDG('Società ............')
      *
     A            BE6ANNO0       4  0       COLHDG('Anno esercizio .....')
     A            BE6STAB0       3          COLHDG('Stabilimento .......')
     A            BE6MAGA0       3          COLHDG('Magazzino ..........')
     A            BE6PROD0      15          COLHDG('Codice prodotto ....')
     A            BE6UNIM0       2          COLHDG('Unità di misura ....')
     A            BE6QUAN0      12  2       COLHDG('Quantità ...........')
      *
     A            BE6FL010       2          COLHDG('Flag 01 ............')
     A            BE6FL020       2          COLHDG('Flag 02 ............')
     A            BE6FL030       2          COLHDG('Flag 03 ............')
     A            BE6FL040       2          COLHDG('Flag 04 ............')
     A            BE6FL050       2          COLHDG('Flag 05 ............')
     A            BE6FL060      10          COLHDG('Flag 06 ............')
     A            BE6FL070      10          COLHDG('Flag 07 ............')
     A            BE6FL080      10          COLHDG('Flag 08 ............')
     A            BE6FL090      10          COLHDG('Flag 09 ............')
     A            BE6FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : STONURF0                                     *
     *  DESCRIZIONE   : Storico numeratore.                          *
     *  PREFISSO      : BE7                                          *
     * =============================================================== *
     A            BE7STAT0       1A         COLHDG('Stato ..............')
     A            BE7IMUT0      10A         COLHDG('Immissione utente...')
     A            BE7IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE7IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE7IMPG0      10A         COLHDG('Immissione programma')
     A            BE7IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE7AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            BE7AGDA0       8  0       COLHDG('Aggiornam. data.....')
     A            BE7AGOR0       6  0       COLHDG('Aggiornam. ora......')
     A            BE7AGPG0      10A         COLHDG('Aggiornam. programm.')
     A            BE7AGAZ0      10A         COLHDG('Aggiornam. azione...')
     A            BE7SOCI0       2A         COLHDG('Società ............')
      *
     A            BE7NRI0        4  0       COLHDG('Numero interno .....')
     A            BE7ANN0        4  0       COLHDG('Anno documento......')
     A            BE7NUM0        6  0       COLHDG('Numero documento....')
     A            BE7TIP0        4          COLHDG('Tipo   documento....')
     A            BE7DAT0        8  0       COLHDG('Data   documento....')
      *
     A            BE7FL010       2          COLHDG('Flag 01 ............')
     A            BE7FL020       2          COLHDG('Flag 02 ............')
     A            BE7FL030       2          COLHDG('Flag 03 ............')
     A            BE7FL040       2          COLHDG('Flag 04 ............')
     A            BE7FL050       2          COLHDG('Flag 05 ............')
     A            BE7FL060      10          COLHDG('Flag 06 ............')
     A            BE7FL070      10          COLHDG('Flag 07 ............')
     A            BE7FL080      10          COLHDG('Flag 08 ............')
     A            BE7FL090      10          COLHDG('Flag 09 ............')
     A            BE7FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : ORCL12F0                                     *
     *  DESCRIZIONE   : Dettaglio ordini righe / unità di carico.    *
     *  PREFISSO      : BE8                                          *
     * =============================================================== *
     A            BE8STAT0       1A         COLHDG('Stato ..............')
     A            BE8IMUT0      10A         COLHDG('Immissione utente...')
     A            BE8IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE8IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE8IMPG0      10A         COLHDG('Immissione programma')
     A            BE8IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE8AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            BE8AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            BE8AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            BE8AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            BE8AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            BE8SOCI0       2A         COLHDG('Società ............')
     *
     A            BE8STAB0       3          COLHDG('Stabilimento .......')
     A            BE8MAGA0       3          COLHDG('Magazzino ..........')
     A            BE8VIAG0       9  0       COLHDG('Numero viaggio .....')
     A            BE8DAOR0       8  0       COLHDG('Data ordine ........')
     A            BE8SIOR0       4          COLHDG('Sigla ordine .......')
     A            BE8NUOR0       9  0       COLHDG('Numero ordine ......')
     A            BE8UDCA0       9  0       COLHDG('Unita di carico ....')
     A            BE8RUDC0       4  0       COLHDG('Riga Unità di carico')
     A            BE8UDCR0       9  0       COLHDG('Unita di carico Prel')
     A            BE8RUDR0       4  0       COLHDG('Riga Un.di car. Prel')
     A            BE8RIOR0       4  0       COLHDG('Riga ordine ........')
     A            BE8UNIM0       2          COLHDG('Unità di misura.....')
     A            BE8COLL0       4  0       COLHDG('Colli ..............')
     A            BE8PESO0       9  2       COLHDG('Peso ...............')
      *
     A            BE8FL010       2          COLHDG('Flag 01 ............')
     A            BE8FL020       2          COLHDG('Flag 02 ............')
     A            BE8FL030       2          COLHDG('Flag 03 ............')
     A            BE8FL040       2          COLHDG('Flag 04 ............')
     A            BE8FL050       2          COLHDG('Flag 05 ............')
     A            BE8FL060      10          COLHDG('Flag 06 ............')
     A            BE8FL070      10          COLHDG('Flag 07 ............')
     A            BE8FL080      10          COLHDG('Flag 08 ............')
     A            BE8FL090      10          COLHDG('Flag 09 ............')
     A            BE8FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : RILINVF0                                     *
     *  DESCRIZIONE   : Rilevamento inventario fisico con lettori    *
     *  PREFISSO      : BE9                                          *
     * =============================================================== *
     A            BE9STAT0       1A         COLHDG('Stato ..............')
     A            BE9IMUT0      10A         COLHDG('Immissione utente...')
     A            BE9IMDA0       8  0       COLHDG('Immissione data ....')
     A            BE9IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BE9IMPG0      10A         COLHDG('Immissione programma')
     A            BE9IMAZ0      10A         COLHDG('Immissione azione...')
     A            BE9AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            BE9AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            BE9AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            BE9AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            BE9AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            BE9SOCI0       2A         COLHDG('Società ............')
     *
     A            BE9STAB0       3          COLHDG('Stabilimento .......')
     A            BE9MAGA0       3          COLHDG('Magazzino ..........')
     A            BE9NUME0       9  0       COLHDG('Numeratore interno..')
     A            BE9UBIC0       4          COLHDG('Codice ubicazione ..')
     A            BE9DAIN0       8  0       COLHDG('Data inventario ....')
     A            BE9DALE0       8  0       COLHDG('Data lettura .......')
     A            BE9ORLE0       6  0       COLHDG('Ora  lettura .......')
     A            BE9OPER0       5          COLHDG('Operatore ..........')
     A            BE9NUDC0       9  0       COLHDG('Unità di carico ....')
     A            BE9LOTT0       9  0       COLHDG('Numero lotto .......')
     A            BE9PROD0      15          COLHDG('Codice prodotto ....')
     A            BE9UMPR0       2          COLHDG('Unità di mis.prodot.')
     A            BE9UMIN0       2          COLHDG('Unità di mis.invent.')
     A            BE9PRDE0       2          COLHDG('DF=defin.PR=provvis.')
     A            BE9NRSE0       9  0       COLHDG('Numero sessione ....')
     A            BE9NRMO0       4  0       COLHDG('Numero movimento....')
     A            BE9PALL0       5  0       COLHDG('Num.pallet interi...')
     A            BE9COLL0       5  0       COLHDG('Colli ..............')
     A            BE9PESO0       9  2       COLHDG('Peso ...............')
     A            BE9PEDA0       5  0       COLHDG('Num.pedane .........')
     A            BE9NUBL0       6  0       COLHDG('Nr Blocco ..........')
     A            BE9NUFO0       6  0       COLHDG('Nr Foglio ..........')
      *
     A            BE9FL010       2          COLHDG('Flag 01 ............')
     A            BE9FL020       2          COLHDG('Flag 02 ............')
     A            BE9FL030       2          COLHDG('Flag 03 ............')
     A            BE9FL040       2          COLHDG('Flag 04 ............')
     A            BE9FL050       2          COLHDG('Flag 05 ............')
     A            BE9FL060      10          COLHDG('Flag 06 ............')
     A            BE9FL070      10          COLHDG('Flag 07 ............')
     A            BE9FL080      10          COLHDG('Flag 08 ............')
     A            BE9FL090      10          COLHDG('Flag 09 ............')
     A            BE9FL100      10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : DREYFUF0                                  *
     *  DESCRIZIONE   : Tracciato record Dreyfus                  *
     *  PREFISSO      : DF                                        *
     ****************************************************************
     A            DFDEP0         2S 0       COLHDG('Deposito ........')
     A            DFDTB0         6S 0       COLHDG('Data bolla ......')
     A            DFNRB0        10S 0       COLHDG('Numero bolla ....')
     A            DFQTA0        10S 0       COLHDG('Quantità ........')
     A            DFCLI0         6S 0       COLHDG('Cliente .........')
     A            DFANN0         2S 0       COLHDG('Anno ordine .....')
     A            DFNRO0         6S 0       COLHDG('Num. ordine .....')
     A            DFRIG0         4S 0       COLHDG('Riga ordine .....')
     A            DFFL10         6S 0       COLHDG('Vuoto ...........')
     A            DFPAF0        12S 0       COLHDG('Partita fornitore')
     A            DFINC0         8S 0       COLHDG('Incassi .........')
     A            DFFL20         6S 0       COLHDG('Vuoto ...........')
     * =============================================================== *
     *  ARCHIVIO      : INGAU2F0                                     *
     *  DESCRIZIONE   : Dati aggiuntivi ingresso automezzi.          *
     *  PREFISSO      : BF1                                          *
     * =============================================================== *
     A            BF1STAT0       1A         COLHDG('Stato ..............')
     A            BF1IMUT0      10A         COLHDG('Immissione utente...')
     A            BF1IMDA0       8  0       COLHDG('Immissione data ....')
     A            BF1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BF1IMPG0      10A         COLHDG('Immissione programma')
     A            BF1IMAZ0      10A         COLHDG('Immissione azione...')
     A            BF1AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            BF1AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            BF1AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            BF1AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            BF1AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            BF1SOCI0       2A         COLHDG('Società ............')
     *
     A            BF1STAB0       3          COLHDG('Stabilimento .......')
     A            BF1MAGA0       3          COLHDG('Magazzino ..........')
     A            BF1VIAG0       9  0       COLHDG('Numero viaggio .....')
     A            BF1SEQU0       3  0       COLHDG('Numero sequenza ....')
     A            BF1CAUS0       2          COLHDG('Causale ingresso ...')
     A            BF1DAIN0       8  0       COLHDG('Data    ingresso ...')
     A            BF1ORIN0       6  0       COLHDG('Ora     ingresso ...')
     A            BF1PEIN0      12  3       COLHDG('Peso    ingresso ...')
     A            BF1DAUS0       8  0       COLHDG('Data    uscita .....')
     A            BF1ORUS0       6  0       COLHDG('Ora     uscita .....')
     A            BF1PEUS0      12  3       COLHDG('Peso    uscita .....')
     A            BF1VIAP0       9  0       COLHDG('Numero viaggio prog.')
     A            BF1NOTA0      50          COLHDG('Nota ...............')
      *
     A            BF1FL010       2          COLHDG('Flag 01 ............')
     A            BF1FL020       2          COLHDG('Flag 02 ............')
     A            BF1FL030       2          COLHDG('Flag 03 ............')
     A            BF1FL040       2          COLHDG('Flag 04 ............')
     A            BF1FL050       2          COLHDG('Flag 05 ............')
     A            BF1FL060      10          COLHDG('Flag 06 ............')
     A            BF1FL070      10          COLHDG('Flag 07 ............')
     A            BF1FL080      10          COLHDG('Flag 08 ............')
     A            BF1FL090      10          COLHDG('Flag 09 ............')
     A            BF1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TRAINTF0                                     *
     *  DESCRIZIONE   : Trasferimenti Interni (Mag./Silos)           *
     *  PREFISSO      : TI1                                          *
     * =============================================================== *
     A            TI1STAT0       1A         COLHDG('Stato ..............')
     A            TI1IMUT0      10A         COLHDG('Immissione utente...')
     A            TI1IMDA0       8  0       COLHDG('Immissione data ....')
     A            TI1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            TI1IMPG0      10A         COLHDG('Immissione programma')
     A            TI1IMAZ0      10A         COLHDG('Immissione azione...')
     A            TI1AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            TI1AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            TI1AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            TI1AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            TI1AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            TI1SOCI0       2A         COLHDG('Società ............')
     *
     A            TI1STAB0       3          COLHDG('Stabilimento .......')
     A            TI1MAGA0       3          COLHDG('Magazzino ..........')
     A            TI1DATA0       8  0       COLHDG('Data Operazione ....')
     A            TI1ORAR0       6  0       COLHDG('Ora  Operazione ....')
     A            TI1TIPO0       1          COLHDG('D/S = Diretto/Silos.')
     A            TI1LTCP0       9  0       COLHDG('Lotto Centralina ...')
     A            TI1NRSE0       9  0       COLHDG('Num. Sessione ......')
     A            TI1PROG0       4  0       COLHDG('Progr. riga ........')
     A            TI1LTAS0       9  0       COLHDG('Lotto AS400 ........')
     A            TI1PROD0      15          COLHDG('Cod. Prodotto ......')
     A            TI1QUAN0      10  2       COLHDG('Quantità ...........')
     A            TI1SILO0       6          COLHDG('Cod. Silos Dest. ...')
     A            TI1BUCA0       2          COLHDG('Buca scarico=A,B,C .')
      *
     A            TI1FL010       2          COLHDG('Flag 01 ............')
     A            TI1FL020       2          COLHDG('Flag 02 ............')
     A            TI1FL030       2          COLHDG('Flag 03 ............')
     A            TI1FL040       2          COLHDG('Flag 04 ............')
     A            TI1FL050       2          COLHDG('Flag 05 ............')
     A            TI1FL060      10          COLHDG('Flag 06 ............')
     A            TI1FL070      10          COLHDG('Flag 07 ............')
     A            TI1FL080      10          COLHDG('Flag 08 ............')
     A            TI1FL090      10          COLHDG('Flag 09 ............')
     A            TI1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : INVSILF0                                     *
     *  DESCRIZIONE   : Storico inventari silos.                     *
     *  PREFISSO      : BF2                                          *
     * =============================================================== *
     A            BF2STAT0       1A         COLHDG('Stato ..............')
     A            BF2IMUT0      10A         COLHDG('Immissione utente...')
     A            BF2IMDA0       8  0       COLHDG('Immissione data ....')
     A            BF2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BF2IMPG0      10A         COLHDG('Immissione programma')
     A            BF2IMAZ0      10A         COLHDG('Immissione azione...')
     A            BF2AGUT0      10A         COLHDG('Aggiornam.  utente..')
     A            BF2AGDA0       8  0       COLHDG('Aggiornam.  data....')
     A            BF2AGOR0       6  0       COLHDG('Aggiornam.  ora.....')
     A            BF2AGPG0      10A         COLHDG('Aggiornam.  program.')
     A            BF2AGAZ0      10A         COLHDG('Aggiornam.  azione..')
     A            BF2SOCI0       2A         COLHDG('Società ............')
     *
     A            BF2STAB0       3          COLHDG('Stabilimento .......')
     A            BF2MAGA0       3          COLHDG('Magazzino ..........')
     A            BF2DAIN0       8  0       COLHDG('Data inventario.....')
     A            BF2SILO0       6          COLHDG('Codice silos .......')
     A            BF2PROD0      15          COLHDG('Codice prodotto.....')
     A            BF2MEVU0       7  2       COLHDG('Metri di vuoto .....')
     A            BF2QUAN0      12  3       COLHDG('Quantità ...........')
     A            BF2NRSE0       9  0       COLHDG('Numero sessione.....')
     A            BF2NRMO0       4  0       COLHDG('Numero movimento....')
     A            BF2PIVU0       1          COLHDG('S=svuota, P=pieno...')
      *
     A            BF2FL010       2          COLHDG('Flag 01 ............')
     A            BF2FL020       2          COLHDG('Flag 02 ............')
     A            BF2FL030       2          COLHDG('Flag 03 ............')
     A            BF2FL040       2          COLHDG('Flag 04 ............')
     A            BF2FL050       2          COLHDG('Flag 05 ............')
     A            BF2FL060      10          COLHDG('Flag 06 ............')
     A            BF2FL070      10          COLHDG('Flag 07 ............')
     A            BF2FL080      10          COLHDG('Flag 08 ............')
     A            BF2FL090      10          COLHDG('Flag 09 ............')
     A            BF2FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TCRID3F0                                     *
     *  DESCRIZIONE   : Tracciabilità Lotti/Bem  (Acquisti)          *
     *  PREFISSO      : TC3                                          *
     * =============================================================== *
     A            TC3STX0        1          COLHDG('Stato ..............')
     A            TC3USX0       10          COLHDG('Immissione utente...')
     A            TC3DAX0        8  0       COLHDG('Immissione data ....')
     A            TC3ORX0        6  0       COLHDG('Immissione ora .....')
     A            TC3PGI0       10          COLHDG('Immissione programma')
     A            TC3CAZ0       10          COLHDG('Immissione azione...')
     A            TC3USA0       10          COLHDG('Aggiornamento utente')
     A            TC3DAA0        8  0       COLHDG('Aggiornamento data..')
     A            TC3ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            TC3PGV0       10          COLHDG('Aggiornamento progr.')
     A            TC3CAV0       10          COLHDG('Aggiornamento azione')
     A            TC3SOC0        2          COLHDG('Società ............')
     *
     A            TC3NUM0        9  0       COLHDG('Numeratore interno..')
     A            TC3NMT0        4  0       COLHDG('Num. Movimento riga.')
     *
     A            TC3CFO0        6          COLHDG('Cod. Fornitore......')
     A            TC3DBL0        8  0       COLHDG('Data Bolla Forn.....')
     A            TC3SBL0        4          COLHDG('Sigla Bolla Forn....')
     A            TC3NBL0        6  0       COLHDG('Num. Bolla Forn. ...')
     A            TC3DBE0        8  0       COLHDG('Data Bem............')
     A            TC3NBE0        9  0       COLHDG('Num. Bem............')
     A            TC3ABE0        4  0       COLHDG('Anno Bem............')
     A            TC3SIL0        6          COLHDG('Silos Originale ....')
     A            TC3DEF0        1          COLHDG('D=definitivo .......')
     A            TC3QTU0       12  2       COLHDG('Quantità utilizzata.')
     *
     A            TC3F010        2          COLHDG('Flag 01 ............')
     A            TC3F020        2          COLHDG('Flag 02 ............')
     A            TC3F030        2          COLHDG('Flag 03 ............')
     A            TC3F040        2          COLHDG('Flag 04 ............')
     A            TC3F050        2          COLHDG('Flag 05.............')
     A            TC3F060        2          COLHDG('Flag 06 ............')
     A            TC3F070       10          COLHDG('Flag 07 ............')
     A            TC3F080       10          COLHDG('Flag 08 ............')
     A            TC3F090       10          COLHDG('Flag 09 ............')
     A            TC3F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : FORPROF0                                     *
     *  DESCRIZIONE   : Analisi Produzione per Formula               *
     *  PREFISSO      : PF1                                          *
     * =============================================================== *
     *
     A            PF1MAG0        3          COLHDG('Magazzino ..........')
     A            PF1DA10        8  0       COLHDG('Data inizio periodo.')
     A            PF1DA20        8  0       COLHDG('Data fine periodo ..')
     A            PF1LIN0        2          COLHDG('Linea Prodotto......')
     A            PF1PRO0       15          COLHDG('Cod.  Prodotto......')
     A            PF1DES0       30          COLHDG('Des.  Prodotto......')
     A            PF1QTA0       12  2       COLHDG('Q.tà  Prodotta .....')
      *
     A            PF1MPC0       15          COLHDG('Cod. M.P. ..........')
     A            PF1DEC0       30          COLHDG('Des. M.P. ..........')
      *
     A            PF1QTC0       12  2       COLHDG('Q.tà M.P. Cons......')
     A            PF1PEC0       18  2       COLHDG('Perc M.P. Cons......')
     A            PF1VAC0       18  2       COLHDG('Val. M.P. Cons......')
     A            PF1QTF0       12  2       COLHDG('Q.tà M.P. Form......')
     A            PF1PEF0       18  2       COLHDG('Perc M.P. Form......')
     A            PF1VAF0       12  2       COLHDG('Val. M.P. Form......')
     *
     A            PF1DIQ0       12  2       COLHDG('Diff. Q.tà..........')
     A            PF1DIV0       12  2       COLHDG('Diff. Valore........')
     * =============================================================== *
     *  ARCHIVIO      : DTPRVSF0                                     *
     *  DESCRIZIONE   : Dettaglio provvigioni (save prima di variaz)  *
     *  PREFISSO      : PF1                                          *
     * =============================================================== *
     *
     A            TC4STX0        1          COLHDG('Stato ..............')
     A            TC4USX0       10          COLHDG('Immissione utente...')
     A            TC4DAX0        8  0       COLHDG('Immissione data ....')
     A            TC4ORX0        6  0       COLHDG('Immissione ora .....')
     A            TC4PGI0       10          COLHDG('Immissione programma')
     A            TC4CAZ0       10          COLHDG('Immissione azione...')
     A            TC4USA0       10          COLHDG('Aggiornamento utente')
     A            TC4DAA0        8  0       COLHDG('Aggiornamento data..')
     A            TC4ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            TC4PGV0       10          COLHDG('Aggiornamento progr.')
     A            TC4CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            TC4CDAGE0      3          COLHDG('Codice agente ......')
     A            TC4CDCLI0      6          COLHDG('Cliente ............')
     A            TC4DARIF0      8  0       COLHDG('Data riferimento ...')
     A            TC4NURIF0      6  0       COLHDG('Num. riferimento ...')
     A            TC4PROVSP0    11  2       COLHDG('Provvigioni spett...')
     A            TC4STATOP0     2          COLHDG('Stato partita ......')
     A            TC4UNIVOC0     9  0       COLHDG('Numero univoco .....')
     A            TC4NOTE0      60          COLHDG('Note ...............')
     *
     A            TC4F010        2          COLHDG('Flag 01 ............')
     A            TC4F020        2          COLHDG('Flag 02 ............')
     A            TC4F030        2          COLHDG('Flag 03 ............')
     A            TC4F040        2          COLHDG('Flag 04 ............')
     A            TC4F050        2          COLHDG('Flag 05.............')
     A            TC4F060        2          COLHDG('Flag 06 ............')
     A            TC4F070       10          COLHDG('Flag 07 ............')
     A            TC4F080       10          COLHDG('Flag 08 ............')
     A            TC4F090       10          COLHDG('Flag 09 ............')
     A            TC4F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : STPRVSF0                                     *
     *  DESCRIZIONE   : Storico   provvigioni (save prima di variaz)  *
     *  PREFISSO      : TC5                                          *
     * =============================================================== *
     *
     A            TC5STX0        1          COLHDG('Stato ..............')
     A            TC5USX0       10          COLHDG('Immissione utente...')
     A            TC5DAX0        8  0       COLHDG('Immissione data ....')
     A            TC5ORX0        6  0       COLHDG('Immissione ora .....')
     A            TC5PGI0       10          COLHDG('Immissione programma')
     A            TC5CAZ0       10          COLHDG('Immissione azione...')
     A            TC5USA0       10          COLHDG('Aggiornamento utente')
     A            TC5DAA0        8  0       COLHDG('Aggiornamento data..')
     A            TC5ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            TC5PGV0       10          COLHDG('Aggiornamento progr.')
     A            TC5CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            TC5DAIMP0      8  0       COLHDG('Data immissione riga')
     A            TC5CDAGE0      3          COLHDG('Codice agente ......')
     A            TC5CDFAG0      6          COLHDG('Fornitore ..........')
     A            TC5IMPOAC0    11  2       COLHDG('Imponibile venduto .')
     A            TC5PROVAC0    11  2       COLHDG('Provvigioni ........')
     A            TC5PROVII0    11  2       COLHDG('Compenso incassi ...')
     A            TC5MINIMO0    11  2       COLHDG('Minimo garantito ...')
     A            TC5FISSOM0    11  2       COLHDG('Fisso ..............')
     A            TC5GIACON0    11  2       COLHDG('Contabilizzato .....')
     A            TC5UNIVOC0     9  0       COLHDG('Numero univoco .....')
     A            TC5NOTE0      60          COLHDG('Note ...............')
     *
     A            TC5F010        2          COLHDG('Flag 01 ............')
     A            TC5F020        2          COLHDG('Flag 02 ............')
     A            TC5F030        2          COLHDG('Flag 03 ............')
     A            TC5F040        2          COLHDG('Flag 04 ............')
     A            TC5F050        2          COLHDG('Flag 05.............')
     A            TC5F060        2          COLHDG('Flag 06 ............')
     A            TC5F070       10          COLHDG('Flag 07 ............')
     A            TC5F080       10          COLHDG('Flag 08 ............')
     A            TC5F090       10          COLHDG('Flag 09 ............')
     A            TC5F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : FORMOLF0                                     *
     *  DESCRIZIONE   : Memoriz. Formule Molino utilizzata x Lavoraz.*
     *  PREFISSO      : FM1                                          *
     * =============================================================== *
     *
     A            FM1STX0        1          COLHDG('Stato ..............')
     A            FM1USX0       10          COLHDG('Immissione utente...')
     A            FM1DAX0        8  0       COLHDG('Immissione data ....')
     A            FM1ORX0        6  0       COLHDG('Immissione ora .....')
     A            FM1PGI0       10          COLHDG('Immissione programma')
     A            FM1CAZ0       10          COLHDG('Immissione azione...')
     A            FM1USA0       10          COLHDG('Aggiornamento utente')
     A            FM1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            FM1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            FM1PGV0       10          COLHDG('Aggiornamento progr.')
     A            FM1CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            FM1CDMAG0      2          COLHDG('Magazzino ..........')
     A            FM1NRSES0      9  0       COLHDG('Nr Sessione ........')
     A            FM1NRMOV0      4  0       COLHDG('Nr Movimento .......')
     A            FM1DAOPE0      8  0       COLHDG('Data operazione ....')
     A            FM1QTALA0     12  2       COLHDG('Q.tà Lavorata ......')
     A            FM1CDFOR0      6          COLHDG('Formula ............')
      *
     A            FM1CAUEL0      2          COLHDG('Caus. Elemento .....')
     A            FM1CODEL0     15          COLHDG('Cod.  Elemento .....')
     A            FM1PEREL0      7  4       COLHDG('Perc. Elemento .....')
     A            FM1QTAEL0     12  2       COLHDG('Q.tà  Elemento .....')
     A            FM1SILEL0      6          COLHDG('Silos Elemento .....')
     *
     A            FM1F010        2          COLHDG('Flag 01 ............')
     A            FM1F020        2          COLHDG('Flag 02 ............')
     A            FM1F030        2          COLHDG('Flag 03 ............')
     A            FM1F040        2          COLHDG('Flag 04 ............')
     A            FM1F050        2          COLHDG('Flag 05.............')
     A            FM1F060        2          COLHDG('Flag 06 ............')
     A            FM1F070       10          COLHDG('Flag 07 ............')
     A            FM1F080       10          COLHDG('Flag 08 ............')
     A            FM1F090       10          COLHDG('Flag 09 ............')
     A            FM1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MAGVALF0                                     *
     *  DESCRIZIONE   : Magazzino Valorizzato Molino (Mese)          *
     *  PREFISSO      : MV1                                          *
     * =============================================================== *
     A            MV1CDMAG0      3          COLHDG('Magazzino ..........')
     A            MV1ANNOE0      4  0       COLHDG('Anno ...............')
     A            MV1MESEE0      2  0       COLHDG('Mese ...............')
     A            MV1TIPOP0      2          COLHDG('Tipo Prodotto ......')
     A            MV1CDPAR0     15          COLHDG('Cod.Articolo .......')
     A            MV1DEPAR0     30          COLHDG('Des.Articolo .......')
     A            MV1CECOS0      4          COLHDG('Centro di Costo ....')
      *
     A            MV1QINVI0     12  2       COLHDG('Q.tà Inv.Iniziale ..')
     A            MV1PINVI0     12  4       COLHDG('P.zo Inv.Iniziale ..')
     A            MV1VINVI0     12  2       COLHDG('Val. Inv.Iniziale ..')
     A            MV1QACQU0     12  2       COLHDG('Q.tà Acquisto ......')
     A            MV1PACQU0     12  4       COLHDG('P.zo Acquisto ......')
     A            MV1VACQU0     12  2       COLHDG('Val. Acquisto ......')
     A            MV1QPROD0     12  2       COLHDG('Q.tà Produzione ....')
     A            MV1PPROD0     12  4       COLHDG('P.zo Produzione ....')
     A            MV1VPROD0     12  2       COLHDG('Val. Produzione ....')
     A            MV1QTRAE0     12  2       COLHDG('Q.tà Trasf. Entrata.')
     A            MV1PTRAE0     12  4       COLHDG('P.zo Trasf. Entrata.')
     A            MV1VTRAE0     12  2       COLHDG('Val. Trasf. Entrata.')
     A            MV1QVEND0     12  2       COLHDG('Q.tà Vendita .......')
     A            MV1PVEND0     12  4       COLHDG('P.zo Vendita .......')
     A            MV1VVEND0     12  2       COLHDG('Val. Vendita .......')
     A            MV1QCONS0     12  2       COLHDG('Q.tà Consumi .......')
     A            MV1PCONS0     12  4       COLHDG('P.zo Consumi .......')
     A            MV1VCONS0     12  2       COLHDG('Val. Consumi .......')
     A            MV1QTRAU0     12  2       COLHDG('Q.tà Trasf. Uscita .')
     A            MV1PTRAU0     12  4       COLHDG('P.zo Trasf. Uscita .')
     A            MV1VTRAU0     12  2       COLHDG('Val. Trasf. Uscita .')
     A            MV1QGIAC0     12  2       COLHDG('Q.tà Giacenza ......')
     A            MV1PGIAC0     12  4       COLHDG('P.zo Giacenza ......')
     A            MV1VGIAC0     12  2       COLHDG('Val. Giacenza ......')
     A            MV1QRETT0     12  2       COLHDG('Q.tà Rettifica .....')
     A            MV1PRETT0     12  4       COLHDG('P.zo Rettifica .....')
     A            MV1VRETT0     12  2       COLHDG('Val. Rettifica .....')
     A            MV1QINVF0     12  2       COLHDG('Q.tà Inv. Finale ...')
     A            MV1PINVF0     12  4       COLHDG('P.zo Inv. Finale ...')
     A            MV1VINVF0     12  2       COLHDG('Val. Inv. Finale ...')
     * =============================================================== *
     *  ARCHIVIO      : ACQMESF0                                     *
     *  DESCRIZIONE   : P.zo medio degli Acquisti del periodo        *
     *  PREFISSO      : AC1                                          *
     * =============================================================== *
     *
     A            AC1CDMAG0      3          COLHDG('Magazzino ..........')
     A            AC1DATAI0      8  0       COLHDG('Data inizio periodo.')
     A            AC1DATAF0      8  0       COLHDG('Data fine   periodo.')
     A            AC1CDPAR0     15          COLHDG('Cod. Articolo ......')
     A            AC1DEPAR0     30          COLHDG('Des. Articolo ......')
     A            AC1QUANT0     12  2       COLHDG('Q.tà Acquisto ......')
     A            AC1PZOME0     18  6       COLHDG('P.zo medio E/Kg.....')
     A            AC1PZOAC0     18  6       COLHDG('P.zo accessori E/Kg.')
     * =============================================================== *
     *  ARCHIVIO      : ACQMEDF0                                     *
     *  DESCRIZIONE   : Acquisti per Fornitori con P.zo Medio        *
     *  PREFISSO      : AC2                                          *
     * =============================================================== *
     *
     A            AC2CDMAG0      3          COLHDG('Magazzino ..........')
     A            AC2DAING0      8  0       COLHDG('Data Ingresso ......')
     A            AC2CDFOR0      6          COLHDG('Cod. Fornitore .....')
     A            AC2DSFOR0     35          COLHDG('Rag.Soc. Fornitore .')
     A            AC2NRBEM0      9  0       COLHDG('Nr Bem .............')
     A            AC2DTBEM0      9  0       COLHDG('Dt Bem .............')
     A            AC2CDPAR0     15          COLHDG('Cod. Articolo ......')
     A            AC2DEPAR0     30          COLHDG('Des. Articolo ......')
     A            AC2QUANT0     12  2       COLHDG('Q.tà Entrata .......')
     A            AC2VALOR0     18  6       COLHDG('Valore movimento ...')
     A            AC2PREZZ0     18  6       COLHDG('P.zo ...............')
     A            AC2PREAC0     18  6       COLHDG('P.zo Accessori .....')
     * =============================================================== *
     *  ARCHIVIO      : INVVALF0                                     *
     *  DESCRIZIONE   : Inventario Valorizzato                       *
     *  PREFISSO      : IV1                                          *
     * =============================================================== *
     *
     A            IV1CDMAG0      3          COLHDG('Magazzino ..........')
     A            IV1ANNOI0      4  0       COLHDG('Anno ...............')
     A            IV1MESEI0      2  0       COLHDG('Mese ...............')
     A            IV1TIPOP0      2          COLHDG('Tipo Articolo ......')
     A            IV1CDPAR0     15          COLHDG('Cod. Articolo ......')
     A            IV1DEPAR0     30          COLHDG('Des. Articolo ......')
     A            IV1QUANT0     12  2       COLHDG('Q.tà Inventario ....')
     A            IV1PREZZ0     18  6       COLHDG('P.zo Inventario ....')
     A            IV1VALOR0     12  2       COLHDG('Valore Inventario ..')
     * =============================================================== *
     *  ARCHIVIO      : PZOMANF0                                     *
     *  DESCRIZIONE   : Tab. P.zo Manuale                            *
     *  PREFISSO      : PZ1                                          *
     * =============================================================== *
     *
     A            PZ1CDMAG0      3          COLHDG('Magazzino ..........')
     A            PZ1ANNOI0      4  0       COLHDG('Anno ...............')
     A            PZ1MESEI0      2  0       COLHDG('Mese ...............')
     A            PZ1CDPAR0     15          COLHDG('Cod. Articolo ......')
     A            PZ1PREZZ0     18  6       COLHDG('P.zo manuale .......')
     * =============================================================== *
     *  ARCHIVIO      : MOLSMLF0                                     *
     *  DESCRIZIONE   : Perc. SemiLavorati della Macinazione Grani   *
     *  PREFISSO      : SL1                                          *
     * =============================================================== *
     *
     A            SL1STX0        1          COLHDG('Stato ..............')
     A            SL1USX0       10          COLHDG('Immissione utente...')
     A            SL1DAX0        8  0       COLHDG('Immissione data ....')
     A            SL1ORX0        6  0       COLHDG('Immissione ora .....')
     A            SL1PGI0       10          COLHDG('Immissione programma')
     A            SL1CAZ0       10          COLHDG('Immissione azione...')
     A            SL1USA0       10          COLHDG('Aggiornamento utente')
     A            SL1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            SL1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            SL1PGV0       10          COLHDG('Aggiornamento progr.')
     A            SL1CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            SL1CDMAG0      3          COLHDG('Magazzino ..........')
     A            SL1ANNOE0      4  0       COLHDG('Anno ...............')
     A            SL1MESEE0      2  0       COLHDG('Mese ...............')
     A            SL1TIPOP0      1          COLHDG('D=Duro, T=Tenero ...')
     A            SL1CDPAR0     15          COLHDG('Cod.Articolo .......')
     A            SL1PERCE0      5  2       COLHDG('Perc.SML ...........')
     A            SL1PREZZ0     12  4       COLHDG('P.zo SML ...........')
     *
     A            SL1F010        2          COLHDG('Flag 01 ............')
     A            SL1F020        2          COLHDG('Flag 02 ............')
     A            SL1F030        2          COLHDG('Flag 03 ............')
     A            SL1F040        2          COLHDG('Flag 04 ............')
     A            SL1F050        2          COLHDG('Flag 05.............')
     A            SL1F060        2          COLHDG('Flag 06 ............')
     A            SL1F070       10          COLHDG('Flag 07 ............')
     A            SL1F080       10          COLHDG('Flag 08 ............')
     A            SL1F090       10          COLHDG('Flag 09 ............')
     A            SL1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MOLSOPF0                                     *
     *  DESCRIZIONE   : Perc. Sotto Prodotti della Macinazione Grani *
     *  PREFISSO      : SP1                                          *
     * =============================================================== *
     *
     A            SP1STX0        1          COLHDG('Stato ..............')
     A            SP1USX0       10          COLHDG('Immissione utente...')
     A            SP1DAX0        8  0       COLHDG('Immissione data ....')
     A            SP1ORX0        6  0       COLHDG('Immissione ora .....')
     A            SP1PGI0       10          COLHDG('Immissione programma')
     A            SP1CAZ0       10          COLHDG('Immissione azione...')
     A            SP1USA0       10          COLHDG('Aggiornamento utente')
     A            SP1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            SP1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            SP1PGV0       10          COLHDG('Aggiornamento progr.')
     A            SP1CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            SP1CDMAG0      3          COLHDG('Magazzino ..........')
     A            SP1ANNOE0      4  0       COLHDG('Anno ...............')
     A            SP1MESEE0      2  0       COLHDG('Mese ...............')
     A            SP1TIPOP0      1          COLHDG('D=Duro, T=Tenero ...')
     A            SP1CDPAR0     15          COLHDG('Cod.Articolo SP.....')
     A            SP1PERCE0      5  2       COLHDG('Perc.SP ............')
     A            SP1PREZZ0     12  4       COLHDG('P.zo SP ............')
     *
     A            SP1F010        2          COLHDG('Flag 01 ............')
     A            SP1F020        2          COLHDG('Flag 02 ............')
     A            SP1F030        2          COLHDG('Flag 03 ............')
     A            SP1F040        2          COLHDG('Flag 04 ............')
     A            SP1F050        2          COLHDG('Flag 05.............')
     A            SP1F060        2          COLHDG('Flag 06 ............')
     A            SP1F070       10          COLHDG('Flag 07 ............')
     A            SP1F080       10          COLHDG('Flag 08 ............')
     A            SP1F090       10          COLHDG('Flag 09 ............')
     A            SP1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : COSENEF0                                     *
     *  DESCRIZIONE   : Costi Fissi Produzione (Energia)             *
     *  PREFISSO      : CA1                                          *
     * =============================================================== *
     *
     A            CA1STX0        1          COLHDG('Stato ..............')
     A            CA1USX0       10          COLHDG('Immissione utente...')
     A            CA1DAX0        8  0       COLHDG('Immissione data ....')
     A            CA1ORX0        6  0       COLHDG('Immissione ora .....')
     A            CA1PGI0       10          COLHDG('Immissione programma')
     A            CA1CAZ0       10          COLHDG('Immissione azione...')
     A            CA1USA0       10          COLHDG('Aggiornamento utente')
     A            CA1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CA1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CA1PGV0       10          COLHDG('Aggiornamento progr.')
     A            CA1CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            CA1CDMAG0      3          COLHDG('Magazzino ..........')
     A            CA1TIPOP0      2          COLHDG('Tipo = Duro/Tenero .')
     A            CA1ENELE0     12  4       COLHDG('Costo En.Elettrica .')
     A            CA1ENTER0     12  4       COLHDG('Costo En.Termica ...')
     A            CA1TRAFI0     12  4       COLHDG('Costo Trafile ......')
     *
     A            CA1F010        2          COLHDG('Flag 01 ............')
     A            CA1F020        2          COLHDG('Flag 02 ............')
     A            CA1F030        2          COLHDG('Flag 03 ............')
     A            CA1F040        2          COLHDG('Flag 04 ............')
     A            CA1F050        2          COLHDG('Flag 05.............')
     A            CA1F060        2          COLHDG('Flag 06 ............')
     A            CA1F070       10          COLHDG('Flag 07 ............')
     A            CA1F080       10          COLHDG('Flag 08 ............')
     A            CA1F090       10          COLHDG('Flag 09 ............')
     A            CA1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : COSCONF0                                     *
     *  DESCRIZIONE   : Costi Fissi Produzione (Confezionamento)     *
     *  PREFISSO      : CA2                                          *
     * =============================================================== *
     *
     A            CA2STX0        1          COLHDG('Stato ..............')
     A            CA2USX0       10          COLHDG('Immissione utente...')
     A            CA2DAX0        8  0       COLHDG('Immissione data ....')
     A            CA2ORX0        6  0       COLHDG('Immissione ora .....')
     A            CA2PGI0       10          COLHDG('Immissione programma')
     A            CA2CAZ0       10          COLHDG('Immissione azione...')
     A            CA2USA0       10          COLHDG('Aggiornamento utente')
     A            CA2DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CA2ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CA2PGV0       10          COLHDG('Aggiornamento progr.')
     A            CA2CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            CA2CDMAG0      3          COLHDG('Magazzino ..........')
     A            CA2CONFE0      2          COLHDG('Confezione .........')
     A            CA2SALAR0     12  4       COLHDG('Costo Salari .......')
     A            CA2COSAC0     12  4       COLHDG('Costo Sacco ........')
     *
     A            CA2F010        2          COLHDG('Flag 01 ............')
     A            CA2F020        2          COLHDG('Flag 02 ............')
     A            CA2F030        2          COLHDG('Flag 03 ............')
     A            CA2F040        2          COLHDG('Flag 04 ............')
     A            CA2F050        2          COLHDG('Flag 05.............')
     A            CA2F060        2          COLHDG('Flag 06 ............')
     A            CA2F070       10          COLHDG('Flag 07 ............')
     A            CA2F080       10          COLHDG('Flag 08 ............')
     A            CA2F090       10          COLHDG('Flag 09 ............')
     A            CA2F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : COSFISF0                                     *
     *  DESCRIZIONE   : Costi Fissi Produzione (Fissi Stab.)         *
     *  PREFISSO      : CA3                                          *
     * =============================================================== *
     *
     A            CA3STX0        1          COLHDG('Stato ..............')
     A            CA3USX0       10          COLHDG('Immissione utente...')
     A            CA3DAX0        8  0       COLHDG('Immissione data ....')
     A            CA3ORX0        6  0       COLHDG('Immissione ora .....')
     A            CA3PGI0       10          COLHDG('Immissione programma')
     A            CA3CAZ0       10          COLHDG('Immissione azione...')
     A            CA3USA0       10          COLHDG('Aggiornamento utente')
     A            CA3DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CA3ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CA3PGV0       10          COLHDG('Aggiornamento progr.')
     A            CA3CAV0       10          COLHDG('Aggiornamento azione')
     *
     A            CA3CDMAG0      3          COLHDG('Magazzino ..........')
     A            CA3COFIS0     12  4       COLHDG('Costo Fisso ........')
     *
     A            CA3F010        2          COLHDG('Flag 01 ............')
     A            CA3F020        2          COLHDG('Flag 02 ............')
     A            CA3F030        2          COLHDG('Flag 03 ............')
     A            CA3F040        2          COLHDG('Flag 04 ............')
     A            CA3F050        2          COLHDG('Flag 05.............')
     A            CA3F060        2          COLHDG('Flag 06 ............')
     A            CA3F070       10          COLHDG('Flag 07 ............')
     A            CA3F080       10          COLHDG('Flag 08 ............')
     A            CA3F090       10          COLHDG('Flag 09 ............')
     A            CA3F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : EXCON1F0                                     *
     *  DESCRIZIONE   : File Excel per Concetti n.1                  *
     *  PREFISSO      : EX1                                          *
     * =============================================================== *
     A            EX1CDMAG0      3          COLHDG('Magazzino ..........')
     A            EX1CDIMP0      3          COLHDG('Impianto ...........')
     A            EX1CDPRO0     15          COLHDG('Codice prodotto.....')
     A            EX1CONFE0      2          COLHDG('Confezione .........')
     A            EX1DESPR0     30          COLHDG('Descrizione prodotto')
     A            EX1UNIMI0      2          COLHDG('Unità di Misura ....')
     A            EX1QTAPR0      9  0       COLHDG('Q.tà prodotta ......')
     A            EX1QTAPZ0      9  0       COLHDG('Q.tà prodotta parz..')
     A            EX1DATIN0      8  0       COLHDG('Data iniziale ......')
     A            EX1ORIIN0      4  0       COLHDG('Ora  iniziale ......')
     A            EX1DATFI0      8  0       COLHDG('Data finale ........')
     A            EX1ORIFI0      4  0       COLHDG('Ora  finale ........')
     A            EX1TEMPR0      4  0       COLHDG('HH:MM produzione....')
     A            EX1NUMSA0      5  0       COLHDG('Numero sacchi ......')
     A            EX1NUMSO0      5  0       COLHDG('Numero sacchi / h ..')
     A            EX1TIPSA0     20          COLHDG('Tipo sacco .........')
     A            EX1TIPPR0     20          COLHDG('Tipo prodotto ......')
     * =============================================================== *
     *  ARCHIVIO      : EXCON2F0                                     *
     *  DESCRIZIONE   : File Excel per Concetti n.2                  *
     *  PREFISSO      : EX2                                          *
     * =============================================================== *
     A            EX2CDMAG0      2          COLHDG('Magazzino ..........')
     A            EX2CDIMP0      3          COLHDG('Impianto ...........')
     A            EX2DATUR0      8  0       COLHDG('Data turno..........')
     A            EX2NUTUR0      1  0       COLHDG('Numero turno........')
     A            EX2NUMSA0      7  0       COLHDG('Numero sacchi.......')
     A            EX2SACOR0      6  0       COLHDG('Numero sacchi/ora...')
     A            EX2SACO20      6  0       COLHDG('Numero sacchi/ora 2.')
     A            EX2TEMFE0      6  0       COLHDG('Ore di fermo HHHH:MM')
     A            EX2TEMPR0      6  0       COLHDG('Ore di produzione...')
     A            EX2NUSAC0      7  0       COLHDG('Sacchi di carta.....')
     A            EX2NUSAP0      7  0       COLHDG('Sacchi di plastica..')
     A            EX2NUSFA0      7  0       COLHDG('Sacchi Farina.......')
     A            EX2NUSCU0      7  0       COLHDG('Sacchi Cubetto......')
     A            EX2NUSMI0      7  0       COLHDG('Sacchi Miscele......')
     A            EX2NUSSC0      7  0       COLHDG('Sacchi Schiacciati..')
     A            EX2NUSSB0      7  0       COLHDG('Sacchi Sbriciolati..')
     A            EX2SAC050      7  0       COLHDG('Sacchi da 05 Kg ....')
     A            EX2SAC100      7  0       COLHDG('Sacchi da 10 Kg ....')
     A            EX2SAC200      7  0       COLHDG('Sacchi da 20 Kg ....')
     A            EX2SAC250      7  0       COLHDG('Sacchi da 25 Kg ....')
     A            EX2SAC300      7  0       COLHDG('Sacchi da 30 Kg ....')
     A            EX2SAC400      7  0       COLHDG('Sacchi da 40 Kg ....')
     A            EX2SAC500      7  0       COLHDG('Sacchi da 50 Kg ....')
     A            EX2NUCAM0      4  0       COLHDG('Numero cambi x turno')
     * =============================================================== *
     *  ARCHIVIO      : NOPALLF0                                     *
     *  DESCRIZIONE   : Note credito pallet/europallet resi.         *
     *  PREFISSO      : PLN                                          *
     * =============================================================== *
     A            PLNSTX0        1          COLHDG('Stato ..............')
     A            PLNUSX0       10          COLHDG('Immissione utente...')
     A            PLNDAX0        8  0       COLHDG('Immissione data ....')
     A            PLNORX0        6  0       COLHDG('Immissione ora .....')
     A            PLNPGI0       10          COLHDG('Immissione programma')
     A            PLNCAZ0       10          COLHDG('Immissione azione...')
     A            PLNUSA0       10          COLHDG('Aggiornamento utente')
     A            PLNDAA0        8  0       COLHDG('Aggiornamento data..')
     A            PLNORA0        6  0       COLHDG('Aggiornamento ora...')
     A            PLNPGV0       10          COLHDG('Aggiornamento progr.')
     A            PLNCAV0       10          COLHDG('Aggiornamento azione')
     A            PLNSOC0        2          COLHDG('Società ............')
     *
     A            PLNCLI0        6          COLHDG('Cliente.............')
     A            PLNCLF0        6          COLHDG('Cliente fatturazione')
     A            PLNTRA0        6          COLHDG('Trasportatore.......')
     A            PLNCLT0        2          COLHDG('CL/TR clie/Trasp....')
     A            PLNPRO0       15          COLHDG('Prodotto ...........')
     A            PLNDAB0        8  0       COLHDG('Data bolla..........')
     A            PLNNUB0        9  0       COLHDG('Numero bolla........')
     A            PLNTIB0        2          COLHDG('Tipo bolla..........')
     A            PLNDAR0        8  0       COLHDG('Data doc.di reso....')
     A            PLNNUR0        9  0       COLHDG('Numero doc.di reso..')
     A            PLNTIR0        2          COLHDG('Tipo   doc.di reso..')
     A            PLNMAG0        2          COLHDG('Codice magazzino....')
     A            PLNDAN0        8  0       COLHDG('Data nota credito...')
     A            PLNSIN0        4          COLHDG('Sigla nota credito..')
     A            PLNNUN0        6  0       COLHDG('Numero nota credito.')
     A            PLNQRE0        4  0       COLHDG('Q.tà documento......')
     A            PLNQFA0        4  0       COLHDG('Q.tà notacreditata..')
     *
     A            PLNSAL0        2          COLHDG('Saldata.............')
     *
     A            PLNF010        2          COLHDG('Flag 01 ............')
     A            PLNF020        2          COLHDG('Flag 02 ............')
     A            PLNF030        2          COLHDG('Flag 03 ............')
     A            PLNF040        2          COLHDG('Flag 04 ............')
     A            PLNF050        2          COLHDG('Flag 05.............')
     A            PLNF060        2          COLHDG('Flag 06 ............')
     A            PLNF070       10          COLHDG('Usata da PL0047.....')
     A            PLNF080       10          COLHDG('Usata da PL0047.....')
     A            PLNF090       10          COLHDG('Numero ordine riacc.')
     A            PLNF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : SUPALLF0                                     *
     *  DESCRIZIONE   : Start Up fatture Europallet.                 *
     *  PREFISSO      : PLS                                          *
     * =============================================================== *
     A            PLSSTX0        1          COLHDG('Stato ..............')
     A            PLSUSX0       10          COLHDG('Immissione utente...')
     A            PLSDAX0        8  0       COLHDG('Immissione data ....')
     A            PLSORX0        6  0       COLHDG('Immissione ora .....')
     A            PLSPGI0       10          COLHDG('Immissione programma')
     A            PLSCAZ0       10          COLHDG('Immissione azione...')
     A            PLSUSA0       10          COLHDG('Aggiornamento utente')
     A            PLSDAA0        8  0       COLHDG('Aggiornamento data..')
     A            PLSORA0        6  0       COLHDG('Aggiornamento ora...')
     A            PLSPGV0       10          COLHDG('Aggiornamento progr.')
     A            PLSCAV0       10          COLHDG('Aggiornamento azione')
     A            PLSSOC0        2          COLHDG('Società ............')
     *
     A            PLSCLI0        6          COLHDG('Cliente.............')
     A            PLSCLF0        6          COLHDG('Cliente fatturazione')
     A            PLSTRA0        6          COLHDG('Trasportatore.......')
     A            PLSCLT0        2          COLHDG('CL/TR clie/Trasp....')
     A            PLSPRO0       15          COLHDG('Prodotto ...........')
     A            PLSDAB0        8  0       COLHDG('Data bolla..........')
     A            PLSNUB0        9  0       COLHDG('Numero bolla........')
     A            PLSDAF0        8  0       COLHDG('Data fattura........')
     A            PLSNUF0        9  0       COLHDG('Numero fattura......')
     A            PLSNUM0        9  0       COLHDG('Numero record.......')
     A            PLSMAG0        2          COLHDG('Codice magazzino....')
     *
     A            PLSF010        2          COLHDG('Flag 01 ............')
     A            PLSF020        2          COLHDG('Flag 02 ............')
     A            PLSF030        2          COLHDG('Flag 03 ............')
     A            PLSF040        2          COLHDG('Flag 04 ............')
     A            PLSF050        2          COLHDG('Flag 05.............')
     A            PLSF060        2          COLHDG('Flag 06 ............')
     A            PLSF070       10          COLHDG('Flag 07 ............')
     A            PLSF080       10          COLHDG('Flag 08 ............')
     A            PLSF090       10          COLHDG('Flag 09 ............')
     A            PLSF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : NUORLIF0                                     *
     *  DESCRIZIONE   : Numeri ordine liberi.                        *
     *  PREFISSO      : NLI                                          *
     * =============================================================== *
     A            NLISTX0        1          COLHDG('Stato ..............')
     A            NLIUSX0       10          COLHDG('Immissione utente...')
     A            NLIDAX0        8  0       COLHDG('Immissione data ....')
     A            NLIORX0        6  0       COLHDG('Immissione ora .....')
     A            NLIPGI0       10          COLHDG('Immissione programma')
     A            NLICAZ0       10          COLHDG('Immissione azione...')
     A            NLIUSA0       10          COLHDG('Aggiornamento utente')
     A            NLIDAA0        8  0       COLHDG('Aggiornamento data..')
     A            NLIORA0        6  0       COLHDG('Aggiornamento ora...')
     A            NLIPGV0       10          COLHDG('Aggiornamento progr.')
     A            NLICAV0       10          COLHDG('Aggiornamento azione')
     A            NLISOC0        2          COLHDG('Società ............')
     *
     A            NLIDAO0        8  0       COLHDG('Data ordine.........')
     A            NLINUO0        9  0       COLHDG('Numero ordine.......')
     A            NLITIP0        3          COLHDG('Tipo ordine.........')
     *
     A            NLIF010        2          COLHDG('Flag 01 ............')
     A            NLIF020        2          COLHDG('Flag 02 ............')
     A            NLIF030        2          COLHDG('Flag 03 ............')
     A            NLIF040        2          COLHDG('Flag 04 ............')
     A            NLIF050        2          COLHDG('Flag 05.............')
     A            NLIF060        2          COLHDG('Flag 06 ............')
     A            NLIF070       10          COLHDG('Flag 07 ............')
     A            NLIF080       10          COLHDG('Flag 08 ............')
     A            NLIF090       10          COLHDG('Flag 09 ............')
     A            NLIF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : CLISTRF0                                     *
     *  DESCRIZIONE   : Associazione clienti-User per ins.ordini da c.*
     *  PREFISSO      : CIN                                          *
     * =============================================================== *
     A            CINSTX0        1          COLHDG('Stato ..............')
     A            CINUSX0       10          COLHDG('Immissione utente...')
     A            CINDAX0        8  0       COLHDG('Immissione data ....')
     A            CINORX0        6  0       COLHDG('Immissione ora .....')
     A            CINPGI0       10          COLHDG('Immissione programma')
     A            CINCAZ0       10          COLHDG('Immissione azione...')
     A            CINUSA0       10          COLHDG('Aggiornamento utente')
     A            CINDAA0        8  0       COLHDG('Aggiornamento data..')
     A            CINORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CINPGV0       10          COLHDG('Aggiornamento progr.')
     A            CINCAV0       10          COLHDG('Aggiornamento azione')
     A            CINSOC0        2          COLHDG('Società ............')
     *
     A            CINUST0       20          COLHDG('User Strategi ......')
     A            CINPSW0       20          COLHDG('Password strategi...')
     A            CINCLI0        6          COLHDG('Cliente ............')
     *
     A            CINF010        2          COLHDG('Magazzino default ..')
     A            CINF020        2          COLHDG('Flag 02 ............')
     A            CINF030        2          COLHDG('Flag 03 ............')
     A            CINF040        2          COLHDG('Flag 04 ............')
     A            CINF050        2          COLHDG('Flag 05.............')
     A            CINF060        2          COLHDG('Flag 06 ............')
     A            CINF070       10          COLHDG('Flag 07 ............')
     A            CINF080       10          COLHDG('Flag 08 ............')
     A            CINF090       10          COLHDG('Flag 09 ............')
     A            CINF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : STOSIPF0                                     *
     *  DESCRIZIONE   : Storico associazione Silos - Prodotti        *
     *  PREFISSO      : CA4                                          *
     * =============================================================== *
     A            CA4STX0        1          COLHDG('Stato ..............')
     A            CA4USX0       10          COLHDG('Immissione utente...')
     A            CA4DAX0        8  0       COLHDG('Immissione data ....')
     A            CA4ORX0        6  0       COLHDG('Immissione ora .....')
     A            CA4PGI0       10          COLHDG('Immissione programma')
     A            CA4CAZ0       10          COLHDG('Immissione azione...')
     A            CA4USA0       10          COLHDG('Aggiornamento utente')
     A            CA4DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CA4ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CA4PGV0       10          COLHDG('Aggiornamento progr.')
     A            CA4CAV0       10          COLHDG('Aggiornamento azione')
     A            CA4SOC0        2          COLHDG('Società ............')
     *
     A            CA4DAT0        8  0       COLHDG('Data variazione ....')
     A            CA4ORV0        6  0       COLHDG('Ora variazione .....')
     A            CA4STB0        3          COLHDG('Stabilimento .......')
     A            CA4MAG0        3          COLHDG('Magazzino ..........')
     A            CA4SIL0        6          COLHDG('Codice silos .......')
     A            CA4PRO0       15          COLHDG('Codice prodotto.....')
     A            CA4SES0        9  0       COLHDG('Numero sessione ....')
     A            CA4MOV0        4  0       COLHDG('Numero movimento....')
     A            CA4MOS0        4  0       COLHDG('Numero movimento....')
     *
     A            CA4F010        2          COLHDG('Flag 01 ............')
     A            CA4F020        2          COLHDG('Flag 02 ............')
     A            CA4F030        2          COLHDG('Flag 03 ............')
     A            CA4F040        2          COLHDG('Flag 04 ............')
     A            CA4F050        2          COLHDG('Flag 05.............')
     A            CA4F060        2          COLHDG('Flag 06 ............')
     A            CA4F070       10          COLHDG('Flag 07 ............')
     A            CA4F080       10          COLHDG('Flag 08 ............')
     A            CA4F090       10          COLHDG('Flag 09 ............')
     A            CA4F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : CANVASF0                                     *
     *  DESCRIZIONE   : Canvass da applicare                         *
     *  PREFISSO      : CS0                                          *
     * =============================================================== *
     A            CS0STX0        1          COLHDG('Stato ..............')
     A            CS0USX0       10          COLHDG('Immissione utente...')
     A            CS0DAX0        8  0       COLHDG('Immissione data ....')
     A            CS0ORX0        6  0       COLHDG('Immissione ora .....')
     A            CS0PGI0       10          COLHDG('Immissione programma')
     A            CS0CAZ0       10          COLHDG('Immissione azione...')
     A            CS0USA0       10          COLHDG('Aggiornamento utente')
     A            CS0DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CS0ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CS0PGV0       10          COLHDG('Aggiornamento progr.')
     A            CS0CAV0       10          COLHDG('Aggiornamento azione')
     A            CS0SOC0        2          COLHDG('Società ............')
     *
     A            CS0COD0        4          COLHDG('Cod.Canvass ........')
     A            CS0PRO0       15          COLHDG('Cod.Prodotto .......')
     A            CS0QTA0       12  2       COLHDG('Q.tà ...............')
     A            CS0OMA0        1          COLHDG('Omaggio ............')
     A            CS0PZO0       12  4       COLHDG('Prezzo .............')
     A            CS0DTI0        8  0       COLHDG('Data Inizio Val. ...')
     A            CS0DTF0        8  0       COLHDG('Data Fine   Val. ...')
     *
     A            CS0F010        2          COLHDG('Flag 01 ............')
     A            CS0F020        2          COLHDG('Flag 02 ............')
     A            CS0F030        2          COLHDG('Flag 03 ............')
     A            CS0F040        2          COLHDG('Flag 04 ............')
     A            CS0F050        2          COLHDG('Flag 05.............')
     A            CS0F060        2          COLHDG('Flag 06 ............')
     A            CS0F070       10          COLHDG('Flag 07 ............')
     A            CS0F080       10          COLHDG('Flag 08 ............')
     A            CS0F090       10          COLHDG('Flag 09 ............')
     A            CS0F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : CANVA1F0                                     *
     *  DESCRIZIONE   : Canvass applicato                            *
     *  PREFISSO      : CS1                                          *
     * =============================================================== *
     A            CS1STX0        1          COLHDG('Stato ..............')
     A            CS1USX0       10          COLHDG('Immissione utente...')
     A            CS1DAX0        8  0       COLHDG('Immissione data ....')
     A            CS1ORX0        6  0       COLHDG('Immissione ora .....')
     A            CS1PGI0       10          COLHDG('Immissione programma')
     A            CS1CAZ0       10          COLHDG('Immissione azione...')
     A            CS1USA0       10          COLHDG('Aggiornamento utente')
     A            CS1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CS1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CS1PGV0       10          COLHDG('Aggiornamento progr.')
     A            CS1CAV0       10          COLHDG('Aggiornamento azione')
     A            CS1SOC0        2          COLHDG('Società ............')
     *
     A            CS1DAO0        8  0       COLHDG('Data Ordine ........')
     A            CS1NUO0        9  0       COLHDG('Num. Ordine ........')
     A            CS1COD0        4          COLHDG('Cod.Canvass ........')
     A            CS1QTA0        4  0       COLHDG('Nr Canvass applic...')
     A            CS1CAN0        2          COLHDG('Canvass su Righe Ord')
     *
     A            CS1F010        2          COLHDG('Flag 01 ............')
     A            CS1F020        2          COLHDG('Flag 02 ............')
     A            CS1F030        2          COLHDG('Flag 03 ............')
     A            CS1F040        2          COLHDG('Flag 04 ............')
     A            CS1F050        2          COLHDG('Flag 05.............')
     A            CS1F060        2          COLHDG('Flag 06 ............')
     A            CS1F070       10          COLHDG('Flag 07 ............')
     A            CS1F080       10          COLHDG('Flag 08 ............')
     A            CS1F090       10          COLHDG('Flag 09 ............')
     A            CS1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : REPEREF0                                     *
     *  DESCRIZIONE   : Registrazione pesate recuperi                *
     *  PREFISSO      : CS2                                          *
     * =============================================================== *
     A            CS2STX0        1          COLHDG('Stato ..............')
     A            CS2USX0       10          COLHDG('Immissione utente...')
     A            CS2DAX0        8  0       COLHDG('Immissione data ....')
     A            CS2ORX0        6  0       COLHDG('Immissione ora .....')
     A            CS2PGI0       10          COLHDG('Immissione programma')
     A            CS2CAZ0       10          COLHDG('Immissione azione...')
     A            CS2USA0       10          COLHDG('Aggiornamento utente')
     A            CS2DAA0        8  0       COLHDG('Aggiornamento data..')
     A            CS2ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CS2PGV0       10          COLHDG('Aggiornamento progr.')
     A            CS2CAV0       10          COLHDG('Aggiornamento azione')
     A            CS2SOC0        2          COLHDG('Società ............')
     *
     A            CS2STB0        3          COLHDG('Stabilimento .......')
     A            CS2MAG0        3          COLHDG('Magazzino ..........')
     A            CS2DAT0        8  0       COLHDG('Data registrazione..')
     A            CS2PRO0       15          COLHDG('Codice prodotto.....')
     A            CS2QTA0       12  2       COLHDG('Quantità proposta...')
     A            CS2QTR0       12  2       COLHDG('Quantità registrata.')
     A            CS2SNR0        2          COLHDG('SI/NO da registrare.')
     A            CS2NRS0        9  0       COLHDG('Numero sessione.....')
     A            CS2NRM0        4  0       COLHDG('Numero movimento....')
     A            CS2FAT0        2          COLHDG('SI = fatturato......')
     *
     A            CS2F010        2          COLHDG('Flag 01 ............')
     A            CS2F020        2          COLHDG('Flag 02 ............')
     A            CS2F030        2          COLHDG('Flag 03 ............')
     A            CS2F040        2          COLHDG('Flag 04 ............')
     A            CS2F050        2          COLHDG('Flag 05.............')
     A            CS2F060        2          COLHDG('Flag 06 ............')
     A            CS2F070       10          COLHDG('Flag 07 ............')
     A            CS2F080       10          COLHDG('Flag 08 ............')
     A            CS2F090       10          COLHDG('Flag 09 ............')
     A            CS2F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : MGZI42F0                                  *
     *  DESCRIZIONE   : Magazzinaggi INDESIL: ingressi da bolle.  *
     *  PREFISSO      : MBI                                       *
     ****************************************************************
     A            MBISTX0        1          COLHDG('Stato ..............')
     A            MBIUSX0       10A         COLHDG('Utente immissione...')
     A            MBIDAX0        8  0       COLHDG('Data immissione ....')
     A            MBIORX0        6  0       COLHDG('Ora immissione .....')
     A            MBICAZ0       10A         COLHDG('Codice azione ......')
     A            MBIPGI0       10A         COLHDG('Programma immissione')
     A            MBIUSA0       10A         COLHDG('Utente aggiornam....')
     A            MBIDAA0        8  0       COLHDG('Data aggiornam. ....')
     A            MBIORA0        6  0       COLHDG('Ora aggiornam. .....')
     A            MBICAV0       10A         COLHDG('Codice azione varia.')
     A            MBIPGV0       10A         COLHDG('Programma variazione')
     A            MBISOC0        2          COLHDG('Società ............')
      *
     A            MBIDAO0        8  0       COLHDG('Data ordine ........')
     A            MBISGO0        4          COLHDG('Sig. ordine ........')
     A            MBINRO0        9  0       COLHDG('nr.  ordine ........')
     A            MBIDAC0        8  0       COLHDG('Data inserimento....')
     A            MBIDAD0        8  0       COLHDG('Data documento .....')
     A            MBISID0        4          COLHDG('Sigla documento ....')
     A            MBINUD0        9  0       COLHDG('Numero documento ...')
     A            MBITID0        3          COLHDG('Tipo documento .....')
     A            MBINUI0        9  0       COLHDG('Numero interno .....')
     A            MBISIL0        6          COLHDG('Silos ..............')
     A            MBIQTA0       13  2       COLHDG('Q.tà silos .........')
     A            MBINVI0        9  0       COLHDG('Numero viaggio ingr.')
     A            MBIVET0        4          COLHDG('Codice vettore .....')
     A            MBITAR0       12          COLHDG('Targa  vettore .....')
     A            MBIDV10       40          COLHDG('Dati vettore 1 .....')
     A            MBIDV20       40          COLHDG('Dati vettore 2 .....')
     A            MBIDV30       40          COLHDG('Dati vettore 3 .....')
     A            MBIPLO0       13  2       COLHDG('Peso lordo .........')
     A            MBIPTA0       13  2       COLHDG('Peso tara ..........')
     A            MBIPNE0       13  2       COLHDG('Peso netto .........')
     A            MBINRS0        9  0       COLHDG('Numero sessione.....')
     A            MBINRM0        4  0       COLHDG('Numero movimento....')
     A            MBIFOR0        6          COLHDG('Codice fornitore....')
     A            MBIUMI0        5  2       COLHDG('% umidità ..........')
     A            MBIGLU0        5  2       COLHDG('% glutine ..........')
     A            MBIPRO0        5  2       COLHDG('% proteine .........')
     A            MBIPE10        5  2       COLHDG('% da usare .........')
     A            MBIPE20        5  2       COLHDG('% da usare .........')
     A            MBIPE30        5  2       COLHDG('% da usare .........')
      *
     A            MBIF010        2          COLHDG('Flag 01 ............')
     A            MBIF020        2          COLHDG('Flag 02 ............')
     A            MBIF030        2          COLHDG('Flag 03 ............')
     A            MBIF040        2          COLHDG('Flag 04 ............')
     A            MBIF050        2          COLHDG('Flag 05 ............')
     A            MBIF060        2          COLHDG('Flag 06 ............')
     A            MBIF070       10          COLHDG('Flag 07 ............')
     A            MBIF080       10          COLHDG('Flag 08 ............')
     A            MBIF090       10          COLHDG('Flag 09 ............')
     A            MBIF100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : NOTARTF0                                  *
     *  DESCRIZIONE   : Note su Articolo/Ordine da stp su Docum.  *
     *  PREFISSO      : NT0                                       *
     ****************************************************************
     A            NT0STX0        1          COLHDG('Stato ..............')
     A            NT0USX0       10A         COLHDG('Utente immissione...')
     A            NT0DAX0        8  0       COLHDG('Data immissione ....')
     A            NT0ORX0        6  0       COLHDG('Ora immissione .....')
     A            NT0CAZ0       10A         COLHDG('Codice azione ......')
     A            NT0PGI0       10A         COLHDG('Programma immissione')
     A            NT0USA0       10A         COLHDG('Utente aggiornam....')
     A            NT0DAA0        8  0       COLHDG('Data aggiornam. ....')
     A            NT0ORA0        6  0       COLHDG('Ora aggiornam. .....')
     A            NT0CAV0       10A         COLHDG('Codice azione varia.')
     A            NT0PGV0       10A         COLHDG('Programma variazione')
     A            NT0SOC0        2          COLHDG('Società ............')
      *
     A            NT0DAORD       8  0       COLHDG('Data Ordine ........')
     A            NT0NUORD       6  0       COLHDG('Num. Ordine ........')
     A            NT0CDPAR      15          COLHDG('Cod.Articolo .......')
     A            NT0NOTA       40          COLHDG('Nota ...............')
     A            NT0CDMAG       3          COLHDG('Magazzino...........')
      *
     A            NT0F010        2          COLHDG('Flag 01 ............')
     A            NT0F020        2          COLHDG('Flag 02 ............')
     A            NT0F030        2          COLHDG('Flag 03 ............')
     A            NT0F040        2          COLHDG('Flag 04 ............')
     A            NT0F050        2          COLHDG('Flag 05 ............')
     A            NT0F060        2          COLHDG('Flag 06 ............')
     A            NT0F070       10          COLHDG('Flag 07 ............')
     A            NT0F080       10          COLHDG('Flag 08 ............')
     A            NT0F090       10          COLHDG('Flag 09 ............')
     A            NT0F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : CNSTGRF0                                  *
     *  DESCRIZIONE   : Contribuzione settimanale per gruppo   .  *
     *  PREFISSO      : CNS                                       *
     ****************************************************************
     A            ZNSTX0         1          COLHDG('Stato ..............')
     A            ZNUSX0        10A         COLHDG('Utente immissione...')
     A            ZNDAX0         8  0       COLHDG('Data immissione ....')
     A            ZNORX0         6  0       COLHDG('Ora immissione .....')
     A            ZNCAZ0        10A         COLHDG('Codice azione ......')
     A            ZNPGI0        10A         COLHDG('Programma immissione')
     A            ZNUSA0        10A         COLHDG('Utente aggiornam....')
     A            ZNDAA0         8  0       COLHDG('Data aggiornam. ....')
     A            ZNORA0         6  0       COLHDG('Ora aggiornam. .....')
     A            ZNCAV0        10A         COLHDG('Codice azione varia.')
     A            ZNPGV0        10A         COLHDG('Programma variazione')
      *
     A            ZNAZI0        10          COLHDG('Azienda ............')
     A            ZNANN0         4S 0       COLHDG('Anno in elaborazione')
     A            ZNSET0         2S 0       COLHDG('Numero settimana....')
     A            ZNCAN0         1          COLHDG('Canale .............')
      *                                     R--> Rivendite
      *                                     A--> Allevatori
     A            ZNDTI0         8S 0       COLHDG('Data inizio settim..')
     A            ZNDTF0         8S 0       COLHDG('Data inizio fine ...')
      *
     A            ZNQT10        12  2       COLHDG('Volumi settimana ...')
     A            ZNQT20        12  2       COLHDG('Volumi mese ........')
     A            ZNQT30        12  2       COLHDG('Volumi anno ........')
      *
     A            ZNCN10        12  2       COLHDG('Contri.settimana ...')
     A            ZNCN20        12  2       COLHDG('Contri.mese ........')
     A            ZNCN30        12  2       COLHDG('Contri.anno ........')
      *
     A            ZNBD10        12  2       COLHDG('Budget settimana ...')
     A            ZNBD20        12  2       COLHDG('Budget mese ........')
     A            ZNBD30        12  2       COLHDG('Budget anno ........')
      *
     A            ZNCB10        12  2       COLHDG('Contr.Budget sett...')
     A            ZNCB20        12  2       COLHDG('Contr.Budget mese ..')
     A            ZNCB30        12  2       COLHDG('Contr.Budget anno ..')
      *
     A            ZNQP10        12  2       COLHDG('Volumi settimana ap.')
     A            ZNQP20        12  2       COLHDG('Volumi mese      ap.')
     A            ZNQP30        12  2       COLHDG('Volumi anno      ap.')
      *
     A            ZNCP10        12  2       COLHDG('Contri.settimana ap.')
     A            ZNCP20        12  2       COLHDG('Contri.mese      ap.')
     A            ZNCP30        12  2       COLHDG('Contri.anno      ap.')
      *
     A            ZNBP10        12  2       COLHDG('Contr.Budget sett.ap')
     A            ZNBP20        12  2       COLHDG('Contr.Budget mese ap')
     A            ZNBP30        12  2       COLHDG('Contr.Budget anno ap')
      *
     A            ZNGR10         4  0       COLHDG('giorni settimana ...')
     A            ZNGR20         4  0       COLHDG('giorni mese ........')
     A            ZNGR30         4  0       COLHDG('giorni anno ........')
      *
     A            ZNGP10         4  0       COLHDG('giorni settimana ap.')
     A            ZNGP20         4  0       COLHDG('giorni mese      ap.')
     A            ZNGP30         4  0       COLHDG('giorni anno      ap.')
      *
     A            ZNNC10        12  2       TEXT('Note cred.dif.sett..')
     A            ZNNC20        12  2       TEXT('Note cred.dif.mese .')
     A            ZNNC30        12  2       TEXT('Note cred.dif.anno .')
      *
     A            ZNIPF0        12  2       TEXT('Premi fine anno ....')
      *
     A            ZNF010         2          COLHDG('Flag 01 ............')
     A            ZNF020         2          COLHDG('Flag 02 ............')
     A            ZNF030         2          COLHDG('Flag 03 ............')
     A            ZNF040         2          COLHDG('Flag 04 ............')
     A            ZNF050         2          COLHDG('Flag 05 ............')
     A            ZNF060         2          COLHDG('Flag 06 ............')
     A            ZNF070        10          COLHDG('Flag 07 ............')
     A            ZNF080        10          COLHDG('Flag 08 ............')
     A            ZNF090        10          COLHDG('Flag 09 ............')
     A            ZNF100        10          COLHDG('Flag 10 ............')
     * ================================================================ *
     *  SEGNDEF0. Dettaglio segnalazioni                                *
     * ================================================================ *
     A            DSSTX0         1          COLHDG('Stato ..............')
     A            DSUSI0        10          COLHDG('Utente immissione...')
     A            DSDTI0         8  0       COLHDG('Data   immissione...')
     A            DSORI0         6  0       COLHDG('Ora    immissione...')
     A            DSPGI0        10          COLHDG('Progr. immissione...')
     A            DSAZI0        10          COLHDG('Azione immissione...')
     A            DSUSA0        10          COLHDG('Utente aggiornamento')
     A            DSDTA0         8  0       COLHDG('Data   aggiornamento')
     A            DSORA0         6  0       COLHDG('Ora    aggiornamento')
     A            DSPGA0        10          COLHDG('Progr. aggiornamento')
     A            DSAZA0        10          COLHDG('Azione aggiornamento')
     A            DSSTB0         3          COLHDG('Stabilimento........')
     A            DSMAG0         2          COLHDG('Magazzino...........')
     A            DSOPE0         5S 0       COLHDG('Operatore...........')
     A            DSIMP0         3          COLHDG('Impianto ...........')
     A            DSMAC0         3          COLHDG('Macchinario.........')
     A            DSSMA0         3          COLHDG('Sottomacchinario....')
     A            DSTIP0         3          COLHDG('Tipo segnalazione...')
      *                                  FEM - Fermo macchina
      *                                  RAM - Rallentamento macchina
      *                                  SEG - Segnalazione
     A            DSMOT0        80          COLHDG('Motivo segnalazione.')
     A            DSMO10        80          COLHDG('Motivo segnalazione.')
     A            DSDAT0         8S 0       COLHDG('Da data segnalazione')
     A            DSDAO0         6S 0       COLHDG('Da ora  segnalazione')
     A            DSADA0         8S 0       COLHDG('A data segnalazione.')
     A            DSAOR0         6S 0       COLHDG('A ora  segnalazione.')
     A            DSNUM0         7P 0       COLHDG('Progressivo segnala.')
     A            DSF010         2          COLHDG('Flag 01 ............')
     A            DSF020         2          COLHDG('Flag 02 ............')
     A            DSF030         2          COLHDG('Flag 03 ............')
     A            DSF040         2          COLHDG('Flag 04 ............')
     A            DSF050         2          COLHDG('Flag 05 ............')
     A            DSF060         2          COLHDG('Flag 06 ............')
     A            DSF070        10          COLHDG('Flag 07 ............')
     A            DSF080        10          COLHDG('Flag 08 ............')
     A            DSF090        10          COLHDG('Flag 09 ............')
     A            DSF100        10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : CNSTBIF0                                        *
     *  DESCRIZIONE   : Contribuzione settimanale: dati di bilancio.    *
     *  PREFISSO      : CNB                                             *
     **********************************************************************
     A            CNBSTX0        1          COLHDG('Stato ..............')
     A            CNBUSX0       10A         COLHDG('Utente    immissione')
     A            CNBDAX0        8  0       COLHDG('Data      immissione')
     A            CNBORX0        6  0       COLHDG('Ora       immissione')
     A            CNBCAZ0       10A         COLHDG('Azione    immissione')
     A            CNBPGI0       10A         COLHDG('Programma immissione')
     A            CNBUSA0       10A         COLHDG('Utente aggiornamento')
     A            CNBDAA0        8  0       COLHDG('Data   aggiornamento')
     A            CNBORA0        6  0       COLHDG('Ora    aggiornamento')
     A            CNBCAV0       10A         COLHDG('Azione aggiornamento')
     A            CNBPGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            CNBAZI0       10          COLHDG('Azienda ............')
     A            CNBDAB0        8  0       COLHDG('Data di bilancio....')
     A            CNBVCS0       18  6       COLHDG('Variaz.ai costi std.')
     A            CNBMCP0       18  6       COLHDG('Marg.contrib.progr..')
      *
     A            CNBF010        2          COLHDG('Flag 01 ............')
     A            CNBF020        2          COLHDG('Flag 02 ............')
     A            CNBF030        2          COLHDG('Flag 03 ............')
     A            CNBF040        2          COLHDG('Flag 04 ............')
     A            CNBF050        2          COLHDG('Flag 05 ............')
     A            CNBF060        2          COLHDG('Flag 06 ............')
     A            CNBF070       10          COLHDG('Flag 07 ............')
     A            CNBF080       10          COLHDG('Flag 08 ............')
     A            CNBF090       10          COLHDG('Flag 09 ............')
     A            CNBF100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : TARVIAF0                                        *
     *  DESCRIZIONE   : Tariffa particolare per viaggio.                *
     *  PREFISSO      : CNI                                             *
     **********************************************************************
     A            CNISTX0        1          COLHDG('Stato ..............')
     A            CNIUSX0       10A         COLHDG('Utente    immissione')
     A            CNIDAX0        8  0       COLHDG('Data      immissione')
     A            CNIORX0        6  0       COLHDG('Ora       immissione')
     A            CNICAZ0       10A         COLHDG('Azione    immissione')
     A            CNIPGI0       10A         COLHDG('Programma immissione')
     A            CNIUSA0       10A         COLHDG('Utente aggiornamento')
     A            CNIDAA0        8  0       COLHDG('Data   aggiornamento')
     A            CNIORA0        6  0       COLHDG('Ora    aggiornamento')
     A            CNICAV0       10A         COLHDG('Azione aggiornamento')
     A            CNIPGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            CNIVIA0        9  0       COLHDG('Numero viaggio .....')
     A            CNIIMP0       18  6       COLHDG('Importo viaggio ....')
     A            CNIQTA0       13  2       COLHDG('Quantità viaggio ...')
     A            CNIZOA0        5          COLHDG('Zona andata ........')
     A            CNIDES0       50          COLHDG('Descrizione ........')
      *
     A            CNIF010        2          COLHDG('Tipo automezzo .....')
     A            CNIF020        2          COLHDG('Tipo valorizzazione.')
     A            CNIF030        2          COLHDG('Valorizz.Epal ......')
     A            CNIF040        2          COLHDG('TV=tot.via.VT=tariff')
     *                                      Flag riferito al campo CNIIMP0 dove:
     *                                      TV (o blank) indica che l'importo sarà il totale del viaggio
     *                                      VT indica la tariffa particolare del viaggio a cui andranno
     *                                         aggiunti tutti i costi del viaggio.
     A            CNIF050        2          COLHDG('Flag 05 ............')
     A            CNIF060        2          COLHDG('Flag 06 ............')
     A            CNIF070       10          COLHDG('Flag 07 ............')
     A            CNIF080       10          COLHDG('Flag 08 ............')
     A            CNIF090       10          COLHDG('Flag 09 ............')
     A            CNIF100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : ANAES3F0                                        *
     *  DESCRIZIONE   : Analisi su prodotti medicati.                   *
     *  PREFISSO      : AN3                                             *
     **********************************************************************
     A            AN3STX0        1          COLHDG('Stato ..............')
     A            AN3USX0       10A         COLHDG('Utente    immissione')
     A            AN3DAX0        8  0       COLHDG('Data      immissione')
     A            AN3ORX0        6  0       COLHDG('Ora       immissione')
     A            AN3CAZ0       10A         COLHDG('Azione    immissione')
     A            AN3PGI0       10A         COLHDG('Programma immissione')
     A            AN3USA0       10A         COLHDG('Utente aggiornamento')
     A            AN3DAA0        8  0       COLHDG('Data   aggiornamento')
     A            AN3ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            AN3CAV0       10A         COLHDG('Azione aggiornamento')
     A            AN3PGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            AN3MAG0        2          COLHDG('Magazzino ..........')
     A            AN3LOT0        9  0       COLHDG('Nr. Lotto ..........')
     A            AN3PRO0       15          COLHDG('Prodotto ...........')
     A            AN3PAT0       10          COLHDG('Principio Attivo ...')
     A            AN3VAL0       10  2       COLHDG('Val. Analisi .......')
      *
     A            AN3F010        2          COLHDG('Flag 01 ............')
     A            AN3F020        2          COLHDG('Flag 02 ............')
     A            AN3F030        2          COLHDG('Flag 03 ............')
     A            AN3F040        2          COLHDG('Flag 04 ............')
     A            AN3F050        2          COLHDG('Flag 05 ............')
     A            AN3F060        2          COLHDG('Flag 06 ............')
     A            AN3F070       10          COLHDG('Flag 07 ............')
     A            AN3F080       10          COLHDG('Flag 08 ............')
     A            AN3F090       10          COLHDG('Flag 09 ............')
     A            AN3F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : ANAUS3F0                                        *
     *  DESCRIZIONE   : Controllo procedure per utenti.                 *
     *  PREFISSO      : AN5                                             *
     **********************************************************************
     A            AN5STX0        1          COLHDG('Stato ..............')
     A            AN5USX0       10A         COLHDG('Utente    immissione')
     A            AN5DAX0        8  0       COLHDG('Data      immissione')
     A            AN5ORX0        6  0       COLHDG('Ora       immissione')
     A            AN5CAZ0       10A         COLHDG('Azione    immissione')
     A            AN5PGI0       10A         COLHDG('Programma immissione')
     A            AN5USA0       10A         COLHDG('Utente aggiornamento')
     A            AN5DAA0        8  0       COLHDG('Data   aggiornamento')
     A            AN5ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            AN5CAV0       10A         COLHDG('Azione aggiornamento')
     A            AN5PGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            AN5UTE0       10A         COLHDG('Utente AS/400 ......')
     A            AN5PGM0       10A         COLHDG('Programma ..........')
     A            AN5FLG0        2A         COLHDG('SI / NO ............')
      *
     A            AN5F010        2          COLHDG('Flag 01 ............')
     A            AN5F020        2          COLHDG('Flag 02 ............')
     A            AN5F030        2          COLHDG('Flag 03 ............')
     A            AN5F040        2          COLHDG('Flag 04 ............')
     A            AN5F050        2          COLHDG('Flag 05 ............')
     A            AN5F060        2          COLHDG('Flag 06 ............')
     A            AN5F070       10          COLHDG('Flag 07 Aut.Blocchi.')
      *                                          Pos. 1-2 Gest.blocco P1
      *                                          Pos. 3-4 Gest.blocco P2
      *                                          Pos. 5-6 Gest.blocco P3
      *                                          Pos. 7-8 Gest.blocco PI
      *                                          Pos.9-10 Vis.Mdc (SI/NO)
     A            AN5F080       10          COLHDG('Flag 08 ............')
     A            AN5F090       10          COLHDG('Flag 09 ............')
     A            AN5F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : LEGAMPF0                                        *
     *  DESCRIZIONE   : Legame Format/M.p. di acuisto                   *
     *  PREFISSO      : LG1                                             *
     **********************************************************************
     A            LG1STX0        1          COLHDG('Stato ..............')
     A            LG1USX0       10A         COLHDG('Utente    immissione')
     A            LG1DAX0        8  0       COLHDG('Data      immissione')
     A            LG1ORX0        6  0       COLHDG('Ora       immissione')
     A            LG1CAZ0       10A         COLHDG('Azione    immissione')
     A            LG1PGI0       10A         COLHDG('Programma immissione')
     A            LG1USA0       10A         COLHDG('Utente aggiornamento')
     A            LG1DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG1ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            LG1CAV0       10A         COLHDG('Azione aggiornamento')
     A            LG1PGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            LG1CFO0        6  0       COLHDG('Cod. Mp Format .....')
     A            LG1CMP0       15          COLHDG('Cod. Mp Acquisto ...')
      *
     A            LG1DES0       10          COLHDG('Cod. Ingrediente ...')
     A            LG1NOT0       10          COLHDG('Cod. Nota ..........')
     A            LG1STP0        1          COLHDG('Stampa su Cart. S/N ')
     A            LG1PRP0        1          COLHDG('Stampa % utili. S/N ')
      *
     A            LG1F010        2          COLHDG('X=Considera non M.P.')
     A            LG1F020        2          COLHDG('Flag 02 ............')
     A            LG1F030        2          COLHDG('Flag 03 ............')
     A            LG1F040        2          COLHDG('Flag 04 ............')
     A            LG1F050        2          COLHDG('Flag 05 ............')
     A            LG1F060        2          COLHDG('Flag 06 ............')
     A            LG1F070       10          COLHDG('Cod. Integrazione...')
     A            LG1F080       10          COLHDG('Fattore Moltiplic...')
     A            LG1F090       10          COLHDG('Flag 09 ............')
     A            LG1F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : LEGAPFF0                                        *
     *  DESCRIZIONE   : Legame Format/Prodotto Finito As400             *
     *  PREFISSO      : LG2                                             *
     **********************************************************************
     A            LG2STX0        1          COLHDG('Stato ..............')
     A            LG2USX0       10A         COLHDG('Utente    immissione')
     A            LG2DAX0        8  0       COLHDG('Data      immissione')
     A            LG2ORX0        6  0       COLHDG('Ora       immissione')
     A            LG2CAZ0       10A         COLHDG('Azione    immissione')
     A            LG2PGI0       10A         COLHDG('Programma immissione')
     A            LG2USA0       10A         COLHDG('Utente aggiornamento')
     A            LG2DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG2ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            LG2CAV0       10A         COLHDG('Azione aggiornamento')
     A            LG2PGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            LG2MAG0        2          COLHDG('Cod. Magazzino .....')
     A            LG2CFO0        6  0       COLHDG('Cod. Mp Format .....')
     A            LG2CPR0       15          COLHDG('Cod. Pf AS400 ......')
      *
     A            LG2F010        2          COLHDG('Flag 01 ............')
     A            LG2F020        2          COLHDG('P=Form. Personal ...')
     A            LG2F030        2          COLHDG('S=Espl.Form.Brindisi')
     A            LG2F040        2          COLHDG('S=Espl.Form.Napoli .')
     A            LG2F050        2          COLHDG('S=Espl.Form.Bologna ')
     A            LG2F060        2          COLHDG('S=Espl.Form.Perugia ')
     A            LG2F070       10          COLHDG('Flag 07 ............')
     A            LG2F080       10          COLHDG('Mag + Dt ult.prod. .')
     A            LG2F090       10          COLHDG('Flag 09 ............')
     A            LG2F100       10          COLHDG('Form. attiva x mag. ')
      *                                     1-1 S/N per mag. Petrignano
      *                                     2-2 S/N per mag. Bologna
      *                                     3-3 S/N per mag. Napoli
      *                                     4-4 S/N per mag. Brindisi
      *                                     5-5 S/N per mag. Mpr
      *                                     6-6 S/N per mag. Soggia
      *
     A            LG2BRI0        6  0       COLHDG('Cod.Formula Brill ..')
     A            LG2B010        2          COLHDG('Bl.Formula x mag.01 ')
     A            LG2B020        2          COLHDG('Bl.Formula x mag.02 ')
     A            LG2B030        2          COLHDG('Bl.Formula x mag.06 ')
     A            LG2B040        2          COLHDG('Bl.Formula x mag.08 ')
     A            LG2B050        2          COLHDG('Bl.Formula x mag.10 ')
     A            LG2B060        2          COLHDG('Bl.Formula x mag.20 ')
     A            LG2B070        2          COLHDG('Bl.Formula x mag... ')
     A            LG2B080        2          COLHDG('Bl.Formula x mag... ')
     A            LG2B090        2          COLHDG('Forma ............. ')
     A            LG2B100        2          COLHDG('Perc. Acqua 1,1 ... ')
      *
     A            LG2L010        2          COLHDG('Linee Prod.x mag.01 ')
     A            LG2L020        2          COLHDG('Linee Prod.x mag.02 ')
     A            LG2L030        2          COLHDG('Linee Prod.x mag.06 ')
     A            LG2L040        2          COLHDG('Linee Prod.x mag.08 ')
     A            LG2L050        2          COLHDG('Linee Prod.x mag.10 ')
     A            LG2L060        2          COLHDG('Linee Prod.x mag.20 ')
     A            LG2L070        2          COLHDG('Linee Prod.x mag... ')
     A            LG2L080        2          COLHDG('Linee Prod.x mag... ')
     A            LG2L090        2          COLHDG('Linee Prod.x mag... ')
     A            LG2L100        2          COLHDG('Linee Prod.x mag... ')
     **********************************************************************
     *  ARCHIVIO      : PATTIVF0                                        *
     *  DESCRIZIONE   : Composizione Principi Attivi di una Premiscela  *
     *  PREFISSO      : LG3                                             *
     **********************************************************************
     A            LG3STX0        1          COLHDG('Stato ..............')
     A            LG3USX0       10A         COLHDG('Utente    immissione')
     A            LG3DAX0        8  0       COLHDG('Data      immissione')
     A            LG3ORX0        6  0       COLHDG('Ora       immissione')
     A            LG3CAZ0       10A         COLHDG('Azione    immissione')
     A            LG3PGI0       10A         COLHDG('Programma immissione')
     A            LG3USA0       10A         COLHDG('Utente aggiornamento')
     A            LG3DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG3ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            LG3CAV0       10A         COLHDG('Azione aggiornamento')
     A            LG3PGV0       10A         COLHDG('Progra.aggiornamento')
      *
     A            LG3COD0       15          COLHDG('Cod. Prem.Medicata..')
     A            LG3NRE0       20          COLHDG('Num. Registrazione .')
      *
     A            LG3PA10       10          COLHDG('Cod. P.A. 1 ........')
     A            LG3QT10       12  2       COLHDG('Q.tà P.A. 1 ........')
     A            LG3PA20       10          COLHDG('Cod. P.A. 2 ........')
     A            LG3QT20       12  2       COLHDG('Q.tà P.A. 2 ........')
     A            LG3PA30       10          COLHDG('Cod. P.A. 3 ........')
     A            LG3QT30       12  2       COLHDG('Q.tà P.A. 3 ........')
     A            LG3PA40       10          COLHDG('Cod. P.A. 4 ........')
     A            LG3QT40       12  2       COLHDG('Q.tà P.A. 4 ........')
     A            LG3PA50       10          COLHDG('Cod. P.A. 5 ........')
     A            LG3QT50       12  2       COLHDG('Q.tà P.A. 5 ........')
     A            LG3PA60       10          COLHDG('Cod. P.A. 6 ........')
     A            LG3QT60       12  2       COLHDG('Q.tà P.A. 6 ........')
      *
     A            LG3F010        2          COLHDG('Flag 01 ............')
     A            LG3F020        2          COLHDG('Flag 02 ............')
     A            LG3F030        2          COLHDG('Flag 03 ............')
     A            LG3F040        2          COLHDG('Flag 04 ............')
     A            LG3F050        2          COLHDG('Flag 05 ............')
     A            LG3F060        2          COLHDG('Flag 06 ............')
     A            LG3F070       10          COLHDG('Flag 07 ............')
     A            LG3F080       10          COLHDG('Flag 08 ............')
     A            LG3F090       10          COLHDG('Flag 09 ............')
     A            LG3F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : LOGPRTF0                                        *
     *  DESCRIZIONE   : Log provvigioni                                 *
     *  PREFISSO      : LG4                                             *
     **********************************************************************
     A            LG4STX0        1          COLHDG('Stato ..............')
     A            LG4USX0       10A         COLHDG('Utente    immissione')
     A            LG4DAX0        8  0       COLHDG('Data      immissione')
     A            LG4ORX0        6  0       COLHDG('Ora       immissione')
     A            LG4CAZ0       10A         COLHDG('Azione    immissione')
     A            LG4PGI0       10A         COLHDG('Programma immissione')
     A            LG4USA0       10A         COLHDG('Utente aggiornamento')
     A            LG4DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG4ORA0        6  0       COLHDG('Ora    aggiornamento')
     A            LG4CAV0       10A         COLHDG('Azione aggiornamento')
     A            LG4PGV0       10A         COLHDG('Progra.aggiornamento')
     *
     A            LG4USE0       10          COLHDG('Utente di lancio....')
     A            LG4NLA0        9S 0       COLHDG('Numero di lancio ...')
     *
     A            LG4DT10        8  0       COLHDG('Data inizio ........')
     A            LG4DT20        8  0       COLHDG('Data fine   ........')
     A            LG4DT30        8  0       COLHDG('Data riferimento ...')
     A            LG4MAR0        2          COLHDG('Marchio ............')
     A            LG4DEF0        2          COLHDG('Stampa definitiva...')
     A            LG4AGE0        3          COLHDG('Eventuale agente ...')
     *
     A            LG4SI10       10          COLHDG('Step 01 ............')
     A            LG4DI10        8  0       COLHDG('Data inizio 01......')
     A            LG4OI10        6  0       COLHDG('Ora  inizio 01......')
     A            LG4DF10        8  0       COLHDG('Data Fine   01......')
     A            LG4OF10        6  0       COLHDG('Ora  fine   01......')
     *
     A            LG4SI20       10          COLHDG('Step 02 ............')
     A            LG4DI20        8  0       COLHDG('Data inizio 02......')
     A            LG4OI20        6  0       COLHDG('Ora  inizio 02......')
     A            LG4DF20        8  0       COLHDG('Data Fine   02......')
     A            LG4OF20        6  0       COLHDG('Ora  fine   02......')
     *
     A            LG4SI30       10          COLHDG('Step 03 ............')
     A            LG4DI30        8  0       COLHDG('Data inizio 03......')
     A            LG4OI30        6  0       COLHDG('Ora  inizio 03......')
     A            LG4DF30        8  0       COLHDG('Data Fine   03......')
     A            LG4OF30        6  0       COLHDG('Ora  fine   03......')
     *
     A            LG4SI40       10          COLHDG('Step 04 ............')
     A            LG4DI40        8  0       COLHDG('Data inizio 04......')
     A            LG4OI40        6  0       COLHDG('Ora  inizio 04......')
     A            LG4DF40        8  0       COLHDG('Data Fine   04......')
     A            LG4OF40        6  0       COLHDG('Ora  fine   04......')
     *
     A            LG4SI50       10          COLHDG('Step 05 ............')
     A            LG4DI50        8  0       COLHDG('Data inizio 05......')
     A            LG4OI50        6  0       COLHDG('Ora  inizio 05......')
     A            LG4DF50        8  0       COLHDG('Data Fine   05......')
     A            LG4OF50        6  0       COLHDG('Ora  fine   05......')
     *
     A            LG4SI60       10          COLHDG('Step 06 ............')
     A            LG4DI60        8  0       COLHDG('Data inizio 06......')
     A            LG4OI60        6  0       COLHDG('Ora  inizio 06......')
     A            LG4DF60        8  0       COLHDG('Data Fine   06......')
     A            LG4OF60        6  0       COLHDG('Ora  fine   06......')
     *
     A            LG4SI70       10          COLHDG('Step 07 ............')
     A            LG4DI70        8  0       COLHDG('Data inizio 07......')
     A            LG4OI70        6  0       COLHDG('Ora  inizio 07......')
     A            LG4DF70        8  0       COLHDG('Data Fine   07......')
     A            LG4OF70        6  0       COLHDG('Ora  fine   07......')
     *
     A            LG4SI80       10          COLHDG('Step 08 ............')
     A            LG4DI80        8  0       COLHDG('Data inizio 08......')
     A            LG4OI80        6  0       COLHDG('Ora  inizio 08......')
     A            LG4DF80        8  0       COLHDG('Data Fine   08......')
     A            LG4OF80        6  0       COLHDG('Ora  fine   08......')
     *
     A            LG4SI90       10          COLHDG('Step 09 ............')
     A            LG4DI90        8  0       COLHDG('Data inizio 09......')
     A            LG4OI90        6  0       COLHDG('Ora  inizio 09......')
     A            LG4DF90        8  0       COLHDG('Data Fine   09......')
     A            LG4OF90        6  0       COLHDG('Ora  fine   09......')
     *
     A            LG4F010        2          COLHDG('Flag 01 ............')
     A            LG4F020        2          COLHDG('Flag 02 ............')
     A            LG4F030        2          COLHDG('Flag 03 ............')
     A            LG4F040        2          COLHDG('Flag 04 ............')
     A            LG4F050        2          COLHDG('Flag 05 ............')
     A            LG4F060        2          COLHDG('Flag 06 ............')
     A            LG4F070       10          COLHDG('Flag 07 ............')
     A            LG4F080       10          COLHDG('Flag 08 ............')
     A            LG4F090       10          COLHDG('Flag 09 ............')
     A            LG4F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : CLILEGF0                                        *
     *  DESCRIZIONE   : CLIENTI SOLLECITATIE AL LEGALE                  *
     *  PREFISSO      : LG5                                             *
     **********************************************************************
     A            LG5STX0        1          COLHDG('Stato ..............')
     A            LG5USX0       10A         COLHDG('Utente    immissione')
     A            LG5DAX0        8  0       COLHDG('Data      immissione')
     A            LG5ORX0        6  0       COLHDG('Ora       immissione')
     A            LG5CAZ0       10A         COLHDG('Azione    immissione')
     A            LG5PGI0       10A         COLHDG('Programma immissione')
     A            LG5USA0       10A         COLHDG('Utente aggiornamento')
     A            LG5DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG5ORA0        6  0       COLHDG('Ora    aggiornamento')
      *
     A            LG5CLI0        6          COLHDG('Cliente ............')
     A            LG5ARF0        4S 0       COLHDG('Anno riferimento ...')
     A            LG5NRF0        6S 0       COLHDG('Num. riferimento ...')
     A            LG5TSO0        2          COLHDG('Tipo sollecito .....')
     A            LG5DSO0        8S 0       COLHDG('Data sollecito .....')
     A            LG5FLE0        6          COLHDG('Cod.legale (fornit.)')
     A            LG5DLE0        8S 0       COLHDG('Data legale ........')
     A            LG5TLE0        2          COLHDG('Tipo legale .. .....')
     *
     A            LG5F010        2          COLHDG('Flag 01 ............')
     A            LG5F020        2          COLHDG('Flag 02 ............')
     A            LG5F030        2          COLHDG('Flag 03 ............')
     A            LG5F040        2          COLHDG('Flag 04 ............')
     A            LG5F050        2          COLHDG('Flag 05 ............')
     A            LG5F060        2          COLHDG('Flag 06 ............')
     A            LG5F070       10          COLHDG('Flag 07 ............')
     A            LG5F080       10          COLHDG('Flag 08 ............')
     A            LG5F090       10          COLHDG('Flag 09 ............')
     A            LG5F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : ORDDUPF0                                        *
     *  DESCRIZIONE   : TESTATE ORDINI DA DUPLICARE                     *
     *  PREFISSO      : LG6                                             *
     **********************************************************************
     A            LG6STX0        1          COLHDG('Stato ..............')
     A            LG6USX0       10A         COLHDG('Utente    immissione')
     A            LG6DAX0        8  0       COLHDG('Data      immissione')
     A            LG6ORX0        6  0       COLHDG('Ora       immissione')
     A            LG6CAZ0       10A         COLHDG('Azione    immissione')
     A            LG6PGI0       10A         COLHDG('Programma immissione')
     A            LG6USA0       10A         COLHDG('Utente aggiornamento')
     A            LG6DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG6ORA0        6  0       COLHDG('Ora    aggiornamento')
      *
     A            LG6MAG0        3          COLHDG('Magazzino ..........')
     A            LG6CLI0        6          COLHDG('Cliente ............')
     A            LG6CLF0        6          COLHDG('Intest. Fattura.....')
     A            LG6DTO0        8  0       COLHDG('Data Ordine ........')
     A            LG6NRO0        9  0       COLHDG('Num. Ordine ........')
     A            LG6TDO0        1          COLHDG('Tipo Documento......')
     A            LG6CTR0        2          COLHDG('Causale Trasporto...')
     A            LG6MA10        3          COLHDG('Magazzino originario')
     *
     A            LG6DT10        8  0       COLHDG('Data Ordine Duplic..')
     A            LG6NR10        9  0       COLHDG('Num. Ordine Duplic..')
     *
     A            LG6F010        2          COLHDG('Carrel orig.........')
     A            LG6F020        2          COLHDG('Mod.Consegna........')
     A            LG6F030        2          COLHDG('Tipo Natura ........')
     A            LG6F040        2          COLHDG('Flag 04 ............')
     A            LG6F050        2          COLHDG('Flag 05 ............')
     A            LG6F060        2          COLHDG('Flag 06 ............')
     A            LG6F070       10          COLHDG('Sconto trasporto ...')
     A            LG6F080       10          COLHDG('Cod.Pagamento ......')
     A            LG6F090       10          COLHDG('Flag 09 ............')
     A            LG6F100       10          COLHDG('Flag 10 ............')
     **********************************************************************
     *  ARCHIVIO      : CNBAGEF0                                        *
     *  DESCRIZIONE   : CONTRIBUZIONE BUDGET PER AGENTE                 *
     *  PREFISSO      : LG7                                             *
     **********************************************************************
     A            LG7STX0        1          COLHDG('Stato ..............')
     A            LG7USX0       10A         COLHDG('Utente    immissione')
     A            LG7DAX0        8  0       COLHDG('Data      immissione')
     A            LG7ORX0        6  0       COLHDG('Ora       immissione')
     A            LG7CAZ0       10A         COLHDG('Azione    immissione')
     A            LG7PGI0       10A         COLHDG('Programma immissione')
     A            LG7USA0       10A         COLHDG('Utente aggiornamento')
     A            LG7DAA0        8  0       COLHDG('Data   aggiornamento')
     A            LG7ORA0        6  0       COLHDG('Ora    aggiornamento')
      *
     A            LG7ANN0        4S 0       COLHDG('Anno ...............')
     A            LG7REV0        2S 0       COLHDG('Livello revisione ..')
     A            LG7SEZ0        3          COLHDG('Sezione / Dipartim..')
     A            LG7DIS0        3          COLHDG('Distretto...........')
     A            LG7AGE0        3          COLHDG('Agente .............')
     A            LG7MAR0        2          COLHDG('Marchio  MG-PE .....')
     A            LG7CAN0        1          COLHDG('Canale .............')
     A            LG7LIN0        3          COLHDG('Linea  .............')
     A            LG7CON0       18S 8       COLHDG('Contribuzione E/Qle.')
     *
     A            LG7F010        2          COLHDG('Flag 01 ............')
     A            LG7F020        2          COLHDG('Flag 02 ............')
     A            LG7F030        2          COLHDG('Flag 03 ............')
     A            LG7F040        2          COLHDG('Flag 04 ............')
     A            LG7F050        2          COLHDG('Flag 05 ............')
     A            LG7F060        2          COLHDG('Flag 06 ............')
     A            LG7F070       10          COLHDG('Flag 07 ............')
     A            LG7F080       10          COLHDG('Flag 08 ............')
     A            LG7F090       10          COLHDG('Flag 09 ............')
     A            LG7F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  TABELLA       : INTE00F0                                  *
     *  DESCRIZIONE   : ANAGR. INTEGRAZIONI                       *
     ****************************************************************
     A            IN0STX0        1          COLHDG('Stato ...........')
     A            IN0USE0       10          COLHDG('Utente immissione')
     A            IN0DAE0        8  0       COLHDG('Data immissione .')
     A            IN0ORE0        6  0       COLHDG('Ora immissione...')
     A            IN0USA0       10          COLHDG('Utente aggiornam.')
     A            IN0DAA0        8  0       COLHDG('Data aggiornam...')
     A            IN0ORA0        6  0       COLHDG('Ora aggiornam....')
     A            IN0NRX0        9  0       COLHDG('Numero Azione ...')
     A            IN0CAZ0        4          COLHDG('Codice azione....')
     A            IN0PGM0       10          COLHDG('Programma immiss.')
     A            IN0PGA0       10          COLHDG('Programma modif..')
      *
     A            IN0MAG0        2          COLHDG('Cod.Magazzino....')
     A            IN0COD0       15          COLHDG('Cod.Integratore..')
     A            IN0DES0       40          COLHDG('Des.Integrazione.')
     A            IN0DE10       40          COLHDG('Des1.Integrazione')
     A            IN0DE20       40          COLHDG('Des2.Integrazione')
     A            IN0CNO0       10          COLHDG('Cod.Nota.........')
     *
     A            IN0F010        2          COLHDG('Flag 01  ........')
     A            IN0F020        2          COLHDG('Flag 02  ........')
     A            IN0F030        2          COLHDG('Flag 03  ........')
     A            IN0F040        2          COLHDG('Flag 04  ........')
     A            IN0F050        2          COLHDG('Flag 05  ........')
     A            IN0F060        2          COLHDG('Flag 06  ........')
     A            IN0F070        2          COLHDG('Flag 07  ........')
     A            IN0F080       10          COLHDG('Flag 08  ........')
     A            IN0F090       10          COLHDG('Flag 09  ........')
     A            IN0F100       10          COLHDG('Flag 10  ........')
      *
     ****************************************************************
     *  TABELLA       : BANIBAF0                                  *
     *  DESCRIZIONE   : IBAN ASSOCIATO A BANCHE DI PRESENTAZIONE  *
     ****************************************************************
     A            IN1STX0        1          COLHDG('Stato ...........')
     A            IN1USE0       10          COLHDG('Utente immissione')
     A            IN1DAE0        8  0       COLHDG('Data immissione .')
     A            IN1ORE0        6  0       COLHDG('Ora immissione...')
     A            IN1USA0       10          COLHDG('Utente aggiornam.')
     A            IN1DAA0        8  0       COLHDG('Data aggiornam...')
     A            IN1ORA0        6  0       COLHDG('Ora aggiornam....')
     A            IN1NRX0        9  0       COLHDG('Numero Azione ...')
     A            IN1CAZ0        4          COLHDG('Codice azione....')
     A            IN1PGM0       10          COLHDG('Programma immiss.')
     A            IN1PGA0       10          COLHDG('Programma modif..')
      *
     A            IN1BAN0        6          COLHDG('Codice banca ....')
     A            IN1IBA0       30          COLHDG('Iban ............')
     *
     A            IN1F010        2          COLHDG('Flag 01  ........')
     A            IN1F020        2          COLHDG('Flag 02  ........')
     A            IN1F030        2          COLHDG('Flag 03  ........')
     A            IN1F040        2          COLHDG('Flag 04  ........')
     A            IN1F050        2          COLHDG('Flag 05  ........')
     A            IN1F060        2          COLHDG('Flag 06  ........')
     A            IN1F070        2          COLHDG('Flag 07  ........')
     A            IN1F080       10          COLHDG('Flag 08  ........')
     A            IN1F090       10          COLHDG('Flag 09  ........')
     A            IN1F100       10          COLHDG('Flag 10  ........')
      *
