     A          R DIZMIG
     * ============================================================ *
     *  ARCHIVIO      : PRGACQF0                                  *
     *  DESCRIZIONE   : Progressivi di lavoro acquisti            *
     *  PREFISSO      : PAQ                                       *
     * ============================================================ *
     A            PAQSTX0        1          COLHDG('Stato ...........')
      *
     A            PAQUSI0       10          COLHDG('Utente immissione')
     A            PAQDAI0        8  0       COLHDG('Data immissione .')
     A            PAQORI0        6  0       COLHDG('Ora immissione...')
     A            PAQUSA0       10          COLHDG('Utente modifica..')
     A            PAQDAA0        8  0       COLHDG('Data modifica....')
     A            PAQORA0        6  0       COLHDG('Ora modifica.....')
      *
     A            PAQAZI0        4          COLHDG('Azione ..........')
     A            PAQNRX0        9  0       COLHDG('Numero Azione ...')
     A            PAQSOC0        2          COLHDG('Società..........')
      *
     A            PAQPRO0       15          COLHDG('Prodotto ........')
     A            PAQGGF0        4S 0       COLHDG('Giorni franchigia')
     A            PAQDTR0        8S 0       COLHDG('Data rifer.franch')
     A            PAQSCO0        2S 0       COLHDG('Secolo ordine....')
     A            PAQANO0        2S 0       COLHDG('Anno   ordine....')
     A            PAQMSO0        2S 0       COLHDG('Mese   ordine....')
     A            PAQGRO0        2S 0       COLHDG('Giorno ordine....')
     A            PAQSGO0        4          COLHDG('Sigla  ordine....')
     A            PAQNRO0        9S 0       COLHDG('Numero ordine....')
     A            PAQNRI0        4S 0       COLHDG('Numero riga .....')
     A            PAQNRP0        4S 0       COLHDG('Numero quota ....')
     A            PAQNRR0        4S 0       COLHDG('Progr. disposiz. ')
     A            PAQQT10       18S 4       COLHDG('q.tà disposizione')
     A            PAQQT20       18S 4       COLHDG('q.tà consegnata  ')
     A            PAQQT30       18S 4       COLHDG('q.tà viaggio     ')
     A            PAQQT40       18S 4       COLHDG('q.tà aperta      ')
     A            PAQF010       10          COLHDG('Flag 01          ')
     A            PAQF020       10          COLHDG('Flag 02          ')
     A            PAQF030       10          COLHDG('Flag 03          ')
     A            PAQF040       10          COLHDG('Flag 04          ')
     A            PAQF050       10          COLHDG('Flag 05          ')
     A            PAQF060       10          COLHDG('Flag 06          ')
     A            PAQF070       10          COLHDG('Flag 07          ')
     A            PAQF080       10          COLHDG('Flag 08          ')
     A            PAQF090       10          COLHDG('Flag 09          ')
     A            PAQF100       10          COLHDG('Flag 10          ')
     * ================================================================ *
     *  Richiesta  avvio progetto                                       *
     *  CEPRO1F0                                                        *
     * ================================================================ *
     A            A1STX0         1          COLHDG('Stato ...........')
     A            A1USE0        10          COLHDG('Utente ..........')
     A            A1GRX0         2  0       COLHDG('gg.  variazione .')
     A            A1MSX0         2  0       COLHDG('mm.  variazione .')
     A            A1SCX0         2  0       COLHDG('ss.  variazione .')
     A            A1ANX0         2  0       COLHDG('aa.  variazione .')
     A            A1NRX0         9  0       COLHDG('Numero Azione ...')
     A            A1ORX0         6  0       COLHDG('Ora Variazione...')
      *
     A            A1PRG0        10          COLHDG('Cod.progetto.....')
     A            A1SCR0         2  0       COLHDG('Secolo richiesta.')
     A            A1ANR0         2  0       COLHDG('Anno   richiesta.')
     A            A1MER0         2  0       COLHDG('Mese   richiesta.')
     A            A1GIR0         2  0       COLHDG('Giorno richiesta.')
     A            A1R010        20          COLHDG('Riched. 01 ......')
     A            A1R020        20          COLHDG('Riched. 02 ......')
     A            A1R030        20          COLHDG('Riched. 03 ......')
     A            A1R040        20          COLHDG('Riched. 04 ......')
     A            A1R050        20          COLHDG('Riched. 05 ......')
     A            A1R060        20          COLHDG('Riched. 06 ......')
     A            A1R070        20          COLHDG('Riched. 07 ......')
     A            A1R080        20          COLHDG('Riched. 08 ......')
     A            A1R090        20          COLHDG('Riched. 09 ......')
     A            A1R100        20          COLHDG('Riched. 10 ......')
     A            A1D010        60          COLHDG('Descriz. lav. 01.')
     A            A1D020        60          COLHDG('Descriz. lav. 02.')
     A            A1D030        60          COLHDG('Descriz. lav. 03.')
     A            A1D040        60          COLHDG('Descriz. lav. 04.')
     A            A1P010        20          COLHDG('Partec. 01 ......')
     A            A1P020        20          COLHDG('Partec. 02 ......')
     A            A1P030        20          COLHDG('Partec. 03 ......')
     A            A1P040        20          COLHDG('Partec. 04 ......')
     A            A1P050        20          COLHDG('Partec. 05 ......')
     A            A1P060        20          COLHDG('Partec. 06 ......')
     A            A1P070        20          COLHDG('Partec. 07 ......')
     A            A1P080        20          COLHDG('Partec. 08 ......')
     A            A1P090        20          COLHDG('Partec. 09 ......')
     A            A1P100        20          COLHDG('Partec. 10 ......')
     A            A1SCS0         2  0       COLHDG('Secolo Scadenza..')
     A            A1ANS0         2  0       COLHDG('Anno   Scadenza..')
     A            A1MES0         2  0       COLHDG('Mese   Scadenza..')
     A            A1GIS0         2  0       COLHDG('Giorno Scadenza..')
     A            A1PRI0         2  0       COLHDG('Priorità progetto')
     A            A1F010         2          COLHDG('99 Prog. termin. ')
     A            A1F020         2          COLHDG('GG chiusura......')
     A            A1F030         2          COLHDG('MM chiusura .....')
     A            A1F040         2          COLHDG('SS chiusura .....')
     A            A1F050         2          COLHDG('AA chiusura .....')
     A            A1F060         2          COLHDG('Raggruppamento 1.')
     A            A1F070         2          COLHDG('NO -> No stampa..')
     A            A1F080         2          COLHDG('MI=Mign. PE=Petr.')
      *                                             EN=Entrambi
     A            A1F090         2          COLHDG('Flag 09 .........')
     A            A1F100         2          COLHDG('Flag 10 .........')
     * ================================================================ *
     *  Rilascio progetto                                               *
     *  CEPRO2F0                                                        *
     * ================================================================ *
     A            A2STX0         1          COLHDG('Stato ...........')
     A            A2USE0        10          COLHDG('Utente ..........')
     A            A2GRX0         2  0       COLHDG('gg.  variazione .')
     A            A2MSX0         2  0       COLHDG('mm.  variazione .')
     A            A2SCX0         2  0       COLHDG('ss.  variazione .')
     A            A2ANX0         2  0       COLHDG('aa.  variazione .')
     A            A2NRX0         9  0       COLHDG('Numero Azione ...')
     A            A2ORX0         6  0       COLHDG('Ora Variazione...')
      *
     A            A2PRG0        10          COLHDG('Cod.progetto.....')
      *
     A            A2SCA0         2  0       COLHDG('Secolo Avviam....')
     A            A2ANA0         2  0       COLHDG('Anno   Avviam....')
     A            A2MEA0         2  0       COLHDG('Mese   Avviam....')
     A            A2GIA0         2  0       COLHDG('Giorno Avviam....')
      *
     A            A2SCR0         2  0       COLHDG('Secolo rilascio..')
     A            A2ANR0         2  0       COLHDG('Anno   rilascio..')
     A            A2MER0         2  0       COLHDG('Mese   rilascio..')
     A            A2GIR0         2  0       COLHDG('Giorno rilascio..')
      *
     A            A2TIR0         1          COLHDG('Tipo rilascio....')
     A            A2AVA0         5  2       COLHDG('Avanzam. in % ...')
      *
     A            A2D010        60          COLHDG('Descrizione 01...')
     A            A2D020        60          COLHDG('Descrizione 02...')
     A            A2D030        60          COLHDG('Descrizione 03...')
     A            A2D040        60          COLHDG('Descrizione 04...')
     A            A2D050        60          COLHDG('Descrizione 05...')
      *
     A            A2U010        10          COLHDG('Destinatario 01..')
     A            A2U020        10          COLHDG('Destinatario 01..')
     A            A2U030        10          COLHDG('Destinatario 01..')
     A            A2U040        10          COLHDG('Destinatario 02..')
     A            A2U050        10          COLHDG('Destinatario 03..')
     A            A2U060        10          COLHDG('Destinatario 04..')
     A            A2U070        10          COLHDG('Destinatario 05..')
     A            A2U080        10          COLHDG('Destinatario 06..')
     A            A2U090        10          COLHDG('Destinatario 07..')
     A            A2U100        10          COLHDG('Destinatario 08..')
      *
     A            A2F010         2          COLHDG('Flag 01 .........')
     A            A2F020         2          COLHDG('Flag 02 .........')
     A            A2F030         2          COLHDG('Flag 03 .........')
     A            A2F040         2          COLHDG('Flag 04 .........')
     A            A2F050         2          COLHDG('Flag 05 .........')
     A            A2F060         2          COLHDG('Flag 06 .........')
     A            A2F070         2          COLHDG('Flag 07 .........')
     A            A2F080         2          COLHDG('Flag 08 .........')
     A            A2F090         2          COLHDG('Flag 09 .........')
     A            A2F100         2          COLHDG('Flag 10 .........')
     * ================================================================ *
     *  Rapporto di lavoro                                              *
     *  CEPRO3F0                                                        *
     * ================================================================ *
     A            A3STX0         1          COLHDG('Stato ...........')
     A            A3USE0        10          COLHDG('Utente ..........')
     A            A3GRX0         2  0       COLHDG('gg.  variazione .')
     A            A3MSX0         2  0       COLHDG('mm.  variazione .')
     A            A3SCX0         2  0       COLHDG('ss.  variazione .')
     A            A3ANX0         2  0       COLHDG('aa.  variazione .')
     A            A3NRX0         9  0       COLHDG('Numero Azione ...')
     A            A3ORX0         6  0       COLHDG('Ora Variazione...')
      *
     A            A3SCR0         2  0       COLHDG('Secolo rapporto  ')
     A            A3ANR0         2  0       COLHDG('Anno   rapporto  ')
     A            A3MER0         2  0       COLHDG('Mese   rapporto  ')
     A            A3GIR0         2  0       COLHDG('Giorno rapporto  ')
     A            A3NUR0         9  0       COLHDG('Numero rapporto  ')
     A            A3PRG0        10          COLHDG('Cod.progetto.....')
     A            A3OPE0        20          COLHDG('Operatore .......')
     A            A3LIS0        10          COLHDG('Libreria sorgente')
     A            A3ARS0        10          COLHDG('Archivio sorgente')
     A            A3MBR0        10          COLHDG('Membro   sorgente')
     A            A3TIS0         4          COLHDG('Tipo sorgente    ')
     A            A3LIO0        10          COLHDG('Libreria oggetto ')
     A            A3OBJ0        10          COLHDG('Nome oggetto ....')
     A            A3ORI0         4  0       COLHDG('Ore min.inizio ..')
     A            A3ORF0         4  0       COLHDG('Ore min.fine   ..')
      *
     A            A3D010        60          COLHDG('Descriz. lav. 01.')
     A            A3D020        60          COLHDG('Descriz. lav. 02.')
     A            A3D030        60          COLHDG('Descriz. lav. 03.')
     A            A3D040        60          COLHDG('Descriz. lav. 04.')
     A            A3D050        60          COLHDG('Descriz. lav. 05.')
      *
     A            A3TIL0         1          COLHDG('Tipo lavoro .....')
      *
      *                                     P=Progetto
      *                                     L=Sviluppo software su rich.estemp.
      *                                     A=Analisi progetto
      *                                     S=Attività sistemistica
      *                                     X=Altro
      *
     A            A3F010         2          COLHDG('Minuti lavoro 1..')
     A            A3F020         2          COLHDG('Minuti lavoro 2..')
     A            A3F030         2          COLHDG('Flag 03 .........')
     A            A3F040         2          COLHDG('Flag 04 .........')
     A            A3F050         2          COLHDG('Flag 05 .........')
     A            A3F060         2          COLHDG('Raggruppamento 1.')
     A            A3F070         2          COLHDG('Flag 07 .........')
     A            A3F080         2          COLHDG('Flag 08 .........')
     A            A3F090         2          COLHDG('Flag 09 .........')
     A            A3F100         2          COLHDG('Flag 10 .........')
     * ================================================================ *
     *  Rapporto di lavoro                                              *
     *  CEPRO4F0                                                        *
     * ================================================================ *
     A            A4STX0         1          COLHDG('Stato ...........')
     A            A4USE0        10          COLHDG('Utente ..........')
     A            A4GRX0         2  0       COLHDG('gg.  variazione .')
     A            A4MSX0         2  0       COLHDG('mm.  variazione .')
     A            A4SCX0         2  0       COLHDG('ss.  variazione .')
     A            A4ANX0         2  0       COLHDG('aa.  variazione .')
     A            A4NRX0         9  0       COLHDG('Numero Azione ...')
     A            A4ORX0         6  0       COLHDG('Ora Variazione...')
      *
     A            A4PRG0        10          COLHDG('Cod.progetto.....')
     A            A4AZI0         4S 0       COLHDG('Azione progetto .')
     A            A4SEQ0         4S 0       COLHDG('Sequenza azione .')
     A            A4DES0        60          COLHDG('Descrizione .....')
     A            A4DTS0         8  0       COLHDG('Data scadenza ...')
     A            A4DTI0         8  0       COLHDG('Data inizio esec.')
     A            A4DTF0         8  0       COLHDG('Data fine   esec.')
      *
     A            A4OPE0        10          COLHDG('Operatore .......')
     A            A4F010        10          COLHDG('Flag 01 .........')
     A            A4F020        10          COLHDG('Flag 02 .........')
     A            A4F030        10          COLHDG('Flag 03 .........')
     A            A4F040        10          COLHDG('Flag 04 .........')
     A            A4F050        10          COLHDG('Flag 05 .........')
     A            A4F060        10          COLHDG('Flag 06 .........')
     A            A4F070        10          COLHDG('Flag 07 .........')
     A            A4F080        10          COLHDG('Flag 08 .........')
     A            A4F090        10          COLHDG('Flag 09 .........')
     A            A4F100        10          COLHDG('Flag 10 .........')
     * ================================================================ *
     *  Dettaglio lavori per foglio elettronico                         *
     *  Cepro5f0                                                        *
     * ================================================================ *
     A            A5PRO0        10          COLHDG('Progetto . . . ..')
     A            A5FI10         2
     A            A5DTI0         8          COLHDG('Data Inserimento.')
     A            A5FI20         2
     A            A5DTS0         8          COLHDG('Data scadenza ...')
     A            A5FI30         2
     A            A5AZI0         4          COLHDG('Azione progetto .')
     A            A5FI40         2
     A            A5SEQ0         4          COLHDG('Sequenza azione .')
     A            A5FI50         2
     A            A5DES0        60          COLHDG('Descrizione .....')
     A            A5FI60         2
     A            A5PRP0        10          COLHDG('Proprietà .......')
     A            A5FI70         2
     A            A5OPE0        10          COLHDG('Operatore .......')
     * ================================================================ *
     *  Utenti assegnati al progetto                                    *
     *  CEPRO6F0                                                        *
     * ================================================================ *
     A            A6STX0         1          COLHDG('Stato ...........')
     A            A6USE0        10          COLHDG('Utente ..........')
     A            A6GRX0         2  0       COLHDG('gg.  variazione .')
     A            A6MSX0         2  0       COLHDG('mm.  variazione .')
     A            A6SCX0         2  0       COLHDG('ss.  variazione .')
     A            A6ANX0         2  0       COLHDG('aa.  variazione .')
     A            A6NRX0         9  0       COLHDG('Numero Azione ...')
     A            A6ORX0         6  0       COLHDG('Ora Variazione...')
     *
     A            A6PRG0        10          COLHDG('Cod.progetto.....')
     A            A6NOM0        40          COLHDG('Nominativo utente')
     ****************************************************************
     *  ARCHIVIO      : ORDF36F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Note  ordini di ritiro. *
     *  PREFISSO      : NOR                                       *
     ****************************************************************
     A            NORSTX0        1          COLHDG('Stato ...........')
     A            NORUSX0       10          COLHDG('Utente immissione')
     A            NORDAX0        8  0       COLHDG('Data immissione .')
     A            NORORX0        6  0       COLHDG('Ora immissione ..')
     A            NORPIX0       10          COLHDG('Progra.immissione')
     A            NORAIX0       10          COLHDG('Azione immissione')
     A            NORUSA0       10          COLHDG('Utente aggiornam.')
     A            NORDAA0        8  0       COLHDG('Data aggiornam. .')
     A            NORORA0        6  0       COLHDG('Ora aggiornam. ..')
     A            NORPGA0       10          COLHDG('Progra.aggiornam.')
     A            NORAZX0       10          COLHDG('Azione aggiornam.')
     A            NORSOC0        2          COLHDG('Società .........')
      *
     A            NORSCO0        2S 0       COLHDG('Sec. ordine .....')
     A            NORANO0        2S 0       COLHDG('aa.  ordine .....')
     A            NORMSO0        2S 0       COLHDG('mm.  ordine .....')
     A            NORGRO0        2S 0       COLHDG('gg.  ordine .....')
     A            NORSGO0        4          COLHDG('Sig. ordine .....')
     A            NORNRO0        9S 0       COLHDG('nr.  ordine .....')
     A            NORNRI0        4  0       COLHDG('nr.  riga ordine.')
     A            NORNRP0        4  0       COLHDG('nr.progress.quota')
      *                                       riguardante (ORDF33)
     A            NORNRR0        4  0       COLHDG('nr.progress.disp.')
      *                                       riguardante (ORDF12)
     A            NORNOO0        4  0       COLHDG('nr.progress.ordi.')
      *                                       riguardante (ORDF34)
     A            NORTIP0        1          COLHDG('Tipo di nota.....')
     A            NORNOR0        4  0       COLHDG('Numero riga .....')
     A            NORDES0       60          COLHDG('Nota ............')
     A            NORF010        1          COLHDG('Flag 01 .........')
     A            NORF020        1          COLHDG('Flag 02 .........')
     A            NORF030        2          COLHDG('Flag 03 .........')
     A            NORF040        2          COLHDG('Flag 04 .........')
     A            NORF050        1          COLHDG('1. Ordini per ser')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            NORF060       10          COLHDG('Flag 06 .........')
     A            NORF070        2          COLHDG('Flag 07 .........')
     A            NORF080        2          COLHDG('Flag 08 .........')
     A            NORF090        2          COLHDG('Flag 09 .........')
     A            NORF100        2          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : TRAPAGF0                                  *
     *  DESCRIZIONE   : Riferimenti conti paghe DIR/IMP/OPE.      *
     *  PREFISSO      : TRP                                       *
     * ============================================================ *
     A            TRPSTX0        1          COLHDG('Stato ...........')
      *
     A            TRPUSI0       10          COLHDG('Utente immissione')
     A            TRPDAI0        8  0       COLHDG('Data immissione .')
     A            TRPORI0        6  0       COLHDG('Ora immissione...')
     A            TRPUSA0       10          COLHDG('Utente modifica..')
     A            TRPDAA0        8  0       COLHDG('Data modifica....')
     A            TRPORA0        6  0       COLHDG('Ora modifica.....')
      *
     A            TRPAZI0        4          COLHDG('Azione ..........')
     A            TRPNRX0        9  0       COLHDG('Numero Azione ...')
     A            TRPSOC0        2          COLHDG('Società..........')
      *
     A            TRPTIP0        3          COLHDG('Tipo retribuzione')
     *                                     DIR = dirigenti
     *                                     IMP = impiegati
     *                                     OPE = operai
     *                                     CCC = co.co.co.
     A            TRPCON0       12          COLHDG('Conto contabile .')
     A            TRPCOA0       12          COLHDG('Conto contabile 2')
     A            TRPDES0       40          COLHDG('Descrizione voce.')
     A            TRPCEC0       12          COLHDG('C.di costo ......')
     A            TRPMAG0        3          COLHDG('Stabilimento.....')
     A            TRPRAG0        4          COLHDG('Raggruppamento ..')
     A            TRPUST0        2          COLHDG('Usato SI/NO .....')
     A            TRPINZ0        3          COLHDG('Codice INAZ .....')
      *
     A            TRPF010        1          COLHDG('E/P/E econ./pat/e')
     A            TRPF020        1          COLHDG('D/A solo Dare/Ave')
     A            TRPF030        2          COLHDG('Flag 03 .........')
     A            TRPF040        2          COLHDG('Flag 04 .........')
     A            TRPF050        2          COLHDG('Flag 05 .........')
     A            TRPF060        2          COLHDG('Flag 06 .........')
     A            TRPF070        2          COLHDG('Flag 07 .........')
     A            TRPF080       10          COLHDG('Flag 08 .........')
     A            TRPF090       10          COLHDG('Flag 09 .........')
     A            TRPF100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : DATCOCF0                                  *
     *  DESCRIZIONE   : Dati per la contabilizzazione paghe       *
     *  PREFISSO      : DDC                                       *
     * ============================================================ *
     A            DDCSTX0        1          COLHDG('Stato ...........')
      *
     A            DDCUSI0       10          COLHDG('Utente immissione')
     A            DDCDAI0        8  0       COLHDG('Data immissione .')
     A            DDCORI0        6  0       COLHDG('Ora immissione...')
     A            DDCAZI0        4          COLHDG('Azione ..........')
     A            DDCNRX0        9  0       COLHDG('Numero Azione ...')
      *
     A            DDCANN0        4  0       COLHDG('Anno ............')
     A            DDCMES0        2  0       COLHDG('Mese ............')
     A            DDCDIT0        5          COLHDG('Codice ditta ....')
     A            DDCCCO0       12          COLHDG('Codice c.di costo')
     A            DDCCON0       12          COLHDG('Codice conto ....')
     A            DDCDES0       30          COLHDG('Descrizione .....')
     A            DDCDAR0       18  6       COLHDG('Dare ............')
     A            DDCAVE0       18  6       COLHDG('Avere ...........')
     A            DDCTIP0        3          COLHDG('Tipo elaborazione')
     A            DDCRAG0        4          COLHDG('Raggruppamento ..')
     A            DDCUST0        2          COLHDG('Usato SI/NO .....')
     A            DDCINZ0        3          COLHDG('Codice INAZ .....')
      *
     A            DDCF010        1          COLHDG('Flag 01 .........')
     A            DDCF020        1          COLHDG('Flag 02 .........')
     A            DDCF030        2          COLHDG('Flag 03 .........')
     A            DDCF040        2          COLHDG('Flag 04 .........')
     A            DDCF050        2          COLHDG('Flag 05 .........')
     A            DDCF060        2          COLHDG('Flag 06 .........')
     A            DDCF070        2          COLHDG('Flag 07 .........')
     A            DDCF080       10          COLHDG('Flag 08 .........')
     A            DDCF090       10          COLHDG('Flag 09 .........')
     A            DDCF100       10          COLHDG('Flag 10 .........')
      ****************************************************************
      *   TABELLA       : ANAUS1F0                                   *
      *   DESCRIZIONE   : Anagrafico Utenti Aggiuntivo x autorizzaz. *
      *   PREFISSO      : BT                                         *
      ****************************************************************
     A            BUSTX0         1          COLHDG('Stato ...........')
     A            BUUSX0        10          COLHDG('Utente ..........')
     A            BUSCX0         2S 0       COLHDG('Sec. variazione .')
     A            BUANX0         2S 0       COLHDG('aa.  variazione .')
     A            BUMSX0         2S 0       COLHDG('mm.  variazione .')
     A            BUGRX0         2S 0       COLHDG('gg.  variazione .')
     A            BUORX0         6S 0       COLHDG('Ora agg.to ......')
     A            BUNRX0         9  0       COLHDG('Numero Azione ...')
      *
     A            BUUSE0        10          COLHDG('Utente ..........')
      *
     A            BUF010         2          COLHDG('SI - Spunta Bolle')
     A            BUF020         2          COLHDG('SI - Md.prezzi Bl')
     A            BUF030         2          COLHDG('SI - Resi merce  ')
     A            BUF040         2          COLHDG('SI - Movim.magaz.')
     A            BUF050         2          COLHDG('SI - Ric.Reg.fatt')
     A            BUF060         2          COLHDG('SI - Incassi Int ')
     A            BUF070         2          COLHDG('SI - Pagam.Int.  ')
     A            BUF080         2          COLHDG('Flag per ANARIUF0')
     *                                       01 - Vedi ANARIUF0 per richied. e puoi modificare
     *                                       02 - Vedi ANARIUF0 per richied. ma non puoi modificare.
     *                                       bk,NO - non gestito
     *                                       DP - Solo visualizzazione (CA0050)
     *                                       MG - Solo Magazzino di Anute01l (CA0040)
     A            BUF090         2          COLHDG('SI - Visua.formul')
     A            BUF100         2          COLHDG('Gest.scon.ad per.')
     *                                       01 - Vede ma non può vistare.
     *                                       02 - Vede e può vistare tutto.
     *                                       03 - Non vede (come *blank).
     *                                       04 - Vede e può vistare fino a un tetto.
     A            BUF110         2          COLHDG('SI Gestione data ')
      *                                             produzione su stampa cartellini produzione
     A            BUF120         2          COLHDG('SI calc.kilom.M&G')
     A            BUF130         2          COLHDG('SI modif.Ord.Rit.MP')
     A            BUF140         2          COLHDG('SI modif.MODEL00F')
     A            BUF150         2          COLHDG('Permessi OR0905  ')
      *                                     Permessi speciali su programma controlli ordini (OR0905).
     A            BUF160         2          COLHDG('SI Gest.caus.rad.')
     A            BUF170         2          COLHDG('XN = Fatture A4  ')
     A            BUF180         2          COLHDG('SI mod.bolle cons')
     A            BUF190         2          COLHDG('SI Stampa Bem    ')
     A            BUF200         2          COLHDG('SI. St.Italia Lin')
     * ========================================================================================= *
     *  ARCHIVIO      : ANFO30F0                                                               *
     *  DESCRIZIONE   : Archivio aggiuntivo anagrafico fornitori.                              *
     *  PREFISSO      : FO2                                                                    *
     * ========================================================================================= *
     A            FO2STX0        1          COLHDG('Stato ...........')
      *
     A            FO2USI0       10          COLHDG('Utente immissione')
     A            FO2DAI0        8  0       COLHDG('Data immissione .')
     A            FO2ORI0        6  0       COLHDG('Ora immissione...')
     A            FO2USA0       10          COLHDG('Utente modifica..')
     A            FO2DAA0        8  0       COLHDG('Data modifica....')
     A            FO2ORA0        6  0       COLHDG('Ora modifica.....')
      *
     A            FO2AZI0        4          COLHDG('Azione ..........')
     A            FO2NRX0        9  0       COLHDG('Numero Azione ...')
     A            FO2SOC0        2          COLHDG('Società..........')
     A            FO2FOR0        6          COLHDG('Codice fornitore.')
     A            FO2EMA0       50          COLHDG('Indirizzo email..')
      *
     A            FO2F010        2          COLHDG('BO/DS ord.visual.')
      *                                      Ordine visualizzazione per registrazione fatture:
      *                                      BO=ordinato per data bolla.
      *                                      DS=ordinato per disposizione.
     A            FO2F020        2          COLHDG('SI/NO sudd.ordini')
     A            FO2F030        2          COLHDG('Flag 03 .........')
     A            FO2F040        2          COLHDG('Flag 04 .........')
     A            FO2F050        2          COLHDG('Flag 05 .........')
     A            FO2F060        2          COLHDG('Flag 06 .........')
     A            FO2F070        2          COLHDG('Flag 07 .........')
     A            FO2F080       10          COLHDG('Flag 08 .........')
     A            FO2F090       10          COLHDG('Parte 1 ident.Rg.')
     A            FO2F100       10          COLHDG('Parte 2 ident.Rg.')
     * ================================================================ *
     *  FAGICOF0 FILE FABBISOGNO GIACENZA CONSUMI FACCHINAGGIO          *
     * ================================================================ *
     A            AWSTX0         1          COLHDG('Stato ...........')
      *
     A            AWUSE0        10          COLHDG('Utente ..........')
     A            AWGRX0         2  0       COLHDG('gg.  variazione .')
     A            AWMSX0         2  0       COLHDG('mm.  variAZione .')
     A            AWSCX0         2  0       COLHDG('ss.  variazione .')
     A            AWANX0         2  0       COLHDG('aa.  variazione .')
     A            AWNRX0         9  0       COLHDG('Numero Azione ...')
     A            AWORX0         6  0       COLHDG('Ora Variazione...')
      *
     A            AWDTI0         8  0       COLHDG('Data inserimento ')
     A            AWPR10        15          COLHDG('Prodotto ........')
     A            AWDES0        40          COLHDG('Descrizione .....')
      *
     A            AWLC10        03          COLHDG('Linea comm. 01 ..')
     A            AWLC20        03          COLHDG('Linea comm. 02 ..')
     A            AWLC30        03          COLHDG('Linea comm. 03 ..')
     A            AWLC40        03          COLHDG('Linea comm. 04 ..')
     A            AWLC50        03          COLHDG('Linea comm. 05 ..')
      *
     A            AWLP10        03          COLHDG('Linea prod. 01 ..')
     A            AWLP20        03          COLHDG('Linea prod. 02 ..')
     A            AWLP30        03          COLHDG('Linea prod. 03 ..')
     A            AWLP40        03          COLHDG('Linea prod. 04 ..')
     A            AWLP50        03          COLHDG('Linea prod. 05 ..')
      *
     A            AWTP10        03          COLHDG('Tipo prod.  01...')
      *                                     -010- Commercializzato
      *                                     -020-
     A            AWTP20        03          COLHDG('Tipo prod.  02...')
     A            AWTP30        03          COLHDG('Tipo prod.  03...')
     A            AWTP40        03          COLHDG('Tipo prod.  04...')
     A            AWTP50        03          COLHDG('SI=Pallet unico  ')
      *                                     non si possono mettere altri
      *                                     pallet sopra, quindi vale doppio.
     A            AWMAG0         3          COLHDG('Magazzino -Sito  ')
     A            AWDTM0         8  0       COLHDG('data Fab.Gia.Cons')
     A            AWFAB0        12  3       COLHDG('Fabbisogno       ')
     A            AWGIA0        12  3       COLHDG('Giacenza         ')
     A            AWCON0        12  3       COLHDG('Consumi          ')
     A            AWFAC0        18  5       COLHDG('Fachnaggio       ')
     * ========================================================================================= *
     *  ARCHIVIO      : ANASTBF0                                                               *
     *  DESCRIZIONE   : Anagrafico stabilimenti                                                *
     *  PREFISSO      : FO2                                                                    *
     * ========================================================================================= *
     A            AA1STX0        1          COLHDG('Stato ...........')
      *
      *
     A            AA1USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA1DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA1ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA1USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA1DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA1ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA1STB0        2          COLHDG('STABILIMENTO.....')
     A            AA1DES0       40          COLHDG('Descrizone  .....')
     A            AA1IND0       40          COLHDG('Indirizzo .......')
     A            AA1LOC0       40          COLHDG('Località ........')
     A            AA1CAP0        5          COLHDG('Cap .............')
     A            AA1PRV0        2          COLHDG('Provincia .......')
      *
     A            AA1F010        2          COLHDG('Flag 01 .........')
     A            AA1F020        2          COLHDG('Flag 02 .........')
     A            AA1F030        2          COLHDG('Flag 03 .........')
     A            AA1F040        2          COLHDG('Flag 04 .........')
     A            AA1F050        2          COLHDG('Flag 05 .........')
     A            AA1F060        2          COLHDG('Flag 06 .........')
     A            AA1F070        2          COLHDG('Flag 07 .........')
     A            AA1F080       10          COLHDG('Flag 08 .........')
     A            AA1F090       10          COLHDG('Flag 09 .........')
     A            AA1F100       10          COLHDG('Flag 10 .........')
     * ========================================================================================= *
     *  ARCHIVIO      : STAMP1F0                                                               *
     *  DESCRIZIONE   : RILEVAZIONE DATI STAMPANTI                                             *
     *  PREFISSO      : AA3                                                                    *
     * ========================================================================================= *
     A            AA3STX0        1          COLHDG('Stato ...........')
      *
     A            AA3USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA3DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA3ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA3USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA3DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA3ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA3DEV0       10          COLHDG('Stampante .......')
     A            AA3DES0       40          COLHDG('Descrizione .....')
     A            AA3UBI0       40          COLHDG('Ubicazione  .....')
      *
     A            AA3F010        2          COLHDG('Flag 01 .........')
     A            AA3F020        2          COLHDG('Flag 02 .........')
     A            AA3F030        2          COLHDG('Flag 03 .........')
     A            AA3F040        2          COLHDG('Flag 04 .........')
     A            AA3F050        2          COLHDG('Flag 05 .........')
     A            AA3F060        2          COLHDG('Flag 06 .........')
     A            AA3F070        2          COLHDG('Flag 07 .........')
     A            AA3F080       10          COLHDG('Flag 08 .........')
     A            AA3F090       10          COLHDG('Flag 09 .........')
     A            AA3F100       10          COLHDG('Flag 10 .........')
     * ========================================================================================= *
     *  ARCHIVIO      : STAMP2F0                                                               *
     *  DESCRIZIONE   : RILEVAZIONE DATI STAMPANTI                                             *
     *  PREFISSO      : AA4                                                                    *
     * ========================================================================================= *
     A            AA4STX0        1          COLHDG('Stato ...........')
      *
     A            AA4USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA4DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA4ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA4USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA4DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA4ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA4DTO0        8  0       COLHDG('Data operazione .')
     A            AA4OOP0        6  0       COLHDG('Ora  operazione .')
     A            AA4DEV0       10          COLHDG('Stampante .......')
     A            AA4OPE0       10          COLHDG('Codice operazione')
     A            AA4DES0       10  0       COLHDG('Numero copie ....')
     A            AA4UBI0       40          COLHDG('Descr.operazione.')
      *
     A            AA4F010        2          COLHDG('Flag 01 .........')
     A            AA4F020        2          COLHDG('Flag 02 .........')
     A            AA4F030        2          COLHDG('Flag 03 .........')
     A            AA4F040        2          COLHDG('Flag 04 .........')
     A            AA4F050        2          COLHDG('Flag 05 .........')
     A            AA4F060        2          COLHDG('Flag 06 .........')
     A            AA4F070        2          COLHDG('Flag 07 .........')
     A            AA4F080       10          COLHDG('Flag 08 .........')
     A            AA4F090       10          COLHDG('Flag 09 .........')
     A            AA4F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : ANCOR0F0                                  *
     *  DESCRIZIONE   : Anagrafico codici orari                   *
     *  PREFISSO      : AA5                                       *
     * ============================================================ *
     A            AA5STX0        1          COLHDG('Stato ...........')
      *
     A            AA5USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA5DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA5ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA5USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA5DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA5ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA5CDO0        3A         COLHDG('Codice orario.......')
     A            AA5DES0       40          COLHDG('Descrizione codice..')
     A            AA5TIP0        1          COLHDG('1=Turno 2=Impiegato.')
      *
     A            AA5OI10        4  0       COLHDG('Ore, minuti inizio..')
     A            AA5OF10        4  0       COLHDG('Ore, minuti fine  ..')
      *
     A            AA5OI20        4  0       COLHDG('Ore, minuti inizio..')
     A            AA5OF20        4  0       COLHDG('Ore, minuti fine  ..')
      *
     A            AA5F010        2          COLHDG('Flag 01 .........')
     A            AA5F020        2          COLHDG('Flag 02 .........')
     A            AA5F030        2          COLHDG('Flag 03 .........')
     A            AA5F040        2          COLHDG('Flag 04 .........')
     A            AA5F050        2          COLHDG('Flag 05 .........')
     A            AA5F060        2          COLHDG('Flag 06 .........')
     A            AA5F070        2          COLHDG('Flag 07 .........')
     A            AA5F080       10          COLHDG('Flag 08 .........')
     A            AA5F090       10          COLHDG('Flag 09 .........')
     A            AA5F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : ANZONFF0                                  *
     *  DESCRIZIONE   : Zone di lavoro di fabbrica                *
     *  PREFISSO      : AA6                                       *
     * ============================================================ *
     A            AA6STX0        1          COLHDG('Stato ...........')
      *
     A            AA6USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA6DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA6ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA6USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA6DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA6ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA6STB0        3A         COLHDG('Stabilimento .......')
     A            AA6ZON0        3A         COLHDG('Codice Fabbrica ....')
     A            AA6DES0       40          COLHDG('Descrizione ........')
      *
     A            AA6F010        2          COLHDG('Flag 01 .........')
     A            AA6F020        2          COLHDG('Flag 02 .........')
     A            AA6F030        2          COLHDG('Flag 03 .........')
     A            AA6F040        2          COLHDG('Flag 04 .........')
     A            AA6F050        2          COLHDG('Flag 05 .........')
     A            AA6F060        2          COLHDG('Flag 06 .........')
     A            AA6F070        2          COLHDG('Flag 07 .........')
     A            AA6F080       10          COLHDG('Flag 08 .........')
     A            AA6F090       10          COLHDG('Flag 09 .........')
     A            AA6F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : ANCENLF0                                  *
     *  DESCRIZIONE   : Centri di lavoro                          *
     *  PREFISSO      : AA7                                       *
     * ============================================================ *
     A            AA7STX0        1          COLHDG('Stato ...........')
      *
     A            AA7USI0       10          COLHDG('UTENTE IMMISSIONE')
     A            AA7DAI0        8  0       COLHDG('DATA IMMISSIONE .')
     A            AA7ORI0        6  0       COLHDG('ORA IMMISSIONE...')
     A            AA7USA0       10          COLHDG('UTENTE MODIFICA..')
     A            AA7DAA0        8  0       COLHDG('DATA MODIFICA....')
     A            AA7ORA0        6  0       COLHDG('ORA MODIFICA.....')
      *
     A            AA7STB0        3          COLHDG('Stabilimento .......')
     A            AA7ZON0        3          COLHDG('Codice Fabbrica ....')
     A            AA7CLA0        3          COLHDG('Centro di lavoro ...')
     A            AA7DES0       40          COLHDG('Descrizione ........')
     A            AA7CCO0       12          COLHDG('Centro di Costo ....')
     A            AA7PVS0        1          COLHDG('Prefisso Voce di sp.')
     A            AA7VDS0       12          COLHDG('Voce di spesa ......')
      *
     A            AA7F010        2          COLHDG('Flag 01 .........')
     A            AA7F020        2          COLHDG('Flag 02 .........')
     A            AA7F030        2          COLHDG('Flag 03 .........')
     A            AA7F040        2          COLHDG('Flag 04 .........')
     A            AA7F050        2          COLHDG('Flag 05 .........')
     A            AA7F060        2          COLHDG('Flag 06 .........')
     A            AA7F070        2          COLHDG('Flag 07 .........')
     A            AA7F080       10          COLHDG('Flag 08 .........')
     A            AA7F090       10          COLHDG('Flag 09 .........')
     A            AA7F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : ANCALVF0                                  *
     *  DESCRIZIONE   : CALENDARO DI LAVORO                       *
     *  PREFISSO      : AA8                                       *
     * ============================================================ *
     A            AA8STX0        1          COLHDG('Stato ...........')
      *
     A            AA8USI0       10          COLHDG('Utente immissione')
     A            AA8DAI0        8  0       COLHDG('Data immissione .')
     A            AA8ORI0        6  0       COLHDG('Ora immissione...')
     A            AA8USA0       10          COLHDG('Utente modifica..')
     A            AA8DAA0        8  0       COLHDG('Data modifica....')
     A            AA8ORA0        6  0       COLHDG('Ora modifica ....')
      *
     A            AA8STB0        3          COLHDG('Stabilimento .......')
     A            AA8ZON0        3          COLHDG('Codice Fabbrica ....')
     A            AA8GEN0        8S 0       COLHDG('Data generazione ...')
     A            AA8CLA0        3          COLHDG('Centro di lavoro ...')
     A            AA8MAT0        5          COLHDG('Matricola dipend....')
     A            AA8SEQ0        4S 0       COLHDG('Sequenza  ..........')
     A            AA8CDO0        3          COLHDG('Codice turno/orario.')
     A            AA8CCO0       12          COLHDG('Centro di Costo ....')
     A            AA8PVS0        1          COLHDG('Prefisso Voce di sp.')
     A            AA8VDS0       12          COLHDG('Voce di spesa ......')
     A            AA8DTL0        8  0       COLHDG('Data calendario ....')
     A            AA8OI10        4  0       COLHDG('Ora inizio .........')
     A            AA8OF10        4  0       COLHDG('Ora fine   .........')
      *
     A            AA8F010        2          COLHDG('SI = Straordin...')
     A            AA8F020        2          COLHDG('Flag 02 .........')
     A            AA8F030        2          COLHDG('Flag 03 .........')
     A            AA8F040        2          COLHDG('Flag 04 .........')
     A            AA8F050        2          COLHDG('Flag 05 .........')
     A            AA8F060        2          COLHDG('Flag 06 .........')
     A            AA8F070        2          COLHDG('Flag 07 .........')
     A            AA8F080       10          COLHDG('Flag 08 .........')
     A            AA8F090       10          COLHDG('Flag 09 .........')
     A            AA8F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : ANCAPAF0                                  *
     *  DESCRIZIONE   : CALENDARO PERMESSI-ASSENZE                *
     *  PREFISSO      : AA9                                       *
     * ============================================================ *
     A            AA9STX0        1          COLHDG('Stato ...........')
      *
     A            AA9USI0       10          COLHDG('Utente immissione')
     A            AA9DAI0        8  0       COLHDG('Data immissione .')
     A            AA9ORI0        6  0       COLHDG('Ora immissione...')
     A            AA9USA0       10          COLHDG('Utente modifica..')
     A            AA9DAA0        8  0       COLHDG('Data modifica....')
     A            AA9ORA0        6  0       COLHDG('Ora modifica ....')
      *
     A            AA9STB0        3          COLHDG('Stabilimento .......')
     A            AA9ZON0        3          COLHDG('Codice Fabbrica ....')
     A            AA9GEN0        8S 0       COLHDG('Data generazione ...')
     A            AA9DTI0        8S 0       COLHDG('Data Inizio ........')
     A            AA9DTF0        8S 0       COLHDG('Data fine ..........')
     A            AA9CAP0        3          COLHDG('Caus.Perm./Assenza..')
     A            AA9MAT0        5          COLHDG('Matricola dipend....')
     A            AA9ORE0        4S 0       COLHDG('Ore, minuti ........')
      *
     A            AA9F010        2          COLHDG('Flag 01 .........')
     A            AA9F020        2          COLHDG('Flag 02 .........')
     A            AA9F030        2          COLHDG('Flag 03 .........')
     A            AA9F040        2          COLHDG('Flag 04 .........')
     A            AA9F050        2          COLHDG('Flag 05 .........')
     A            AA9F060        2          COLHDG('Flag 06 .........')
     A            AA9F070        2          COLHDG('Flag 07 .........')
     A            AA9F080       10          COLHDG('Flag 08 .........')
     A            AA9F090       10          COLHDG('Flag 09 .........')
     A            AA9F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : MOVOREF0                                  *
     *  DESCRIZIONE   : Movimenti imputazione ore operai          *
     *  PREFISSO      : AB1                                       *
     * ============================================================ *
     A            AB1STX0        1          COLHDG('Stato ...........')
      *
     A            AB1USI0       10          COLHDG('Utente immissione')
     A            AB1DAI0        8  0       COLHDG('Data immissione .')
     A            AB1ORI0        6  0       COLHDG('Ora immissione...')
     A            AB1USA0       10          COLHDG('Utente modifica..')
     A            AB1DAA0        8  0       COLHDG('Data modifica....')
     A            AB1ORA0        6  0       COLHDG('Ora modifica ....')
      *
     A            AB1STB0        3          COLHDG('Stabilimento .......')
     A            AB1GEN0        8S 0       COLHDG('Data servizio ......')
     A            AB1CAP0        3          COLHDG('Caus.Perm./Assenza..')
     A            AB1MAT0        5          COLHDG('Matricola dipend....')
     A            AB1ORD0        4S 0       COLHDG('Ore, minuti Diurne .')
     A            AB1ORN0        4S 0       COLHDG('Ore, minuti Notte  .')
     A            AB1ORP0        4S 0       COLHDG('Ore, minuti Per/Ass.')
     A            AB1ORE0        4S 0       COLHDG('Ore, minuti Totali .')
      *
     A            AB1F010        2          COLHDG('Flag 01 .........')
     A            AB1F020        2          COLHDG('Flag 02 .........')
     A            AB1F030        2          COLHDG('Flag 03 .........')
     A            AB1F040        2          COLHDG('Flag 04 .........')
     A            AB1F050        2          COLHDG('Flag 05 .........')
     A            AB1F060        2          COLHDG('Flag 06 .........')
     A            AB1F070        2          COLHDG('Flag 07 .........')
     A            AB1F080       10          COLHDG('Flag 08 .........')
     A            AB1F090       10          COLHDG('Flag 09 .........')
     A            AB1F100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : MOVORRF0                                  *
     *  DESCRIZIONE   : Movimenti imputazione ore operai          *
     *  PREFISSO      : AB2                                       *
     * ============================================================ *
     A            AB2STX0        1          COLHDG('Stato ...........')
      *
     A            AB2USI0       10          COLHDG('Utente immissione')
     A            AB2DAI0        8  0       COLHDG('Data immissione .')
     A            AB2ORI0        6  0       COLHDG('Ora immissione...')
     A            AB2USA0       10          COLHDG('Utente modifica..')
     A            AB2DAA0        8  0       COLHDG('Data modifica....')
     A            AB2ORA0        6  0       COLHDG('Ora modifica ....')
      *
     A            AB2STB0        3          COLHDG('Stabilimento .......')
     A            AB2ZON0        3          COLHDG('Codice Fabbrica ....')
     A            AB2CLA0        3          COLHDG('Centro di lavoro ...')
     A            AB2GEN0        8S 0       COLHDG('Data servizio ......')
     A            AB2CAP0        3          COLHDG('Caus.Perm./Assenza..')
     A            AB2MAT0        5          COLHDG('Matricola dipend....')
     A            AB2ORD0        4S 0       COLHDG('Ore, minuti Diurne .')
     A            AB2ORN0        4S 0       COLHDG('Ore, minuti Notte  .')
     A            AB2ORP0        4S 0       COLHDG('Ore, minuti Per/Ass.')
     A            AB2ORE0        4S 0       COLHDG('Ore, minuti Totali .')
     A            AB2QUA0        3          COLHDG('Qualifica ..........')
     A            AB2CAT0        3          COLHDG('Categoria ..........')
     A            AB2GIO0        1          COLHDG('Giorno settimana ...')
     A            AB2CCO0       12          COLHDG('Centro di costo ....')
      *
     A            AB2F010        2          COLHDG('Flag 01 .........')
     A            AB2F020        2          COLHDG('Flag 02 .........')
     A            AB2F030        2          COLHDG('Flag 03 .........')
     A            AB2F040        2          COLHDG('Flag 04 .........')
     A            AB2F050        2          COLHDG('Flag 05 .........')
     A            AB2F060        2          COLHDG('Flag 06 .........')
     A            AB2F070        2          COLHDG('Flag 07 .........')
     A            AB2F080       10          COLHDG('Flag 08 .........')
     A            AB2F090       10          COLHDG('Flag 09 .........')
     A            AB2F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : CATFO4F0                                  *
     *  DESCRIZIONE   : Catalogo per fornitore (offerte).         *
     *  PREFISSO      : FC5                                       *
     ****************************************************************
     A            FC5STX0        1          COLHDG('Stato ...........')
     A            FC5USX0       10          COLHDG('Utente immissione')
     A            FC5DAX0        8S 0       COLHDG('Data immissione..')
     A            FC5ORX0        6S 0       COLHDG('Ora immissione...')
     A            FC5USA0       10          COLHDG('Utente Variazione')
     A            FC5DAA0        8S 0       COLHDG('Data variazione..')
     A            FC5ORA0        6S 0       COLHDG('Ora variazione...')
     A            FC5NRX0        9  0       COLHDG('Numero Azione ...')
     A            FC5CAZ0        4          COLHDG('Codice Azione ...')
      *
     A            FC5SOC0        2          COLHDG('Società .........')
     A            FC5MAG0        3          COLHDG('Codice magazzino.')
     A            FC5CFO0        6          COLHDG('Fornitore .......')
     A            FC5DAV0        8S 0       COLHDG('Data validità....')
     A            FC5PRO0       20          COLHDG('Prodotto ........')
      *
     A            FC5DOF0        8S 0       COLHDG('Data offerta ....')
     A            FC5SOF0        4          COLHDG('Sigla offerta ...')
     A            FC5NOF0        9S 0       COLHDG('Numero offerta ..')
     A            FC5PLI0       18  6       COLHDG('Prezzo offerta ..')
     A            FC5QTA0       12  3       COLHDG('Quantità offerta.')
     A            FC5DE10       40          COLHDG('Descrizione 1 ...')
     A            FC5DE20       40          COLHDG('Descrizione 2 ...')
     A            FC5NRF0        9S 0       COLHDG('Num.rec.offerta..')
      *
     A            FC5F010        1          COLHDG('Flag 01 .........')
     A            FC5F020        1          COLHDG('Flag 02 .........')
     A            FC5F030        1          COLHDG('Flag 03 .........')
     A            FC5F040        1          COLHDG('Flag 04 .........')
     A            FC5F050        2          COLHDG('Flag 05 .........')
     A            FC5F060        2          COLHDG('Flag 06 .........')
     A            FC5F070        2          COLHDG('Flag 07 .........')
     A            FC5F080       10          COLHDG('Flag 08 .........')
     A            FC5F090       10          COLHDG('Flag 09 .........')
     A            FC5F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : TABE42                                    *
     *  DESCRIZIONE   : Causali di lavorazione.                   *
     *  PREFISSO      : T42                                       *
     ****************************************************************
     A            T42DE0        40          COLHDG('Descrizione ......')
     A            T42TM0         1          COLHDG('Tipo movimento ...')
     A            T42TL0         1          COLHDG('Tipo lavoro ......')
     ****************************************************************
     *  TABELLA       : PROMEDF0                                  *
     *  DESCRIZIONE   : Provvigioni mediatori                     *
     *  PREFISSO      : F6                                        *
     ****************************************************************
     A            F60STX0        1          COLHDG('Stato ...........')
     A            F60USX0       10          COLHDG('Utente immissione')
     A            F60DAX0        8S 0       COLHDG('Data immissione..')
     A            F60ORX0        6S 0       COLHDG('Ora immissione...')
     A            F60PGX0       10          COLHDG('Programma immiss.')
     A            F60USA0       10          COLHDG('Utente Variazione')
     A            F60DAA0        8S 0       COLHDG('Data variazione..')
     A            F60ORA0        6S 0       COLHDG('Ora variazione...')
     A            F60PGA0       10          COLHDG('Programma variaz.')
      *
     A            F6MEDIA0       6          COLHDG('Codice mediatore.')
     A            F6ANNOC0       4  0       COLHDG('Anno contratto ..')
     A            F6NUMEC0       5  0       COLHDG('Num. contratto ..')
     A            F6ARTIC0      15          COLHDG('Prodotto ........')
     A            F6FORNI0       6          COLHDG('Codice fornitore.')
     A            F6DATDI0       8  0       COLHDG('Data distinta ...')
     A            F6DATBE0       8  0       COLHDG('Data bem ........')
     A            F6NUMBE0       9  0       COLHDG('Num. bem ........')
     A            F6DATDD0       8  0       COLHDG('Data ddt ........')
     A            F6NUMDD0      10          COLHDG('Num. ddt+sigla ..')
     A            F6QTADD0      18  6       COLHDG('Quantità ........')
     A            F6PRUNI0      18  6       COLHDG('Prezzo unitario..')
     A            F6VALOR0      18  6       COLHDG('Valore riga .....')
     A            F6E3SCO0       2S 0       COLHDG('Sec. ordine .....')
     A            F6E3ANO0       2S 0       COLHDG('aa.  ordine .....')
     A            F6E3MSO0       2S 0       COLHDG('mm.  ordine .....')
     A            F6E3GRO0       2S 0       COLHDG('gg.  ordine .....')
     A            F6E3SGO0       4          COLHDG('Sig. ordine .....')
     A            F6E3NRO0       9S 0       COLHDG('nr.  ordine .....')
     A            F6E3NRI0       4S 0       COLHDG('nr.  riga .......')
     A            F6E3NRP0       4S 0       COLHDG('nr.progress.quota')
     A            F6E3NRR0       4S 0       COLHDG('nr.progress.disp.')
     A            F6CAUSA0       2          COLHDG('Causale .........')
     A            F6NUMAS0       9  0       COLHDG('Numero assegnato.')
     A            F6DATAS0       8  0       COLHDG('Data assegnazione')
     A            F6NRSES0       9  0       COLHDG('Numero sessione .')
     A            F6NRMOV0       4  0       COLHDG('Numero movimento.')
      *
     A            F6F0010        1          COLHDG('S=Selezionato ...')
     A            F6F0020        1          COLHDG('N=Non considerare')
     A            F6F0030        1          COLHDG('Flag 03 .........')
     A            F6F0040        1          COLHDG('Flag 04 .........')
     A            F6F0050        2          COLHDG('Flag 05 .........')
     A            F6F0060        2          COLHDG('Flag 06 .........')
     A            F6F0070       10          COLHDG('Flag 07 .........')
     A            F6F0080       10          COLHDG('Flag 08 .........')
     A            F6F0090       10          COLHDG('Flag 09 .........')
     A            F6F0100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PROMETF0                                  *
     *  DESCRIZIONE   : Provvigioni mediatori Testata             *
     *  PREFISSO      : F6                                        *
     ****************************************************************
     A            F70STX0        1          COLHDG('Stato ...........')
     A            F70USX0       10          COLHDG('Utente immissione')
     A            F70DAX0        8S 0       COLHDG('Data immissione..')
     A            F70ORX0        6S 0       COLHDG('Ora immissione...')
     A            F70USA0       10          COLHDG('Utente Variazione')
     A            F70DAA0        8S 0       COLHDG('Data variazione..')
     A            F70ORA0        6S 0       COLHDG('Ora variazione...')
     A            F70NRX0        9  0       COLHDG('Numero Azione ...')
     A            F70CAZ0        4          COLHDG('Codice Azione ...')
      *
     A            F7MEDIA0       6          COLHDG('Codice mediatore.')
     A            F7QTATO0      18  6       COLHDG('Quantità ........')
     A            F7VALTO0      18  6       COLHDG('Valore totale ...')
     A            F7NUMAS0       9  0       COLHDG('Numero assegnato.')
     A            F7DATAS0       8  0       COLHDG('Data assegnazione')
      *
     A            F7F0010        1          COLHDG('S=Selezionato ...')
     A            F7F0020        1          COLHDG('Flag 02 .........')
     A            F7F0030        1          COLHDG('Flag 03 .........')
     A            F7F0040        1          COLHDG('Flag 04 .........')
     A            F7F0050        2          COLHDG('Flag 05 .........')
     A            F7F0060        2          COLHDG('Flag 06 .........')
     A            F7F0070        2          COLHDG('Flag 07 .........')
     A            F7F0080       10          COLHDG('Flag 08 .........')
     A            F7F0090       10          COLHDG('Flag 09 .........')
     A            F7F0100       10          COLHDG('Flag 10 .........')
     * ============================================================ *
     *  ARCHIVIO      : BADMATF0                                  *
     *  DESCRIZIONE   : Riferimento Badge - Matricola dipendente  *
     *  PREFISSO      : BDM                                       *
     * ============================================================ *
     A            BDMSTX0        1          COLHDG('Stato ...........')
      *
     A            BDMBAD0       10          COLHDG('Numero badge ....')
     A            BDMDAI0        8S 0       COLHDG('Data inizio .....')
     A            BDMORI0        6S 0       COLHDG('Ora  inizio .....')
     A            BDMDAF0        8S 0       COLHDG('Data fine .......')
     A            BDMORF0        6S 0       COLHDG('Ora  fine .......')
     A            BDMMAT0        5          COLHDG('Numero matricola.')
     A            BDMAZI0        2          COLHDG('Codice azienda...')
     A            BDMBD20       10          COLHDG('Badge di rifer...')
     ****************************************************************
     *  TABELLA       : VERSA1F0                                  *
     *  DESCRIZIONE   : Versamenti incassi clienti: testata       *
     *  PREFISSO      : F6                                        *
     ****************************************************************
     A            FI1STX0        1          COLHDG('Stato ...........')
     *
     A            FI1USX0       10          COLHDG('Utente immissione')
     A            FI1DAX0        8S 0       COLHDG('Data immissione..')
     A            FI1ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI1USA0       10          COLHDG('Utente Variazione')
     A            FI1DAA0        8S 0       COLHDG('Data variazione..')
     A            FI1ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI1NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI1CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI1DTR0        8S 0       COLHDG('Data registraz...')
     A            FI1NUR0        9S 0       COLHDG('Num. registraz...')
     *
     A            FI1AGE0        3          COLHDG('Agente ..........')
     A            FI1DTV0        8S 0       COLHDG('Data versamento .')
     *
     A            FI1IMD0       18S 6       COLHDG('Importo distinta.')
      *
     A            FI10010        1          COLHDG('Flag 01 .........')
     A            FI10020        1          COLHDG('Flag 02 .........')
     A            FI10030        1          COLHDG('Flag 03 .........')
     A            FI10040        1          COLHDG('Flag 04 .........')
     A            FI10050        2          COLHDG('Flag 05 .........')
     A            FI10060        2          COLHDG('Flag 06 .........')
     A            FI10070        2          COLHDG('Flag 07 .........')
     A            FI10080       10          COLHDG('Flag 08 .........')
     A            FI10090       10          COLHDG('Flag 09 .........')
     A            FI10100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : VERSA2F0                                  *
     *  DESCRIZIONE   : Versamenti incassi clienti : Dettaglio    *
     *  PREFISSO      : F6                                        *
     ****************************************************************
     A            FI2STX0        1          COLHDG('Stato ...........')
     *
     A            FI2USX0       10          COLHDG('Utente immissione')
     A            FI2DAX0        8S 0       COLHDG('Data immissione..')
     A            FI2ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI2USA0       10          COLHDG('Utente Variazione')
     A            FI2DAA0        8S 0       COLHDG('Data variazione..')
     A            FI2ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI2NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI2CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI2DTR0        8S 0       COLHDG('Data registraz...')
     A            FI2NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI2RIR0        4S 0       COLHDG('Riga registraz...')
     *
     A            FI2NFA0        6S 0       COLHDG('Num.fattura .....')
     A            FI2ANF0        4S 0       COLHDG('Anno fattura ....')
     A            FI2DTF0        8S 0       COLHDG('Data fattura.....')
     A            FI2TDO0        1          COLHDG('Tipo documento ..')
     A            FI2CLI0        6          COLHDG('Cliente  ........')
     A            FI2IMF0       18S 6       COLHDG('Importo fattura..')
     A            FI2PCS0        5S 2       COLHDG('% sconto ........')
     A            FI2PCSB0       5S 2       COLHDG('% sconto ........')
     A            FI2IMS0       18S 6       COLHDG('Importo sconto ..')
     A            FI2IMV0       18S 6       COLHDG('Importo versam...')
     A            FI2CAU0        2          COLHDG('Causale .........')
      *                                     RN Richiesta Nota credito
      *                                     AB  Abbuono
      *
     A            FI20010        1          COLHDG('S=Selezionato ...')
     A            FI20020        1          COLHDG('Opz. Pannello....')
     A            FI20030        1          COLHDG('Flag 03 .........')
     A            FI20040        1          COLHDG('Flag 04 .........')
     A            FI20050        2          COLHDG('Flag 05 .........')
     A            FI20060        2          COLHDG('Flag 06 .........')
     A            FI20070        2          COLHDG('Flag 07 .........')
     A            FI20080       10          COLHDG('Flag 08 .........')
     A            FI20090       10          COLHDG('Flag 09 .........')
     A            FI20100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : VERSA3F0                                  *
     *  DESCRIZIONE   : Versamenti incassi clienti: note          *
     *  PREFISSO      : FI3                                       *
     ****************************************************************
     A            FI3STX0        1          COLHDG('Stato ...........')
     *
     A            FI3USX0       10          COLHDG('Utente immissione')
     A            FI3DAX0        8S 0       COLHDG('Data immissione..')
     A            FI3ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI3USA0       10          COLHDG('Utente Variazione')
     A            FI3DAA0        8S 0       COLHDG('Data variazione..')
     A            FI3ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI3NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI3CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI3DTR0        8S 0       COLHDG('Data registraz...')
     A            FI3NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI3RIR0        4S 0       COLHDG('Riga registraz...')
     A            FI3PRG0        4S 0       COLHDG('Progressivo riga.')
     *
     A            FI3NFA0        6S 0       COLHDG('Num.fattura .....')
     A            FI3ANF0        4S 0       COLHDG('Anno fattura ....')
     *
     A            FI3DES0       60          COLHDG('Descrizione .....')
      *
     A            FI30010        1          COLHDG('S=Selezionato ...')
     A            FI30020        1          COLHDG('Flag 02 .........')
     A            FI30030        1          COLHDG('Flag 03 .........')
     A            FI30040        1          COLHDG('Flag 04 .........')
     A            FI30050        2          COLHDG('Flag 05 .........')
     A            FI30060        2          COLHDG('Flag 06 .........')
     A            FI30070        2          COLHDG('Flag 07 .........')
     A            FI30080       10          COLHDG('Flag 08 .........')
     A            FI30090       10          COLHDG('Flag 09 .........')
     A            FI30100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : VERSA4F0                                  *
     *  DESCRIZIONE   : Versamenti incassi clienti : Corpo fattura*
     *  PREFISSO      : FI4                                       *
     ****************************************************************
     A            FI4STX0        1          COLHDG('Stato ...........')
     *
     A            FI4USX0       10          COLHDG('Utente immissione')
     A            FI4DAX0        8S 0       COLHDG('Data immissione..')
     A            FI4ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI4USA0       10          COLHDG('Utente Variazione')
     A            FI4DAA0        8S 0       COLHDG('Data variazione..')
     A            FI4ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI4NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI4CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI4DTR0        8S 0       COLHDG('Data registraz...')
     A            FI4NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI4RIR0        4S 0       COLHDG('Riga registraz...')
     *
     A            FI4NFA0        6S 0       COLHDG('Num.fattura .....')
     A            FI4ANF0        4S 0       COLHDG('Anno fattura ....')
     *
     A            FI4NBO0        6S 0       COLHDG('Num.bolla .......')
     A            FI4DTB0        8S 0       COLHDG('Data bolla ......')
     *
     A            FI4CLI0        6          COLHDG('Cliente  ........')
     A            FI4RIG0        4S 0       COLHDG('Riga bolla ......')
     A            FI4PRO0       20          COLHDG('Prodotto ........')
     A            FI4PRU0       18S 6       COLHDG('Nuovo prezzo unit')
     A            FI4PCS0        5S 0       COLHDG('% sconto ........')
     A            FI4PCSB0       5S 0       COLHDG('% sconto ........')
     A            FI4IMS0       18S 6       COLHDG('Importo sconto ..')
      *
     A            FI40010        1          COLHDG('S=Selezionato ...')
     A            FI40020        1          COLHDG('Flag 02 .........')
     A            FI40030        1          COLHDG('Flag 03 .........')
     A            FI40040        1          COLHDG('Flag 04 .........')
     A            FI40050        2          COLHDG('Flag 05 .........')
     A            FI40060        2          COLHDG('Flag 06 .........')
     A            FI40070        2          COLHDG('Flag 07 .........')
     A            FI40080       10          COLHDG('Flag 08 .........')
     A            FI40090       10          COLHDG('Flag 09 .........')
     A            FI40100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : NOTCR1F0                                  *
     *  DESCRIZIONE   : Note credito - Storni anno precedente     *
     *  PREFISSO      : Fi5                                       *
     ****************************************************************
     A            FI5STX0        1          COLHDG('Stato ...........')
     *
     A            FI5USX0       10          COLHDG('Utente immissione')
     A            FI5DAX0        8S 0       COLHDG('Data immissione..')
     A            FI5ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI5USA0       10          COLHDG('Utente Variazione')
     A            FI5DAA0        8S 0       COLHDG('Data variazione..')
     A            FI5ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI5NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI5CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI5DTR0        8S 0       COLHDG('Data registraz...')
     A            FI5NUR0        9S 0       COLHDG('Num. registraz...')
      *
     A            FI50010        1          COLHDG('Flag 01 .........')
     A            FI50020        1          COLHDG('Flag 02 .........')
     A            FI50030        1          COLHDG('Flag 03 .........')
     A            FI50040        1          COLHDG('Flag 04 .........')
     A            FI50050        2          COLHDG('Flag 05 .........')
     A            FI50060        2          COLHDG('Flag 06 .........')
     A            FI50070        2          COLHDG('Flag 07 .........')
     A            FI50080       10          COLHDG('Flag 08 .........')
     A            FI50090       10          COLHDG('Flag 09 .........')
     A            FI50100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : NOTCR2F0                                  *
     *  DESCRIZIONE   : Note credito - Storni anno precedente     *
     *  PREFISSO      : Fi6                                       *
     ****************************************************************
     A            FI6STX0        1          COLHDG('Stato ...........')
     *
     A            FI6USX0       10          COLHDG('Utente immissione')
     A            FI6DAX0        8S 0       COLHDG('Data immissione..')
     A            FI6ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI6USA0       10          COLHDG('Utente Variazione')
     A            FI6DAA0        8S 0       COLHDG('Data variazione..')
     A            FI6ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI6NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI6CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI6DTR0        8S 0       COLHDG('Data registraz...')
     A            FI6NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI6RIR0        4S 0       COLHDG('Riga registraz...')
     *
     A            FI6NFA0        6S 0       COLHDG('Num.fattura .....')
     A            FI6ANF0        4S 0       COLHDG('Anno fattura ....')
     A            FI6TDO0        1          COLHDG('Tipo documento ..')
     A            FI6CLI0        6          COLHDG('Cliente  ........')
     A            FI6PCS0        5S 2       COLHDG('% sconto ........')
     A            FI6IMS0       18S 6       COLHDG('Importo sconto ..')
     A            FI6IMV0       18S 6       COLHDG('Importo versam...')
     A            FI6CAU0        2          COLHDG('Causale .........')
      *
      *                                     RN Richiesta Nota credito
      *                                     AB  Abbuono
      *
     A            FI60010        1          COLHDG('S=Passato in con.')
     A            FI60020        1          COLHDG('Flag 02 .........')
     A            FI60030        1          COLHDG('Flag 03 .........')
     A            FI60040        1          COLHDG('Flag 04 .........')
     A            FI60050        2          COLHDG('Flag 05 .........')
     A            FI60060        2          COLHDG('Flag 06 .........')
     A            FI60070        2          COLHDG('Flag 07 .........')
     A            FI60080       10          COLHDG('Flag 08 .........')
     A            FI60090       10          COLHDG('Flag 09 .........')
     A            FI60100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : MOMANOF0                                  *
     *  DESCRIZIONE   : Note ai movimenti di magazzino            *
     *  PREFISSO      : MON                                       *
     ****************************************************************
     A            MONSTX0        1          COLHDG('Stato ...........')
     *
     A            MONUSX0       10          COLHDG('Utente immissione')
     A            MONDAX0        8S 0       COLHDG('Data immissione..')
     A            MONORX0        6S 0       COLHDG('Ora immissione...')
     A            MONPGX0       10          COLHDG('Progr.immissione.')
     A            MONUSA0       10          COLHDG('Utente Variazione')
     A            MONDAA0        8S 0       COLHDG('Data variazione..')
     A            MONORA0        6S 0       COLHDG('Ora variazione...')
     A            MONPGA0       10          COLHDG('Progr.variazione.')
     A            MONNRX0        9  0       COLHDG('Numero Azione ...')
     A            MONCAZ0        4          COLHDG('Codice Azione ...')
     *
     A            MONNRS0        9  0       COLHDG('Numero sessione..')
     A            MONNRM0        4  0       COLHDG('Numero movimento.')
     A            MONNRR0        4  0       COLHDG('Numero riga......')
     A            MONCAU0        3          COLHDG('Codice causale...')
     A            MONDES0       50          COLHDG('Descr.libera.....')
     *
     A            MON0010        1          COLHDG('Flag 01 .........')
     A            MON0020        1          COLHDG('Flag 02 .........')
     A            MON0030        1          COLHDG('Flag 03 .........')
     A            MON0040        2          COLHDG('Flag 04 .........')
     A            MON0050        2          COLHDG('Flag 05 .........')
     A            MON0060        2          COLHDG('Flag 06 .........')
     A            MON0070        2          COLHDG('Flag 07 .........')
     A            MON0080       10          COLHDG('Flag 08 .........')
     A            MON0090       10          COLHDG('Flag 09 .........')
     A            MON0100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PAGAM1F0                                  *
     *  DESCRIZIONE   : PAGAMENTI . WORK GENERATO DA STAMPA       *
     *  PREFISSO      : PAGAM1F0                                  *
     ****************************************************************
     A            FI7STX0        1          COLHDG('Stato ...........')
     *
     A            FI7USX0       10          COLHDG('Utente immissione')
     A            FI7DAX0        8S 0       COLHDG('Data immissione..')
     A            FI7ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI7USA0       10          COLHDG('Utente Variazione')
     A            FI7DAA0        8S 0       COLHDG('Data variazione..')
     A            FI7ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI7NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI7CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI7DTR0        8S 0       COLHDG('Data registraz...')
     A            FI7NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI7PRP0        4S 0       COLHDG('Num. proposta ...')
      *
     A            FI7DA10        8S 0       COLHDG('Data scad.inizio.')
     A            FI7DA20        8S 0       COLHDG('Data scad.fine ..')
     A            FI7SEQ0        4S 0       COLHDG('Sequenza  .......')
     A            FI7FOR0        6          COLHDG('Fornitore .......')
     A            FI7DTS0        8S 0       COLHDG('Data scadenza ...')
     A            FI7IMD0       18  6       COLHDG('Importo documento')
     A            FI7TID0        2          COLHDG('Tipo documento ..')
     A            FI7BLO0        1          COLHDG('Blocco ..........')
     A            FI7DTD0        8S 0       COLHDG('Data documento ..')
     A            FI7NUD0        6S 0       COLHDG('Num. documento ..')
     A            FI7ARI0        4S 0       COLHDG('Anno riferimento ')
     A            FI7NRI0        6S 0       COLHDG('Num. Riferimento.')
     A            FI7SLP0       18S 6       COLHDG('Saldo partita ...')
     A            FI7NOT0       25          COLHDG('Note ............')
     A            FI7IMR0       18S 6       COLHDG('Importo ritenuta.')
     A            FI7BON0       18S 6       COLHDG('Bonifico da eseg.')
      *
     A            FI70010        2          COLHDG('Checkbox ........')
     A            FI70020        2          COLHDG('Flag 02 .........')
     A            FI70030        2          COLHDG('Flag 03 .........')
     A            FI70040        2          COLHDG('Flag 04 .........')
     A            FI70050        2          COLHDG('Flag 05 .........')
     A            FI70060        2          COLHDG('Flag 06 .........')
     A            FI70070        2          COLHDG('Flag 07 .........')
     A            FI70080       10          COLHDG('Flag 08 .........')
     A            FI70090       10          COLHDG('Flag 09 .........')
     A            FI70100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PAGAM2F0                                  *
     *  DESCRIZIONE   : PAGAMENTI . WORK GENERATO DA STAMPA       *
     *                :             TESTATA NUMERO STAMPA GENERATA*
     *  PREFISSO      : PAGAM2F0                                  *
     ****************************************************************
     A            FI8STX0        1          COLHDG('Stato ...........')
     *
     A            FI8USX0       10          COLHDG('Utente immissione')
     A            FI8DAX0        8S 0       COLHDG('Data immissione..')
     A            FI8ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI8USA0       10          COLHDG('Utente Variazione')
     A            FI8DAA0        8S 0       COLHDG('Data variazione..')
     A            FI8ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI8NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI8CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI8DTR0        8S 0       COLHDG('Data registraz...')
     A            FI8NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI8NUP0        4S 0       COLHDG('Num. proposte ...')
     A            FI8DA10        8S 0       COLHDG('Data scad.inizio.')
     A            FI8DA20        8S 0       COLHDG('Data scad.fine ..')
      *
     A            FI80010        2          COLHDG('FLAG 01 .........')
     A            FI80020        2          COLHDG('Flag 02 .........')
     A            FI80030        2          COLHDG('Flag 03 .........')
     A            FI80040        2          COLHDG('Flag 04 .........')
     A            FI80050        2          COLHDG('Flag 05 .........')
     A            FI80060        2          COLHDG('Flag 06 .........')
     A            FI80070        2          COLHDG('Flag 07 .........')
     A            FI80080       10          COLHDG('Flag 08 .........')
     A            FI80090       10          COLHDG('Flag 09 .........')
     A            FI80100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PAGAM3F0                                  *
     *  DESCRIZIONE   : PAGAMENTI . WORK GENERATO DA STAMPA       *
     *                :             Testata di una proposta       *
     *  PREFISSO      : PAGAM3F0                                  *
     ****************************************************************
     A            FI9STX0        1          COLHDG('Stato ...........')
     *
     A            FI9USX0       10          COLHDG('Utente immissione')
     A            FI9DAX0        8S 0       COLHDG('Data immissione..')
     A            FI9ORX0        6S 0       COLHDG('Ora immissione...')
     A            FI9USA0       10          COLHDG('Utente Variazione')
     A            FI9DAA0        8S 0       COLHDG('Data variazione..')
     A            FI9ORA0        6S 0       COLHDG('Ora variazione...')
     A            FI9NRX0        9  0       COLHDG('Numero Azione ...')
     A            FI9CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FI9DTR0        8S 0       COLHDG('Data registraz...')
     A            FI9NUR0        9S 0       COLHDG('Num. registraz...')
     A            FI9PRP0        4S 0       COLHDG('Num. proposta ...')
     A            FI9BAN0        8          COLHDG('Banca ...........')
     A            FI9DTV0        8S 0       COLHDG('Data valuta Azi..')
     A            FI9DTF0        8S 0       COLHDG('Data valuta For..')
     A            FI9DTP0        8S 0       COLHDG('Data presentaz...')
     A            FI9DRE0        8S 0       COLHDG('Data registraz...')
     A            FI9IMP0       18S 6       COLHDG('Importo distinta.')
      *
     A            FI90010        2          COLHDG('SI = Contabilizz.')
     A            FI90020        2          COLHDG('Flag 02 .........')
     A            FI90030        2          COLHDG('Flag 03 .........')
     A            FI90040        2          COLHDG('Flag 04 .........')
     A            FI90050        2          COLHDG('Flag 05 .........')
     A            FI90060        2          COLHDG('Flag 06 .........')
     A            FI90070        2          COLHDG('Flag 07 .........')
     A            FI90080       10          COLHDG('Flag 08 .........')
     A            FI90090       10          COLHDG('Flag 09 .........')
     A            FI90100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PAGAM4F0                                  *
     *  DESCRIZIONE   : PAGAMENTI . PROPOSTA DI PAGAMENTO TESTATA *
     *  PREFISSO      : PAGAM4F0                                  *
     ****************************************************************
     A            FIASTX0        1          COLHDG('Stato ...........')
     *
     A            FIAUSX0       10          COLHDG('Utente immissione')
     A            FIADAX0        8S 0       COLHDG('Data immissione..')
     A            FIAORX0        6S 0       COLHDG('Ora immissione...')
     A            FIAUSA0       10          COLHDG('Utente Variazione')
     A            FIADAA0        8S 0       COLHDG('Data variazione..')
     A            FIAORA0        6S 0       COLHDG('Ora variazione...')
     A            FIANRX0        9  0       COLHDG('Numero Azione ...')
     A            FIACAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FIADTR0        8S 0       COLHDG('Data registraz...')
     A            FIANUR0        9S 0       COLHDG('Num. registraz...')
     A            FIAPRP0        9S 0       COLHDG('Num. proposta ...')
      *
     A            FIABAN0        8          COLHDG('Banca ...........')
     A            FIADTV0        8S 0       COLHDG('Data valuta Azi..')
     A            FIADTF0        8S 0       COLHDG('Data valuta For..')
     A            FIADTP0        8S 0       COLHDG('Data presentaz...')
     A            FIADRE0        8S 0       COLHDG('Data registraz...')
     A            FIAIMP0       18S 6       COLHDG('Importo distinta.')
      *
     A            FIA0010        2          COLHDG('SI = Contabilizz.')
     A            FIA0020        2          COLHDG('Flag 02 .........')
     A            FIA0030        2          COLHDG('Flag 03 .........')
     A            FIA0040        2          COLHDG('Flag 04 .........')
     A            FIA0050        2          COLHDG('Flag 05 .........')
     A            FIA0060        2          COLHDG('Flag 06 .........')
     A            FIA0070        2          COLHDG('Flag 07 .........')
     A            FIA0080       10          COLHDG('Flag 08 .........')
     A            FIA0090       10          COLHDG('Flag 09 .........')
     A            FIA0100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : PAGAM5F0                                  *
     *  DESCRIZIONE   : PAGAMENTI . DETTAGLIO                     *
     *  PREFISSO      : PAGAM5F0                                  *
     ****************************************************************
     A            FIBSTX0        1          COLHDG('Stato ...........')
     *
     A            FIBUSX0       10          COLHDG('Utente immissione')
     A            FIBDAX0        8S 0       COLHDG('Data immissione..')
     A            FIBORX0        6S 0       COLHDG('Ora immissione...')
     *
     A            FIBUSA0       10          COLHDG('Utente Variazione')
     A            FIBDAA0        8S 0       COLHDG('Data variazione..')
     A            FIBORA0        6S 0       COLHDG('Ora variazione...')
     *
     A            FIBNRX0        9  0       COLHDG('Numero Azione ...')
     A            FIBCAZ0        4          COLHDG('Codice Azione ...')
     *
     A            FIBDTR0        8S 0       COLHDG('Data registraz...')
     A            FIBNUR0        9S 0       COLHDG('Num. registraz...')
     A            FIBPRP0        9S 0       COLHDG('Num. proposta ...')
      *
     A            FIBSEQ0        4S 0       COLHDG('Sequenza  .......')
     A            FIBFOR0        6          COLHDG('Fornitore .......')
     A            FIBDTS0        8S 0       COLHDG('Data scadenza ...')
     A            FIBIMD0       18  6       COLHDG('Importo documento')
     A            FIBTID0        2          COLHDG('Tipo documento ..')
     A            FIBBLO0        1          COLHDG('Blocco ..........')
     A            FIBDTD0        8S 0       COLHDG('Data documento ..')
     A            FIBNUD0        6S 0       COLHDG('Num. documento ..')
     A            FIBARI0        4S 0       COLHDG('Anno riferimento ')
     A            FIBNRI0        6S 0       COLHDG('Num. Riferimento.')
     A            FIBSLP0       18S 6       COLHDG('Saldo partita ...')
     A            FIBNOT0       25          COLHDG('Note ............')
     A            FIBIMR0       18S 6       COLHDG('Importo ritenuta.')
     A            FIBBON0       18S 6       COLHDG('Bonifico da eseg.')
      *
     A            FIB0010        2          COLHDG('FLAG 01 .........')
     A            FIB0020        2          COLHDG('Flag 02 .........')
     A            FIB0030        2          COLHDG('Flag 03 .........')
     A            FIB0040        2          COLHDG('Flag 04 .........')
     A            FIB0050        2          COLHDG('Flag 05 .........')
     A            FIB0060        2          COLHDG('Flag 06 .........')
     A            FIB0070        2          COLHDG('Flag 07 .........')
     A            FIB0080       10          COLHDG('Flag 08 .........')
     A            FIB0090       10          COLHDG('Flag 09 .........')
     A            FIB0100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : DVCEBRF0                                  *
     *  DESCRIZIONE   : Archivio numeri DVCE Dreyfus per Brindisi *
     *  PREFISSO      : DVC                                       *
     ****************************************************************
     A            DVCSTX0        1          COLHDG('Stato ...........')
     *
     A            DVCUSX0       10          COLHDG('Utente immissione')
     A            DVCDAX0        8S 0       COLHDG('Data immissione..')
     A            DVCORX0        6S 0       COLHDG('Ora immissione...')
     A            DVCUSA0       10          COLHDG('Utente Variazione')
     A            DVCDAA0        8S 0       COLHDG('Data variazione..')
     A            DVCORA0        6S 0       COLHDG('Ora variazione...')
     A            DVCNRX0        9  0       COLHDG('Numero Azione ...')
     A            DVCCAZ0        4          COLHDG('Codice Azione ...')
     *
     A            DVCMAG0        3          COLHDG('Codice magazzino.')
     A            DVCNRI0        4S 0       COLHDG('Numero progressiv')
     A            DVCDES0       50          COLHDG('Riga descrittiva.')
     *
     A            DVCF010        1          COLHDG('Flag 01 .........')
     A            DVCF020        1          COLHDG('Flag 02 .........')
     A            DVCF030        2          COLHDG('Flag 03 .........')
     A            DVCF040        2          COLHDG('Flag 04 .........')
     A            DVCF050        2          COLHDG('Flag 05 .........')
     A            DVCF060        2          COLHDG('Flag 06 .........')
     A            DVCF070        3          COLHDG('Flag 07 .........')
     A            DVCF080       10          COLHDG('Flag 08 .........')
     A            DVCF090       10          COLHDG('Flag 09 .........')
     A            DVCF000       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : TABE43                                    *
     *  DESCRIZIONE   : Scaglioni importi magazzinaggio INDESIL   *
     *  PREFISSO      : T43                                       *
     ****************************************************************
     A            T43GGS0        3S 0       COLHDG('Giorni scaglione.')
     A            T43IMP0       18  6       COLHDG('Importo scaglione')
     A            T43FRA0        3S 0       COLHDG('Giorni franchigia')
     A            T43NOF0        2A         COLHDG('NO=no franchigia.')
     ****************************************************************
     *  TABELLA       : FORTS1F0                                  *
     *  DESCRIZIONE   : File aggiuntivo per computer di processo. *
     *  PREFISSO      : FTS                                       *
     ****************************************************************
     A            FTSUNI0        2          COLHDG('Unità ...........')
     A            FTSGRP0        2S 0       COLHDG('Gruppo ..........')
     A            FTSASS0        6          COLHDG('Assieme .........')
     A            FTSLIN0        1          COLHDG('Linea ...........')
     A            FTSVER0        5S 0       COLHDG('Versione ........')
     A            FTSNUF0       10S 0       COLHDG('Numero formula ..')
     A            FTSLID0        1          COLHDG('Linea di dosaggio')
     ****************************************************************
     *  TABELLA       : PROCOPF0                                  *
     *  DESCRIZIONE   : Produzione per computer di processo.      *
     *  PREFISSO      : PCP                                       *
     ****************************************************************
     A            PCPSTX0        1          COLHDG('Stato ...........')
     *
     A            PCPUSX0       10          COLHDG('Utente immissione')
     A            PCPDAX0        8S 0       COLHDG('Data immissione..')
     A            PCPORX0        6S 0       COLHDG('Ora immissione...')
     A            PCPUSA0       10          COLHDG('Utente Variazione')
     A            PCPDAA0        8S 0       COLHDG('Data variazione..')
     A            PCPORA0        6S 0       COLHDG('Ora variazione...')
     A            PCPNRX0        9  0       COLHDG('Numero Azione ...')
     A            PCPCAZ0        4          COLHDG('Codice Azione ...')
     *
     A            PCPSTB0        2          COLHDG('Codice stabilimen')
     A            PCPMAG0        3          COLHDG('Codice magazzino.')
     A            PCPNRI0        9  0       COLHDG('Numero immissione')
     A            PCPDAT0        8  0       COLHDG('Data   immissione')
     A            PCPPRO0       15          COLHDG('Codice prodotto..')
     A            PCPUNI0        2          COLHDG('Unità di misura..')
     A            PCPQTA0       18  6       COLHDG('Quantità da prod.')
     A            PCPQTP0       18  6       COLHDG('Quantità prodotta')
     A            PCPIMP0        3          COLHDG('Codice impianto..')
     A            PCPSIL0        6          COLHDG('Codice silos Sem.')
     A            PCPSIF0        6          COLHDG('Codice silos Fin.')
     A            PCPANN0        3          COLHDG('Codice annullam..')
     A            PCPNOT0       40          COLHDG('Nota ............')
     A            PCPSEQ0        4  0       COLHDG('Sequenza ........')
     A            PCPDAE0        8  0       COLHDG('Data prev.produz.')
     A            PCPORE0        6  0       COLHDG('Ora  prev.produz.')
     A            PCPDAP0        8  0       COLHDG('Data inizio prod.')
     A            PCPORP0        6  0       COLHDG('Ora  inizio prod.')
     A            PCPDAF0        8  0       COLHDG('Data fine prod...')
     A            PCPORF0        6  0       COLHDG('Ora  fine prod...')
     A            PCPRPR0        2          COLHDG('SI = record proc.')
     A            PCPLOT0       15          COLHDG('Lotto comp.proc..')
     *
     A            PCPF010        1          COLHDG('P=provvis.D=defin')
     A            PCPF020        1          COLHDG('Vers. Sacchi/Sfus')
      *                                     I=Versamento da pgm Sacchi.Insacco
      *                                     R=Versamento da pgm Sfuso.Rinfusa
     A            PCPF030        2          COLHDG('SI=passato a cub.')
     A            PCPF040        2          COLHDG('Lotto CH/AP .....')
     A            PCPF050        2          COLHDG('Flag 05 .........')
      *                                             '1 ' = ProPrvf0 trattato (Petrini)
     A            PCPF060        2          COLHDG('Flag 06 .........')
     A            PCPF070        3          COLHDG('Flag 07 .........')
      *                                           FIO=Prod. fatta su impianto dei fioccati
     A            PCPF080       10          COLHDG('Numero sess.Momam')
      *                                             Pos. 2-10 all.destra con zeri
     A            PCPF090       10          COLHDG('Num.Sess. da espl')
      *                                             Pos. 2-10 all.destra con zeri
      *                                             Solo Petrini
     A            PCPF100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA      : ANARIUF0                                   *
     *  DESCRIZIONE  : Utenti abilitati a richieste analisi chiuse*
     *  PREFISSO     : ANR                                        *
     ****************************************************************
     A            ANRSTX0        1          COLHDG('Stato ...........')
     *
     A            ANRUTE0       10          COLHDG('Utente ..........')
     A            ANRRIC0        3          COLHDG('Richiesta .......')
     ****************************************************************
     *  TABELLA       : IMPSILF0                                  *
     *  DESCRIZIONE   : Appartenenza silos ad impianti.           *
     *  PREFISSO      : AB3                                       *
     ****************************************************************
     A            AB3STX0        1          COLHDG('Stato ...........')
     *
     A            AB3USX0       10          COLHDG('Utente immissione')
     A            AB3DAX0        8S 0       COLHDG('Data immissione..')
     A            AB3ORX0        6S 0       COLHDG('Ora immissione...')
     A            AB3USA0       10          COLHDG('Utente Variazione')
     A            AB3DAA0        8S 0       COLHDG('Data variazione..')
     A            AB3ORA0        6S 0       COLHDG('Ora variazione...')
     A            AB3NRX0        9  0       COLHDG('Numero Azione ...')
     A            AB3CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            AB3STB0        2          COLHDG('Stabilimento ....')
     A            AB3MAG0        3          COLHDG('Magazzino .......')
     A            AB3IMP0        3          COLHDG('Impianto ........')
     A            AB3SIL0        6          COLHDG('Silos di appart..')
     *
     A            AB3F010        1          COLHDG('Flag 01 .........')
     A            AB3F020        1          COLHDG('Flag 02 .........')
     A            AB3F030        2          COLHDG('Flag 03 .........')
     A            AB3F040        2          COLHDG('Flag 04 .........')
     A            AB3F050        2          COLHDG('Flag 05 .........')
     A            AB3F060        2          COLHDG('Flag 06 .........')
     A            AB3F070        3          COLHDG('Flag 07 .........')
     A            AB3F080       10          COLHDG('Flag 08 .........')
     A            AB3F090       10          COLHDG('Flag 09 .........')
     A            AB3F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : SEQIMPF0                                  *
     *  DESCRIZIONE   : Sequenza impianti computer di processo.   *
     *  PREFISSO      : AB4                                       *
     ****************************************************************
     A            AB4STX0        1          COLHDG('Stato ...........')
     *
     A            AB4USX0       10          COLHDG('Utente immissione')
     A            AB4DAX0        8S 0       COLHDG('Data immissione..')
     A            AB4ORX0        6S 0       COLHDG('Ora immissione...')
     A            AB4USA0       10          COLHDG('Utente Variazione')
     A            AB4DAA0        8S 0       COLHDG('Data variazione..')
     A            AB4ORA0        6S 0       COLHDG('Ora variazione...')
     A            AB4NRX0        9  0       COLHDG('Numero Azione ...')
     A            AB4CAZ0        4          COLHDG('Codice Azione ...')
     *
     A            AB4STB0        2          COLHDG('Codice stabilim..')
     A            AB4MAG0        3          COLHDG('Codice magazzino.')
     A            AB4IMP0        3          COLHDG('Codice impianto..')
     A            AB4SEQ0        3  0       COLHDG('Sequenza ........')
     *
     A            AB4F010        1          COLHDG('Tipo elaborazione')
     *                                            1 - Da far vedere
     *                                            2 - Da non far vedere
     *                                            3 - Entrambi
     A            AB4F020        1          COLHDG('Flag 02 .........')
     A            AB4F030        2          COLHDG('Flag 03 .........')
     A            AB4F040        2          COLHDG('Flag 04 .........')
     A            AB4F050        2          COLHDG('Flag 05 .........')
     A            AB4F060        2          COLHDG('Flag 06 .........')
     A            AB4F070        3          COLHDG('Flag 07 .........')
     A            AB4F080       10          COLHDG('Flag 08 .........')
     A            AB4F090       10          COLHDG('Flag 09 .........')
     A            AB4F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  ARCHIVIO      : ORDF37F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Mediaz.su disp.annullate*
     *  PREFISSO      : AB5                                       *
     ****************************************************************
     A            AB5STX0        1          COLHDG('Stato ...........')
     A            AB5USX0       10          COLHDG('Utente immissione')
     A            AB5DAX0        8S 0       COLHDG('Data immissione .')
     A            AB5ORX0        6S 0       COLHDG('Ora immissione ..')
     A            AB5USA0       10          COLHDG('Utente aggiornam.')
     A            AB5DAA0        8S 0       COLHDG('Data aggiornam. .')
     A            AB5ORA0        6S 0       COLHDG('Ora aggiornam. ..')
     A            AB5CAZ0        4          COLHDG('Codice azione ...')
     A            AB5NRX0        9  0       COLHDG('Numero Azione ...')
     A            AB5SOC0        2          COLHDG('Società .........')
      *
     A            AB5SCO0        2S 0       COLHDG('Sec. ordine .....')
     A            AB5ANO0        2S 0       COLHDG('aa.  ordine .....')
     A            AB5MSO0        2S 0       COLHDG('mm.  ordine .....')
     A            AB5GRO0        2S 0       COLHDG('gg.  ordine .....')
     A            AB5SGO0        4          COLHDG('Sig. ordine .....')
     A            AB5NRO0        9S 0       COLHDG('nr.  ordine .....')
     A            AB5NRI0        4S 0       COLHDG('nr.  riga ordine.')
     A            AB5NRT0        4S 0       COLHDG('nr.  progressivo.')
      *
     A            AB5NRS0        9A         COLHDG('Numero sessione .')
     A            AB5NRM0        5  0       COLHDG('Numero movimento ')
     A            AB5ANC0        4S 0       COLHDG('Anno B.E.M. .....')
     A            AB5NUC0        9S 0       COLHDG('Num. B.E.M. .....')
     A            AB5DAC0        8S 0       COLHDG('Data B.E.M. .....')
     A            AB5QT10       12  3       COLHDG('Q.tà bolla ......')
     A            AB5CAU0        2          COLHDG('Causale mediaz. .')
     A            AB5PR10       18  6       COLHDG('Prezzo unit.al kg')
     A            AB5MDV0        6          COLHDG('Mediatore........')
     A            AB5PRM0       18  6       COLHDG('Provvigioni in E.')
     A            AB5PRP0        8  5       COLHDG('% provvigioni....')
     A            AB5DAI0        8S 0       COLHDG('Data documento. .')
      *
     A            AB5F010        1          COLHDG('Flag 01 .........')
     A            AB5F020        1          COLHDG('Flag 02 .........')
     A            AB5F030        2          COLHDG('Flag 03 .........')
     A            AB5F040        2          COLHDG('Flag 04 .........')
     A            AB5F050        1          COLHDG('1. Ordini per ser')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            AB5F060       10          COLHDG('Flag 06 .........')
     A            AB5F070        2          COLHDG('Flag 07 .........')
     A            AB5F080        2          COLHDG('Flag 08 .........')
     A            AB5F090        2          COLHDG('Flag 09 .........')
     A            AB5F100        2          COLHDG('Flag 10 .........')
     ****************************************************************
     *  ARCHIVIO      : DEPOSTF0                                  *
     *  DESCRIZIONE   : Depositi per stampa fattura.              *
     *  PREFISSO      : AB6                                       *
     ****************************************************************
     A            AB6STX0        1          COLHDG('Stato ...........')
     A            AB6MAG0        3          COLHDG('Codice magazzino.')
     A            AB6RIG0        4  0       COLHDG('Numero riga......')
     A            AB6DES0       45          COLHDG('Descrizione......')
     ****************************************************************
     *  TABELLA       : ANAUS2F0                                  *
     *  DESCRIZIONE   : Anagrafico Utenti Aggiuntivo x autorizzaz.*
     *  PREFISSO      : AB7                                       *
     ****************************************************************
     A            AB7STX0        1          COLHDG('Stato ...........')
     A            AB7USE0       10          COLHDG('Utente immissione')
     A            AB7DAE0        8S 0       COLHDG('Data immissione .')
     A            AB7ORE0        6S 0       COLHDG('Ora immissione...')
     A            AB7USA0       10          COLHDG('Utente aggiornam.')
     A            AB7DAA0        8S 0       COLHDG('Data aggiornam...')
     A            AB7ORA0        6S 0       COLHDG('Ora aggiornam....')
     A            AB7NRX0        9  0       COLHDG('Numero Azione ...')
     A            AB7CAZ0        4          COLHDG('Codice azione....')
      *
     A            AB7UTE0       10          COLHDG('Utente AS/400....')
     A            AB7NOM0       40          COLHDG('Utente in rete...')
      *
     A            AB7U010       30          COLHDG('Utente 01........')
     A            AB7P010       20          COLHDG('Pwd 01...........')
     A            AB7D010       50          COLHDG('Descrizione 01...')
     A            AB7U020       30          COLHDG('Utente 02........')
     A            AB7P020       20          COLHDG('Pwd 02...........')
     A            AB7D020       50          COLHDG('Descrizione 02...')
     A            AB7U030       30          COLHDG('Utente 03........')
     A            AB7P030       20          COLHDG('Pwd 03...........')
     A            AB7D030       50          COLHDG('Descrizione 03...')
     A            AB7U040       30          COLHDG('Utente 04........')
     A            AB7P040       20          COLHDG('Pwd 04...........')
     A            AB7D040       50          COLHDG('Descrizione 04...')
     A            AB7U050       30          COLHDG('Utente 05........')
     A            AB7P050       20          COLHDG('Pwd 05...........')
     A            AB7D050       50          COLHDG('Descrizione 05...')
     A            AB7U060       30          COLHDG('Utente 06........')
     A            AB7P060       20          COLHDG('Pwd 06...........')
     A            AB7D060       50          COLHDG('Descrizione 06...')
     A            AB7U070       30          COLHDG('Utente 07........')
     A            AB7P070       20          COLHDG('Pwd 07...........')
     A            AB7D070       50          COLHDG('Descrizione 07...')
      *
     A            AB7F010        2          COLHDG('Dif.mod.continuo.')
      *                                     'SI'= Diff./NC su Mod.Continuo
     A            AB7F020        2          COLHDG('Mod.dati su CR013')
      *                                     'SI'= Consente di modificare le quantità su CR0013.
     A            AB7F030        2          COLHDG('Marchio MG/PE....')
     A            AB7F040        2          COLHDG('SI=Gest.Cnt.Trasp')
      *                                     Manut.pgm TRA110
     A            AB7F050        2          COLHDG('Flag 05 .........')
     A            AB7F060        2          COLHDG('Flag 06 .........')
     A            AB7F070        2          COLHDG('Flag 07 .........')
     A            AB7F080       10          COLHDG('Codice fornitore.')
     A            AB7F090       10          COLHDG('Flag 09 .........')
     A            AB7F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : STFAC8F0                                  *
     *  DESCRIZIONE   : FATTURATO RETE VENDITA  PER LINEA/MESE    *
     *  PREFISSO      : AT - PROGMESE -                           *
     ****************************************************************
     A            ATANN0         4S 0       COLHDG('Anno ............')
     A            ATMES0         2S 0       COLHDG('Mese ............')
     A            ATGIO0         2S 0       COLHDG('Giorno ..........')
     A            ATPAS0         2S 0       COLHDG('Passo ...........')
      *
     A            ATSEZ0         3          COLHDG('Sezione .........')
     A            ATDIS0         3          COLHDG('Distretto .......')
     A            ATAGE0         3          COLHDG('Agente ..........')
     A            ATLIN0         3          COLHDG('Linea  ..........')
     A            ATRAG0         3          COLHDG('Raggruppamento ..')
     A            ATQVE0         7S 0       COLHDG('Q.tà Vendite     ')
     A            ATLIR0        13S 2       COLHDG('Euro Vendite     ')
     A            ATQRE0         7S 0       COLHDG('Q.tà Resi        ')
     A            ATLRR0        13S 2       COLHDG('Euro Resi        ')
     A            ATQVT0         7S 0       COLHDG('Q.tà Totale      ')
     A            ATQV01         7S 0       COLHDG('Q.tà Corr Gen    ')
     A            ATQV02         7S 0       COLHDG('Q.tà Corr Feb    ')
     A            ATQV03         7S 0       COLHDG('Q.tà Corr Mar    ')
     A            ATQV04         7S 0       COLHDG('Q.tà Corr Apr    ')
     A            ATQV05         7S 0       COLHDG('Q.tà Corr Mag    ')
     A            ATQV06         7S 0       COLHDG('Q.tà Corr Giu    ')
     A            ATQV07         7S 0       COLHDG('Q.tà Corr Lug    ')
     A            ATQV08         7S 0       COLHDG('Q.tà Corr Ago    ')
     A            ATQV09         7S 0       COLHDG('Q.tà Corr Set    ')
     A            ATQV10         7S 0       COLHDG('Q.tà Corr Ott    ')
     A            ATQV11         7S 0       COLHDG('Q.tà Corr Nov    ')
     A            ATQV12         7S 0       COLHDG('Q.tà Corr Dic    ')
     A            ATLIT0        13S 2       COLHDG('Euro Totale      ')
     A            ATQBU0         7S 0       COLHDG('Q.tà Budget      ')
     A            ATQB01         7S 0       COLHDG('Q.tà Budg Gen    ')
     A            ATQB02         7S 0       COLHDG('Q.tà Budg Feb    ')
     A            ATQB03         7S 0       COLHDG('Q.tà Budg Mar    ')
     A            ATQB04         7S 0       COLHDG('Q.tà Budg Apr    ')
     A            ATQB05         7S 0       COLHDG('Q.tà Budg Mag    ')
     A            ATQB06         7S 0       COLHDG('Q.tà Budg Giu    ')
     A            ATQB07         7S 0       COLHDG('Q.tà Budg Lug    ')
     A            ATQB08         7S 0       COLHDG('Q.tà Budg Ago    ')
     A            ATQB09         7S 0       COLHDG('Q.tà Budg Set    ')
     A            ATQB10         7S 0       COLHDG('Q.tà Budg Ott    ')
     A            ATQB11         7S 0       COLHDG('Q.tà Budg Nov    ')
     A            ATQB12         7S 0       COLHDG('Q.tà Budg Dic    ')
     A            ATLIB0        13S 2       COLHDG('Euro Budget      ')
     A            ATQPR0         7S 0       COLHDG('Q.tà Totale Prec ')
     A            ATQP01         7S 0       COLHDG('Q.tà Prec Gen    ')
     A            ATQP02         7S 0       COLHDG('Q.tà Prec Feb    ')
     A            ATQP03         7S 0       COLHDG('Q.tà Prec Mar    ')
     A            ATQP04         7S 0       COLHDG('Q.tà Prec Apr    ')
     A            ATQP05         7S 0       COLHDG('Q.tà Prec Mag    ')
     A            ATQP06         7S 0       COLHDG('Q.tà Prec Giu    ')
     A            ATQP07         7S 0       COLHDG('Q.tà Prec Lug    ')
     A            ATQP08         7S 0       COLHDG('Q.tà Prec Ago    ')
     A            ATQP09         7S 0       COLHDG('Q.tà Prec Set    ')
     A            ATQP10         7S 0       COLHDG('Q.tà Prec Ott    ')
     A            ATQP11         7S 0       COLHDG('Q.tà Prec Nov    ')
     A            ATQP12         7S 0       COLHDG('Q.tà Prec Dic    ')
     A            ATLPR0        13S 2       COLHDG('Euro Totale Prec ')
     ****************************************************************
     *  TABELLA       : OPEADDF0                                  *
     *  DESCRIZIONE   : Operatori addetti a mansioni.             *
     *  PREFISSO      : AB8                                       *
     ****************************************************************
     A            AB8STX0        1          COLHDG('Stato ...........')
     A            AB8USE0       10          COLHDG('Immissione Utente')
     A            AB8DAE0        8S 0       COLHDG('Immissione Data..')
     A            AB8ORE0        6S 0       COLHDG('Immissione Ora...')
     A            AB8PGE0       10          COLHDG('Immissione Pgm...')
     A            AB8CAE0        4          COLHDG('Immissione Azione')
     A            AB8USA0       10          COLHDG('Aggiorname.Utente')
     A            AB8DAA0        8S 0       COLHDG('Aggiorname.Data..')
     A            AB8ORA0        6S 0       COLHDG('Aggiorname.Ora...')
     A            AB8PGA0       10          COLHDG('Aggiorname.Pgm...')
     A            AB8CAZ0        4          COLHDG('Aggiorname.Azione')
      *
     A            AB8STB0        3          COLHDG('Stabilimento ....')
     A            AB8MAG0        3          COLHDG('Magazzino .......')
     A            AB8CAU0        3          COLHDG('Causale .........')
     *                                             VEP = Versamenti produzione
     *                                             PRE = Addetti al carico      (ALLCARF0)
     *                                             ALL = Allestimento automezzi (ALLCARF0)
     A            AB8COD0        5          COLHDG('Matricola dipend.')
     A            AB8NUM0        9  0       COLHDG('Numeratore progr.')
     A            AB8DAI0        8  0       COLHDG('Data inizio .....')
     A            AB8DAF0        8  0       COLHDG('Data fine .......')
     A            AB8NO10       40          COLHDG('Nota manuale 1 ..')
     A            AB8NO20       40          COLHDG('Nota manuale 2 ..')
     A            AB8IMP0        3          COLHDG('Eventuale impian.')
     A            AB8OTD0        4  0       COLHDG('Ora turno da H:M.')
     A            AB8OTA0        4  0       COLHDG('Ora turno a  H:M.')
      *
     A            AB8F010        2          COLHDG('Flag 01 .........')
     A            AB8F020        2          COLHDG('Flag 02 .........')
     A            AB8F030        2          COLHDG('Flag 03 .........')
     A            AB8F040        2          COLHDG('Flag 04 .........')
     A            AB8F050        2          COLHDG('Flag 05 .........')
     A            AB8F060        2          COLHDG('Flag 06 .........')
     A            AB8F070        2          COLHDG('Flag 07 .........')
     A            AB8F080       10          COLHDG('Flag 08 .........')
     A            AB8F090       10          COLHDG('Flag 09 .........')
     A            AB8F100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : MANADDF0                                  *
     *  DESCRIZIONE   : Incarico mansioni ad operatori.           *
     *  PREFISSO      : AB9                                       *
     ****************************************************************
     A            AB9STX0        1          COLHDG('Stato ..............')
     A            AB9USE0       10          COLHDG('Immissione Utente...')
     A            AB9DAE0        8  0       COLHDG('Immissione Data ....')
     A            AB9ORE0        6  0       COLHDG('Immissione Ora......')
     A            AB9PGE0       10          COLHDG('Immissione Programma')
     A            AB9CAE0        4          COLHDG('Immissione Azione...')
     A            AB9USA0       10          COLHDG('Aggiornamento Utente')
     A            AB9DAA0        8  0       COLHDG('Aggiornamento Data..')
     A            AB9ORA0        6  0       COLHDG('Aggiornamento Ora...')
     A            AB9PGA0       10          COLHDG('Aggiornamento Progr.')
     A            AB9CAZ0        4          COLHDG('Aggiornamento Azione')
      *
     A            AB9STB0        3          COLHDG('Stabilimento .......')
     A            AB9MAG0        3          COLHDG('Magazzino ..........')
     A            AB9RIP0        9  0       COLHDG('Identif. Pallet.....')
     A            AB9NUP0        7  0       COLHDG('Nume.ordi.produz....')
     A            AB9COD0        5          COLHDG('Matricola dipend....')
     A            AB9DAT0        8  0       COLHDG('Data prevista op....')
     A            AB9QTP0        4  0       COLHDG('Q.pallet previsti...')
     A            AB9QTE0        4  0       COLHDG('Q.pallet effetti....')
     A            AB9PRO0       15          COLHDG('Codice prodotto ....')
     A            AB9IMP0        3          COLHDG('Codice impianto ....')
     A            AB9NUR0        9  0       COLHDG('Rif.OPEADDF0 .......')
     A            AB9UBI0        4          COLHDG('Ubicazione prod.....')
     A            AB9DIP0        8  0       COLHDG('Data inizio oper....')
     A            AB9OIP0        6  0       COLHDG('Ora  inizio oper....')
     A            AB9DFP0        8  0       COLHDG('Data fine   oper....')
     A            AB9OFP0        6  0       COLHDG('Ora  fine   oper....')
     A            AB9CHI0        1          COLHDG('C = Eseguito .......')
     A            AB9NRS0        9  0       COLHDG('Numero sess.MOMAM...')
     A            AB9NRM0        4  0       COLHDG('Numero movi.MOMAM...')
     A            AB9COL0        4  0       COLHDG('Numero colli .......')
     A            AB9PEU0        7  2       COLHDG('Peso unitario prod..')
     A            AB9NPR0        7  0       COLHDG('Numero produzione...')
      *
     A            AB9F010        2          COLHDG('Tipo movimento .....')
     A            AB9F020        2          COLHDG('Flag 02 ............')
     A            AB9F030        2          COLHDG('Flag 03 ............')
     A            AB9F040        2          COLHDG('Flag 04 ............')
     A            AB9F050        2          COLHDG('Flag 05 ............')
     A            AB9F060        2          COLHDG('Flag 06 ............')
     A            AB9F070        2          COLHDG('Flag 07 ............')
     A            AB9F080       10          COLHDG('Flag 08 ............')
     A            AB9F090       10          COLHDG('Flag 09 ............')
     A            AB9F100       10          COLHDG('Flag 10 ............')
      ****************************************************************
      *   TABELLA       : STFAC0F0                                   *
      *   DESCRIZIONE   : CONTRIBUZIONE DISTRETTI MESE/PROGR         *
      *   PREFISSO      : IM                                         *
      ****************************************************************
     A            IMSTX0         1          COLHDG('Stato ...........')
     A            IMUSE0        10          COLHDG('Utente ..........')
     A            IMSCX0         2S 0       COLHDG('Sec. variazione .')
     A            IMANX0         2S 0       COLHDG('aa.  variazione .')
     A            IMMSX0         2S 0       COLHDG('mm.  variazione .')
     A            IMGRX0         2S 0       COLHDG('gg.  variazione .')
     A            IMORX0         6S 0       COLHDG('Ora agg.to ......')
     A            IMNRX0         9  0       COLHDG('Numero Azione ...')
      *
     A            IMSEZ0         3          COLHDG('Sezione .........')
     A            IMDES0        20          COLHDG('Descriz.Spediz...')
     A            IMDIS0         3          COLHDG('Distretto........')
      *
     A            IMQBU0         7S 0       COLHDG('Q.tà Budget  Mese')
     A            IMQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            IMQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            IMQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            IMQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            IMEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            IMEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            IMEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            IMEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            IMEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            IMCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            IMCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            IMCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            IMCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            IMCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
      *
     A            IPQBU0         7S 0       COLHDG('Q.tà Budget Progr')
     A            IPQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            IPQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            IPQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            IPQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            IPEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            IPEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            IPEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            IPEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            IPEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            IPCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            IPCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            IPCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            IPCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            IPCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
      ****************************************************************
      ****************************************************************
      *   TABELLA       : STFAC7F0                                   *
      *   DESCRIZIONE   : CONTRIBUZIONE DISTRETTI LINEA MESE/PROGR   *
      *   PREFISSO      : CM                                         *
      ****************************************************************
     A            CMSTX0         1          COLHDG('Stato ...........')
     A            CMUSE0        10          COLHDG('Utente ..........')
     A            CMSCX0         2S 0       COLHDG('Sec. variazione .')
     A            CMANX0         2S 0       COLHDG('aa.  variazione .')
     A            CMMSX0         2S 0       COLHDG('mm.  variazione .')
     A            CMGRX0         2S 0       COLHDG('gg.  variazione .')
     A            CMORX0         6S 0       COLHDG('Ora agg.to ......')
     A            CMNRX0         9  0       COLHDG('Numero Azione ...')
      *
     A            CMSEZ0         3          COLHDG('Sezione .........')
     A            CMDES0        20          COLHDG('Descriz.Spediz...')
     A            CMDIS0         3          COLHDG('Distretto........')
     A            CMLIN0         3          COLHDG('Linea ...........')
     A            CMRAG0         3          COLHDG('Raggruppamento...')
      *
     A            CMQBU0         7S 0       COLHDG('Q.tà Budget  Mese')
     A            CMQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            CMQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            CMQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            CMQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            CMEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            CMEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            CMEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            CMEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            CMEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            CMCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            CMCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            CMCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            CMCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            CMCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
      *
     A            CPQBU0         7S 0       COLHDG('Q.tà Budget Progr')
     A            CPQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            CPQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            CPQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            CPQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            CPEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            CPEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            CPEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            CPEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            CPEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            CPCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            CPCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            CPCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            CPCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            CPCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
      ****************************************************************
      *   TABELLA       : STFAC9F0                                   *
      *   DESCRIZIONE   : CONTRIBUZIONE DISTRETTI/MER/LIN/MESE/PROGR *
      *   PREFISSO      : MM                                         *
      ****************************************************************
     A            MMSTX0         1          COLHDG('Stato ...........')
     A            MMUSE0        10          COLHDG('Utente ..........')
     A            MMSCX0         2S 0       COLHDG('Sec. variazione .')
     A            MMANX0         2S 0       COLHDG('aa.  variazione .')
     A            MMMSX0         2S 0       COLHDG('mm.  variazione .')
     A            MMGRX0         2S 0       COLHDG('gg.  variazione .')
     A            MMORX0         6S 0       COLHDG('Ora agg.to ......')
     A            MMNRX0         9  0       COLHDG('Numero Azione ...')
      *
     A            MMSEZ0         3          COLHDG('Sezione .........')
     A            MMDES0        20          COLHDG('Descriz.Spediz...')
     A            MMDIS0         3          COLHDG('Distretto........')
     A            MMMER0         3          COLHDG('Mercato..........')
     A            MMMDE0        20          COLHDG('Descriz.Mercato..')
     A            MMLIN0         3          COLHDG('Linea ...........')
     A            MMRAG0         3          COLHDG('Raggruppamento...')
      *
     A            MMQBU0         7S 0       COLHDG('Q.tà Budget  Mese')
     A            MMQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            MMQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            MMQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            MMQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            MMEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            MMEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            MMEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            MMEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            MMEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            MMCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            MMCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            MMCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            MMCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            MMCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
      *
     A            MPQBU0         7S 0       COLHDG('Q.tà Budget Progr')
     A            MPQVC0         7S 0       COLHDG('Q.tà Vendite Corr')
     A            MPQVP0         7S 0       COLHDG('Q.tà Vendite Prec')
     A            MPQDB0         7S 0       COLHDG('Q.tà Scostam.Bud ')
     A            MPQDP0         7S 0       COLHDG('Q.tà Scostam.Prec')
     A            MPEUB0        11S 0       COLHDG('Contrib.Euro Bud ')
     A            MPEUC0        11S 0       COLHDG('Contrib.Euro Corr')
     A            MPEUP0        11S 0       COLHDG('Contrib.Euro Prec')
     A            MPEDB0        11S 0       COLHDG('Euro Scostam.Bud ')
     A            MPEDP0        11S 0       COLHDG('Euro Scostam.Prec')
     A            MPCOB0         7S 2       COLHDG('Contrib.E/Qle Bud')
     A            MPCOC0         7S 2       COLHDG('Contrib.E/Qle Cor')
     A            MPCOP0         7S 2       COLHDG('Contrib.E/Qle Pre')
     A            MPCDB0         7S 2       COLHDG('Contr.Scostam.Bud')
     A            MPCDP0         7S 2       COLHDG('Contr.Scostam.Pre')
     ****************************************************************
     *  TABELLA       : IDEPALF0                                  *
     *  DESCRIZIONE   : Identificativo pallet testata.            *
     *  PREFISSO      : AC1                                       *
     ****************************************************************
     A            AC1STX0        1          COLHDG('Stato ..............')
     A            AC1USE0       10          COLHDG('Immissione Utente ..')
     A            AC1DAE0        8  0       COLHDG('Immissione Data ....')
     A            AC1ORE0        6  0       COLHDG('Immissione Ora .....')
     A            AC1PGE0       10          COLHDG('Immissione Programma')
     A            AC1CAE0        4          COLHDG('Immissione Azione ..')
     A            AC1USA0       10          COLHDG('Aggiorname.Utente ..')
     A            AC1DAA0        8  0       COLHDG('Aggiorname.Data ....')
     A            AC1ORA0        6  0       COLHDG('Aggiorname.Ora .....')
     A            AC1PGA0       10          COLHDG('Aggiorname.Programma')
     A            AC1CAZ0        4          COLHDG('Aggiorname.Azione ..')
     A            AC1PGC0       10          COLHDG('Programma chiamante.')
      *
     A            AC1STB0        3          COLHDG('Stabilimento .......')
     A            AC1MAG0        3          COLHDG('Magazzino ..........')
     A            AC1RIP0        9  0       COLHDG('Identif. Pallet.....')
     A            AC1PIN0       18  6       COLHDG('Ps.net.teor.ini noPL')
     A            AC1PES0       18  6       COLHDG('Ps.net.teor. no PL..')
     A            AC1PLR0       18  6       COLHDG('Ps.lordo riscon.+ PL')
     A            AC1PLD0       18  6       COLHDG('Peso differenza.....')
     A            AC1PAP0       18  6       COLHDG('Ps.lordo teor. no PL')
     A            AC1NCO0        4  0       COLHDG('Numero tot.colli....')
     A            AC1NLO0        9  0       COLHDG('Numero lotto interno')
     A            AC1DAP0        8  0       COLHDG('Data   lotto interno')
     A            AC1NUP0        7  0       COLHDG('Numero interno prod.')
     A            AC1CHI0        2          COLHDG('SI = pallet finito..')
     A            AC1TIP0        2          COLHDG('PL=pallet EP=europal')
      *
     A            AC1F010        2          COLHDG('Occupato ...........')
     A            AC1F020        2          COLHDG('Caus.rist.etic.Car..')
     A            AC1F030        2          COLHDG('SC=pallet su saccone')
     A            AC1F040        2          COLHDG('Flag 04 ............')
     A            AC1F050        2          COLHDG('Flag 05 ............')
     A            AC1F060        2          COLHDG('Flag 06 ............')
     A            AC1F070        2          COLHDG('Flag 07 ............')
     A            AC1F080       10          COLHDG('Flag 08 ............')
     A            AC1F090       10          COLHDG('Flag 09 ............')
     A            AC1F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  TABELLA       : IDEPADF0                                  *
     *  DESCRIZIONE   : Identificativo pallet dettaglio.          *
     *  PREFISSO      : AC2                                       *
     ****************************************************************
     A            AC2STX0        1          COLHDG('Stato ..............')
     A            AC2USE0       10          COLHDG('Immissione Utente ..')
     A            AC2DAE0        8  0       COLHDG('Immissione Data ....')
     A            AC2ORE0        6  0       COLHDG('Immissione Ora .....')
     A            AC2PGE0       10          COLHDG('Immissione Programma')
     A            AC2CAE0        4          COLHDG('Immissione Azione ..')
     A            AC2USA0       10          COLHDG('Aggiorname.Utente ..')
     A            AC2DAA0        8  0       COLHDG('Aggiorname.Data ....')
     A            AC2ORA0        6  0       COLHDG('Aggiorname.Ora .....')
     A            AC2PGA0       10          COLHDG('Aggiorname.Programma')
     A            AC2CAZ0        4          COLHDG('Aggiorname.Azione ..')
      *
     A            AC2RIP0        9  0       COLHDG('Identif. Pallet.....')
     A            AC2NRI0        4  0       COLHDG('Riga dettaglio......')
     A            AC2PRO0       15          COLHDG('Codice prodotto ....')
     A            AC2UNM0        2          COLHDG('Unità di misura ....')
     A            AC2PES0       18  6       COLHDG('Peso prodotto ......')
     A            AC2NCO0        4  0       COLHDG('Numero di colli.....')
     A            AC2IMP0        3          COLHDG('Impianto produz.....')
     A            AC2NLO0        9  0       COLHDG('Numero lotto interno')
     A            AC2DAP0        8  0       COLHDG('Data   lotto interno')
     A            AC2DAS0        8  0       COLHDG('Data   scadenza.....')
      *
     A            AC2F010        2          COLHDG('Flag 01 ............')
     A            AC2F020        2          COLHDG('Flag 02 ............')
     A            AC2F030        2          COLHDG('Flag 03 ............')
     A            AC2F040        2          COLHDG('Flag 04 ............')
     A            AC2F050        2          COLHDG('Flag 05 ............')
     A            AC2F060        2          COLHDG('Flag 06 ............')
     A            AC2F070        2          COLHDG('Flag 07 ............')
     A            AC2F080       10          COLHDG('Progr.chiamante.....')
     A            AC2F090       10          COLHDG('Num.Ord.Prod........')
     A            AC2F100       10          COLHDG('Nr Sigillo saccone .')
     ****************************************************************
     *  TABELLA       : TRCLT1F0                                  *
     *  DESCRIZIONE   : Tracciabilità lotti: Testata lotto produz.*
     *  PREFISSO      : RT1                                       *
     ****************************************************************
     A            RT1STX0        1          COLHDG('Stato ...........')
     A            RT1USE0       10          COLHDG('Utente immissione')
     A            RT1DAE0        8S 0       COLHDG('Data immissione .')
     A            RT1ORE0        6S 0       COLHDG('Ora immissione...')
     A            RT1USA0       10          COLHDG('Utente aggiornam.')
     A            RT1DAA0        8S 0       COLHDG('Data aggiornam...')
     A            RT1ORA0        6S 0       COLHDG('Ora aggiornam....')
     A            RT1NRX0        9  0       COLHDG('Numero Azione ...')
     A            RT1CAZ0        4          COLHDG('Codice azione....')
     *
     A            RT1LOT0        7S 0       COLHDG('Identif. lotto ..')
     A            RT1PRD0       15          COLHDG('Prodotto ........')
     A            RT1DTP0        8  0       COLHDG('Data Produzione .')
     A            RT1DTS0        8  0       COLHDG('Data scadenza ...')
     A            RT1QTA0       18  6       COLHDG('Q.tà prodotta ...')
     *
     A            RT1F010        2          COLHDG('Flag 01  ........')
     A            RT1F020        2          COLHDG('Flag 02  ........')
     A            RT1F030        2          COLHDG('Flag 03  ........')
     A            RT1F040        2          COLHDG('Flag 04  ........')
     A            RT1F050        2          COLHDG('Flag 05  ........')
     A            RT1F060        2          COLHDG('Flag 06  ........')
     A            RT1F070        2          COLHDG('Flag 07  ........')
     A            RT1F080        2          COLHDG('Flag 08  ........')
     A            RT1F090        2          COLHDG('Flag 09  ........')
     A            RT1F100        2          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : TRCLT2F0                                  *
     *  DESCRIZIONE   : Tracciabilità lotti: Righe lotto produzione*
     *  PREFISSO      : RT2                                       *
     ****************************************************************
     A            RT2STX0        1          COLHDG('Stato ...........')
     A            RT2USE0       10          COLHDG('Utente immissione')
     A            RT2DAE0        8S 0       COLHDG('Data immissione .')
     A            RT2ORE0        6S 0       COLHDG('Ora immissione...')
     A            RT2USA0       10          COLHDG('Utente aggiornam.')
     A            RT2DAA0        8S 0       COLHDG('Data aggiornam...')
     A            RT2ORA0        6S 0       COLHDG('Ora aggiornam....')
     A            RT2NRX0        9  0       COLHDG('Numero Azione ...')
     A            RT2CAZ0        4          COLHDG('Codice azione....')
     *
     A            RT2LOT0        7S 0       COLHDG('Identif. lotto ..')
     A            RT2PRD0       15          COLHDG('Prodotto ........')
     A            RT2NRI0        4  0       COLHDG('Numero riga .....')
     A            RT2COM0       15          COLHDG('Componente ......')
     A            RT2DTB0        8  0       COLHDG('Data bolla ......')
     A            RT2SGB0        4          COLHDG('Sigla bolla .....')
     A            RT2NRB0        6          COLHDG('Numero bolla ....')
     A            RT2FOR0        6          COLHDG('Fornitore .......')
     *
     A            RT2F010        2          COLHDG('Flag 01  ........')
     A            RT2F020        2          COLHDG('Flag 02  ........')
     A            RT2F030        2          COLHDG('Flag 03  ........')
     A            RT2F040        2          COLHDG('Flag 04  ........')
     A            RT2F050        2          COLHDG('Flag 05  ........')
     A            RT2F060        2          COLHDG('Flag 06  ........')
     A            RT2F070        2          COLHDG('Flag 07  ........')
     A            RT2F080        2          COLHDG('Flag 08  ........')
     A            RT2F090        2          COLHDG('Flag 09  ........')
     A            RT2F100        2          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : TRCLT3F0                                  *
     *  DESCRIZIONE   : Tracciabilità lotti: Evasione to produzione*
     *  PREFISSO      : RT3                                       *
     ****************************************************************
     A            RT3STX0        1          COLHDG('Stato ...........')
     A            RT3USE0       10          COLHDG('Utente immissione')
     A            RT3DAE0        8S 0       COLHDG('Data immissione .')
     A            RT3ORE0        6S 0       COLHDG('Ora immissione...')
     A            RT3USA0       10          COLHDG('Utente aggiornam.')
     A            RT3DAA0        8S 0       COLHDG('Data aggiornam...')
     A            RT3ORA0        6S 0       COLHDG('Ora aggiornam....')
     A            RT3NRX0        9  0       COLHDG('Numero Azione ...')
     A            RT3CAZ0        4          COLHDG('Codice azione....')
     *
     A            RT3LOT0        7S 0       COLHDG('Identif. lotto ..')
     A            RT3PRD0       15          COLHDG('Prodotto ........')
     A            RT3NRI0        4  0       COLHDG('Numero riga .....')
     A            RT3COM0       15          COLHDG('Componente ......')
     A            RT3DTB0        8  0       COLHDG('Data bolla ......')
     A            RT3SGB0        4          COLHDG('Sigla bolla .....')
     A            RT3NRB0        6          COLHDG('Numero bolla ....')
     A            RT3FOR0        6          COLHDG('Fornitore .......')
     A            RT3QTA0       18  6       COLHDG('Q.tà prodotta ...')
     *
     A            RT3F010        2          COLHDG('Flag 01  ........')
     A            RT3F020        2          COLHDG('Flag 02  ........')
     A            RT3F030        2          COLHDG('Flag 03  ........')
     A            RT3F040        2          COLHDG('Flag 04  ........')
     A            RT3F050        2          COLHDG('Flag 05  ........')
     A            RT3F060        2          COLHDG('Flag 06  ........')
     A            RT3F070        2          COLHDG('Flag 07  ........')
     A            RT3F080        2          COLHDG('Flag 08  ........')
     A            RT3F090        2          COLHDG('Flag 09  ........')
     A            RT3F100        2          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : MONRSTF0                                  *
     *  DESCRIZIONE   : Monitoraggio ristampa documenti.          *
     *  PREFISSO      : AC3                                       *
     ****************************************************************
     A            AC3STX0        1          COLHDG('Stato ...........')
     A            AC3USE0       10          COLHDG('Utente immissione')
     A            AC3DAE0        8S 0       COLHDG('Data immissione .')
     A            AC3ORE0        6S 0       COLHDG('Ora immissione...')
     A            AC3NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC3CAZ0        4          COLHDG('Codice azione....')
     A            AC3TER0       10          COLHDG('Codice terminale.')
     A            AC3PRG0       10          COLHDG('Nome programma...')
     A            AC3DAD0        8S 0       COLHDG('Data documento...')
     A            AC3NUD0        6S 0       COLHDG('Num. documento...')
     A            AC3TIF0        1          COLHDG('Tipo fatturazione')
     A            AC3CAD0        2          COLHDG('Causale documento')
     A            AC3DES0       20          COLHDG('Desc.documento...')
     A            AC3TIS0        1          COLHDG('1-origin.2-rist..')
     A            AC3CAC0        3          COLHDG('Caus.rist.codice.')
     A            AC3CAM0       50          COLHDG('Caus.rist.descrit')
     ****************************************************************
     *  TABELLA       : MOVMAGF0                                  *
     *  DESCRIZIONE   : Movimenti di magazzino.                   *
     *  PREFISSO      : AC4                                       *
     ****************************************************************
     A            AC4STX0        1          COLHDG('Stato ...........')
     A            AC4USE0       10          COLHDG('Utente immissione')
     A            AC4DAE0        8  0       COLHDG('Data immissione .')
     A            AC4ORE0        6  0       COLHDG('Ora immissione...')
     A            AC4USA0       10          COLHDG('Utente aggiornam.')
     A            AC4DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC4ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC4NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC4CAZ0        4          COLHDG('Codice azione....')
     A            AC4PGM0       10          COLHDG('Programma immiss.')
     A            AC4PGA0       10          COLHDG('Programma modif..')
      *
     A            AC4SES0        9  0       COLHDG('Numero sessione..')
     A            AC4MOV0        4  0       COLHDG('Numero movimento.')
     *                                     Questo numero riga dovrebbe rispettare la
     *                                     sequenza dei documenti che hanno generato
     *                                     i movimenti di magazzino.
     A            AC4DAM0        8  0       COLHDG('Data   movimento.')
     A            AC4TIR0        2          COLHDG('Tipo riga movim..')
     A            AC4TIC0        1          COLHDG('Tipo   causale...')
     A            AC4CAU0        2          COLHDG('Codice causale...')
     A            AC4AZC0        8          COLHDG('Azioni causale...')
     A            AC4STB0        3          COLHDG('Codice stabilim..')
     A            AC4MAG0        3          COLHDG('Codice magazzino.')
     A            AC4PRO0       15          COLHDG('Codice prodotto..')
     A            AC4UNM0        2          COLHDG('Unità misur.stock')
     A            AC4QTM0       12  3       COLHDG('Q.tà movime.stock')
     A            AC4CLI0        6          COLHDG('Codice cliente ..')
     A            AC4FOR0        6          COLHDG('Codice fornitore.')
     A            AC4DES0       50          COLHDG('Commento ........')
     A            AC4IMS0       18  6       COLHDG('Importo provvisor')
     A            AC4IMU0       18  6       COLHDG('Importo definitiv')
     A            AC4VAP0       18  6       COLHDG('Valore provvisor.')
     A            AC4VAD0       18  6       COLHDG('Valore definitivo')
     A            AC4IM10       18  6       COLHDG('Importo .........')
     A            AC4IM20       18  6       COLHDG('Importo .........')
     A            AC4RIF0        8          COLHDG('Riferimento .....')
     *                                     Dati relativi la produzione.
     A            AC4NLO0       15          COLHDG('Numero lotto ....')
     A            AC4DLM0        8  0       COLHDG('Data   lotto ....')
     A            AC4OLO0        6  0       COLHDG('Ora    lotto ....')
     A            AC4FRM0        6          COLHDG('Codice   formula.')
     A            AC4VEF0        5  0       COLHDG('Versione formula.')
     A            AC4ASS0       15          COLHDG('Codice assieme ..')
     A            AC4COP0        6          COLHDG('Fase produzione .')
     A            AC4IMP0        3          COLHDG('Codice impianto .')
     A            AC4SCC0        2          COLHDG('SI/NO scar.comp..')
     A            AC4TUR0        1          COLHDG('Turno 1-2-3 .....')
     A            AC4DAR0        8  0       COLHDG('Data  turno .....')
     *                                     Dati relativi la contabilità.
     A            AC4CCA0       12          COLHDG('Conto acquisti ..')
     A            AC4CCV0       12          COLHDG('Conto vendita ...')
     A            AC4CCO0       12          COLHDG('Centro di costo .')
     A            AC4CIV0        2          COLHDG('Codice Iva ......')
     A            AC4CRG0        2          COLHDG('Codice Regis. Iva')
     A            AC4DPR0        8  0       COLHDG('Data protocollo..')
     A            AC4NPR0        6  0       COLHDG('Num. protocollo..')
     A            AC4DRE0        8  0       COLHDG('Data registraz...')
     A            AC4NRE0        9  0       COLHDG('Num. registraz...')
     A            AC4FVS0        1          COLHDG('Flag voce di spe.')
     A            AC4CVS0       12          COLHDG('Codi.voce di spe.')
     *                                     Dati relativi i trasporti.
     A            AC4TIT0        2          COLHDG('Tipo trasp.FA/FP.')
     A            AC4VET0        4          COLHDG('Codice vettore...')
     A            AC4VAV0       18  6       COLHDG('Valore trasporti.')
     A            AC4NUV0        9  0       COLHDG('Numero viaggio ..')
     *                                     Dati relativi lo stivaggio.
     A            AC4SEQ0        4          COLHDG('Sequenza di prel.')
     A            AC4UBI0        4          COLHDG('Codice ubicazione')
     A            AC4UDC0        9  0       COLHDG('Unità di Carico .')
     A            AC4FKG0       15  5       COLHDG('Fattore convers..')
     A            AC4QKG0       12  3       COLHDG('Q.tà in kilogram.')
     A            AC4SIL0        6          COLHDG('Codice silos ....')
     *                                     Dati relativi la fattura Vendita/Acquisto.
     A            AC4NUF0        6  0       COLHDG('Num. fattura ....')
     A            AC4DAF0        8  0       COLHDG('Data fattura ....')
     A            AC4TIF0        4          COLHDG('Tipo fattura ....')
     A            AC4QTF0       12  3       COLHDG('Q.tà fattura ....')
     *                                     Dati relativi la bolla Vendita/Acquisto.
     A            AC4NUB0        6  0       COLHDG('Num.  bolla .....')
     A            AC4DAB0        8  0       COLHDG('Data  bolla .....')
     A            AC4TIB0        4          COLHDG('Sigla bolla .....')
     A            AC4QTB0       12  3       COLHDG('Q.tà bolla ......')
     *                                     Dati relativi l'ordine Vendita/Acquisto.
     A            AC4NUO0        9  0       COLHDG('Num.  ordine.....')
     A            AC4DAO0        8  0       COLHDG('Data  ordine.....')
     A            AC4TIO0        4          COLHDG('Sigla ordine.....')
     A            AC4QTO0       12  3       COLHDG('Q.tà ordine .....')
     *                                     Flags.
     A            AC4ACV0        1          COLHDG('V=M.P. rivenduta.')
     A            AC4SEV0        1          COLHDG('S=selez.x reg.fat')
     A            AC4PAR0        1          COLHDG('S=pallet control.')
     A            AC4FFO0        1          COLHDG('S=Fatt.registrata')
     *
     A            AC4F010        2          COLHDG('Flag 01  ........')
     A            AC4F020        2          COLHDG('Flag 02  ........')
     A            AC4F030        2          COLHDG('Flag 03  ........')
     A            AC4F040        2          COLHDG('Flag 04  ........')
     A            AC4F050        2          COLHDG('Flag 05  ........')
     A            AC4F060        2          COLHDG('Flag 06  ........')
     A            AC4F070        2          COLHDG('Flag 07  ........')
     A            AC4F080       10          COLHDG('Flag 08  ........')
     A            AC4F090       10          COLHDG('Flag 09  ........')
     A            AC4F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : ANPA40F0                                  *
     *  DESCRIZIONE   : Costo Prodotto Molino.                    *
     *  PREFISSO      : AC5                                       *
     ****************************************************************
     A            AC5STX0        1          COLHDG('Stato ...........')
     A            AC5USE0       10          COLHDG('Utente immissione')
     A            AC5DAE0        8  0       COLHDG('Data immissione .')
     A            AC5ORE0        6  0       COLHDG('Ora immissione...')
     A            AC5USA0       10          COLHDG('Utente aggiornam.')
     A            AC5DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC5ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC5NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC5CAZ0        4          COLHDG('Codice azione....')
     A            AC5PGM0       10          COLHDG('Programma immiss.')
     A            AC5PGA0       10          COLHDG('Programma modif..')
      *
     A            AC5ANN0        4          COLHDG('Anno.............')
     A            AC5MES0        2          COLHDG('Mese.............')
     A            AC5PRD0       15          COLHDG('Cod. Prodotto....')
     A            AC5COS0       18  6       COLHDG('Costo Prodotto...')
     *
     A            AC5F010        2          COLHDG('Flag 01  ........')
     A            AC5F020        2          COLHDG('Flag 02  ........')
     A            AC5F030        2          COLHDG('Flag 03  ........')
     A            AC5F040        2          COLHDG('Flag 04  ........')
     A            AC5F050        2          COLHDG('Flag 05  ........')
     A            AC5F060        2          COLHDG('Flag 06  ........')
     A            AC5F070        2          COLHDG('Flag 07  ........')
     A            AC5F080       10          COLHDG('Flag 08  ........')
     A            AC5F090       10          COLHDG('Flag 09  ........')
     A            AC5F100       10          COLHDG('Flag 10  ........')
      *
     ****************************************************************
     *  TABELLA       : ANPA41F0                                  *
     *  DESCRIZIONE   : Costo Variabili Molino                    *
     *  PREFISSO      : AC6                                       *
     ****************************************************************
     A            AC6STX0        1          COLHDG('Stato ...........')
     A            AC6USE0       10          COLHDG('Utente immissione')
     A            AC6DAE0        8  0       COLHDG('Data immissione .')
     A            AC6ORE0        6  0       COLHDG('Ora immissione...')
     A            AC6USA0       10          COLHDG('Utente aggiornam.')
     A            AC6DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC6ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC6NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC6CAZ0        4          COLHDG('Codice azione....')
     A            AC6PGM0       10          COLHDG('Programma immiss.')
     A            AC6PGA0       10          COLHDG('Programma modif..')
      *
     A            AC6CDC0       12          COLHDG('CdC..............')
     A            AC6CNF0        9  3       COLHDG('Peso Confezione..')
     A            AC6IMB0       18  6       COLHDG('Imballi..........')
     A            AC6MAN0       18  6       COLHDG('Manodopera Conf..')
     A            AC6ENE0       18  6       COLHDG('Energia..........')
     A            AC6TRA0       18  6       COLHDG('Trasporto........')
     A            AC6FAC0       18  6       COLHDG('Facchinaggio.....')
     A            AC6PRV0       18  6       COLHDG('Provvigioni......')
     A            AC6PRM0       18  6       COLHDG('Promozioni.......')
     A            AC6PCR0       18  6       COLHDG('Perdite su Cred..')
     *
     A            AC6F010        2          COLHDG('Flag 01  ........')
     A            AC6F020        2          COLHDG('Flag 02  ........')
     A            AC6F030        2          COLHDG('Flag 03  ........')
     A            AC6F040        2          COLHDG('Flag 04  ........')
     A            AC6F050        2          COLHDG('Flag 05  ........')
     A            AC6F060        2          COLHDG('Flag 06  ........')
     A            AC6F070        2          COLHDG('Flag 07  ........')
     A            AC6F080       10          COLHDG('Flag 08  ........')
     A            AC6F090       10          COLHDG('Flag 09  ........')
     A            AC6F100       10          COLHDG('Flag 10  ........')
      *
     ****************************************************************
     *  TABELLA       : ANPA42F0                                  *
     *  DESCRIZIONE   : Margine di Contribuzione                  *
     *  PREFISSO      : AC7                                       *
     ****************************************************************
     A            AC7STX0        1          COLHDG('Stato ...........')
     A            AC7USE0       10          COLHDG('Utente immissione')
     A            AC7DAE0        8  0       COLHDG('Data immissione .')
     A            AC7ORE0        6  0       COLHDG('Ora immissione...')
     A            AC7USA0       10          COLHDG('Utente aggiornam.')
     A            AC7DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC7ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC7NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC7CAZ0        4          COLHDG('Codice azione....')
     A            AC7PGM0       10          COLHDG('Programma immiss.')
     A            AC7PGA0       10          COLHDG('Programma modif..')
      *
     A            AC7ANN0        4          COLHDG('Anno.............')
     A            AC7MES0        2          COLHDG('Mese.............')
     A            AC7CDC0       12          COLHDG('CdC..............')
     A            AC7ART0       15          COLHDG('Cod.Articolo.....')
     A            AC7QTA0       18  6       COLHDG('Q.tà Fatturato...')
     A            AC7IMP0       18  6       COLHDG('Imp. Fatturato...')
     A            AC7VMP0       18  6       COLHDG('Imp. M.P.........')
     A            AC7IMB0       18  6       COLHDG('Imp.Imballi......')
     A            AC7MAN0       18  6       COLHDG('Imp.Manod. Conf..')
     A            AC7ENE0       18  6       COLHDG('Imp.Energia......')
     A            AC7TRA0       18  6       COLHDG('Imp.Trasporto....')
     A            AC7FAC0       18  6       COLHDG('Imp.Facchinaggio.')
     A            AC7PRV0       18  6       COLHDG('Imp.Provvigioni..')
     A            AC7PRM0       18  6       COLHDG('Imp.Promozioni...')
     A            AC7PCR0       18  6       COLHDG('Imp.Perdite Cred.')
     *
     A            AC7F010        2          COLHDG('Flag 01  ........')
     A            AC7F020        2          COLHDG('Flag 02  ........')
     A            AC7F030        2          COLHDG('Flag 03  ........')
     A            AC7F040        2          COLHDG('Flag 04  ........')
     A            AC7F050        2          COLHDG('Flag 05  ........')
     A            AC7F060        2          COLHDG('Flag 06  ........')
     A            AC7F070        2          COLHDG('Flag 07  ........')
     A            AC7F080       10          COLHDG('Flag 08  ........')
     A            AC7F090       10          COLHDG('Flag 09  ........')
     A            AC7F100       10          COLHDG('Flag 10  ........')
      *
     ****************************************************************
     *  TABELLA       : CART00F0                                  *
     *  DESCRIZIONE   : TESTATA CARTELLINI                        *
     *  PREFISSO      : CT0                                       *
     ****************************************************************
     A            CT0STX0        1          COLHDG('Stato ...........')
     A            CT0USE0       10          COLHDG('Utente immissione')
     A            CT0DAE0        8  0       COLHDG('Data immissione .')
     A            CT0ORE0        6  0       COLHDG('Ora immissione...')
     A            CT0USA0       10          COLHDG('Utente aggiornam.')
     A            CT0DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT0ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT0NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT0CAZ0        4          COLHDG('Codice azione....')
     A            CT0PGM0       10          COLHDG('Programma immiss.')
     A            CT0PGA0       10          COLHDG('Programma modif..')
      *
     A            CT0MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT0CPR0       15          COLHDG('Cod.Cartellino...')
     A            CT0DPR0       30          COLHDG('Des.Cartellino...')
     A            CT0ART0        6          COLHDG('Cod.Articolo.....')
NO  A*           CT0CME0        6          COLHDG('Cod.Medicazione.*')
NO  A            CT0CME0        7          COLHDG('Cod.Medicazione.*')
     A            CT0FAM0        6          COLHDG('Famiglia.........')
NO  A            CT0LOG0        4          COLHDG('Logo............*')
    A            CT0CDI0       10          COLHDG('Cod.Dest.Impiego*')
     A            CT0DD10       50          COLHDG('Des.Dest.Impi.1..')
     A            CT0DD20       50          COLHDG('Des.Dest.Impi.2..')
     A            CT0STS0        2          COLHDG('Statos Cartellino')
     A            CT0MED0        1          COLHDG('Flag Medicato....')
     A            CT0NOT0       40          COLHDG('Nota Cartellino..')
     A            CT0MSC0        2          COLHDG('Mesi di Scadenza.')
     *
     A            CT0F010        2          COLHDG('Blocco Cart.S/N..')
     A            CT0F020        2          COLHDG('Flag 02  ........')
     A            CT0F030        2          COLHDG('Flag 03  ........')
     A            CT0F040        2          COLHDG('Flag 04  ........')
     A            CT0F050        2          COLHDG('Flag 05  ........')
     A            CT0F060        2          COLHDG('Flag 06  ........')
     A            CT0F070        2          COLHDG('Flag 07  ........')
    A            CT0F080       10          COLHDG('II Logo  .......*')
     A            CT0F090       10          COLHDG('Cod.Resp.Etich. .')
     A            CT0F100       10          COLHDG('Cod.Fornitore....')
     ****************************************************************
     *  TABELLA       : CART10F0                                  *
     *  DESCRIZIONE   : INGREDIENTI CARTELLINI                    *
     *  PREFISSO      : CT1                                       *
     ****************************************************************
     A            CT1STX0        1          COLHDG('Stato ...........')
     A            CT1USE0       10          COLHDG('Utente immissione')
     A            CT1DAE0        8  0       COLHDG('Data immissione .')
     A            CT1ORE0        6  0       COLHDG('Ora immissione...')
     A            CT1USA0       10          COLHDG('Utente aggiornam.')
     A            CT1DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT1ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT1NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT1CAZ0        4          COLHDG('Codice azione....')
     A            CT1PGM0       10          COLHDG('Programma immiss.')
     A            CT1PGA0       10          COLHDG('Programma modif..')
      *
     A            CT1MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT1CPR0       15          COLHDG('Cod.Prodotto.....')
     A            CT1NRG0        4  0       COLHDG('Num. Riga........')
    A            CT1CIN0       10          COLHDG('Cod.Ingrediente.*')
     A            CT1NPO0        4  0       COLHDG('Num.Posizione....')
     *
     A            CT1F010        2          COLHDG('Flag 01  ........')
     A            CT1F020        2          COLHDG('Flag 02  ........')
     A            CT1F030        2          COLHDG('Flag 03  ........')
     A            CT1F040        2          COLHDG('Flag 04  ........')
     A            CT1F050        2          COLHDG('Flag 05  ........')
     A            CT1F060        2          COLHDG('Flag 06  ........')
     A            CT1F070        2          COLHDG('Flag 07  ........')
     A            CT1F080       10          COLHDG('Flag 08  ........')
     A            CT1F090       10          COLHDG('Flag 09  ........')
     A            CT1F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART20F0                                  *
     *  DESCRIZIONE   : TENORI ANALITICI                          *
     *  PREFISSO      : CT2                                       *
     ****************************************************************
     A            CT2STX0        1          COLHDG('Stato ...........')
     A            CT2USE0       10          COLHDG('Utente immissione')
     A            CT2DAE0        8  0       COLHDG('Data immissione .')
     A            CT2ORE0        6  0       COLHDG('Ora immissione...')
     A            CT2USA0       10          COLHDG('Utente aggiornam.')
     A            CT2DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT2ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT2NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT2CAZ0        4          COLHDG('Codice azione....')
     A            CT2PGM0       10          COLHDG('Programma immiss.')
     A            CT2PGA0       10          COLHDG('Programma modif..')
      *
     A            CT2MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT2CPR0       15          COLHDG('Cod.Prodotto.....')
     A            CT2NRG0        4  0       COLHDG('Num. Riga........')
    A            CT2CAN0       10          COLHDG('Cod.Ten.Analitico')
     A            CT2PER0        6  3       COLHDG('Percentuale%.....')
     A            CT2NPO0        4  0       COLHDG('Num.Posizione....')
     *
     A            CT2F010        2          COLHDG('Flag 01  ........')
     A            CT2F020        2          COLHDG('Flag 02  ........')
     A            CT2F030        2          COLHDG('Flag 03  ........')
     A            CT2F040        2          COLHDG('Flag 04  ........')
     A            CT2F050        2          COLHDG('Flag 05  ........')
     A            CT2F060        2          COLHDG('Flag 06  ........')
     A            CT2F070        2          COLHDG('Flag 07  ........')
     A            CT2F080       10          COLHDG('Flag 08  ........')
     A            CT2F090       10          COLHDG('Flag 09  ........')
     A            CT2F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART30F0                                  *
     *  DESCRIZIONE   : INTEGRAZIONI                              *
     *  PREFISSO      : CT3                                       *
     ****************************************************************
     A            CT3STX0        1          COLHDG('Stato ...........')
     A            CT3USE0       10          COLHDG('Utente immissione')
     A            CT3DAE0        8  0       COLHDG('Data immissione .')
     A            CT3ORE0        6  0       COLHDG('Ora immissione...')
     A            CT3USA0       10          COLHDG('Utente aggiornam.')
     A            CT3DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT3ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT3NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT3CAZ0        4          COLHDG('Codice azione....')
     A            CT3PGM0       10          COLHDG('Programma immiss.')
     A            CT3PGA0       10          COLHDG('Programma modif..')
      *
     A            CT3MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT3CPR0       15          COLHDG('Cod.Prodotto.....')
     A            CT3NRG0        4  0       COLHDG('Num. Riga........')
     A            CT3NPO0        4  0       COLHDG('Num. Posizione...')
NO  A            CT3CIT0       15          COLHDG('Cod.Integrazione.')
     A            CT3UMI0        4          COLHDG('U.Misura.........')
     A            CT3QTA0       18  6       COLHDG('Q.tà Integrazione')
     A            CT3TIP0        1          COLHDG('Tipo Int./Med....')
     *
     A            CT3F010        2          COLHDG('Flag 01  ........')
     A            CT3F020        2          COLHDG('Flag 02  ........')
     A            CT3F030        2          COLHDG('Flag 03  ........')
     A            CT3F040        2          COLHDG('Flag 04  ........')
     A            CT3F050        2          COLHDG('Flag 05  ........')
     A            CT3F060        2          COLHDG('Flag 06  ........')
     A            CT3F070        2          COLHDG('Flag 07  ........')
     A            CT3F080       10          COLHDG('Flag 08  ........')
     A            CT3F090       10          COLHDG('Flag 09  ........')
     A            CT3F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART40F0                                  *
     *  DESCRIZIONE   : ISTRUZIONI D'USO                          *
     *  PREFISSO      : CT4                                       *
     ****************************************************************
     A            CT4STX0        1          COLHDG('Stato ...........')
     A            CT4USE0       10          COLHDG('Utente immissione')
     A            CT4DAE0        8  0       COLHDG('Data immissione .')
     A            CT4ORE0        6  0       COLHDG('Ora immissione...')
     A            CT4USA0       10          COLHDG('Utente aggiornam.')
     A            CT4DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT4ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT4NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT4CAZ0        4          COLHDG('Codice azione....')
     A            CT4PGM0       10          COLHDG('Programma immiss.')
     A            CT4PGA0       10          COLHDG('Programma modif..')
      *
     A            CT4MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT4CPR0       15          COLHDG('Cod.Prodotto.....')
     A            CT4DE00     1200          COLHDG('Descrizioni......')
     *
     A            CT4F010        2          COLHDG('Flag 01  ........')
     A            CT4F020        2          COLHDG('Flag 02  ........')
     A            CT4F030        2          COLHDG('Flag 03  ........')
     A            CT4F040        2          COLHDG('Flag 04  ........')
     A            CT4F050        2          COLHDG('Flag 05  ........')
     A            CT4F060        2          COLHDG('Flag 06  ........')
     A            CT4F070        2          COLHDG('Flag 07  ........')
     A            CT4F080       10          COLHDG('Flag 08  ........')
     A            CT4F090       10          COLHDG('Flag 09  ........')
     A            CT4F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART50F0                                  *
     *  DESCRIZIONE   : ANAGR. DESTINAZIONE DI IMPIEGO            *
     *  PREFISSO      : CT5                                       *
     ****************************************************************
     A            CT5STX0        1          COLHDG('Stato ...........')
     A            CT5USE0       10          COLHDG('Utente immissione')
     A            CT5DAE0        8  0       COLHDG('Data immissione .')
     A            CT5ORE0        6  0       COLHDG('Ora immissione...')
     A            CT5USA0       10          COLHDG('Utente aggiornam.')
     A            CT5DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT5ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT5NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT5CAZ0        4          COLHDG('Codice azione....')
     A            CT5PGM0       10          COLHDG('Programma immiss.')
     A            CT5PGA0       10          COLHDG('Programma modif..')
      *
    A            CT5CDI0       10          COLHDG('Cod.Dest.Impiego.')
     A            CT5DD10       50          COLHDG('Descrizione1.....')
     A            CT5DD20       50          COLHDG('Descrizione2.....')
     A            CT5DD30       50          COLHDG('Descrizione3.....')
     A            CT5DD40       50          COLHDG('Descrizione4.....')
     A            CT5DD50       50          COLHDG('Descrizione5.....')
     *
     A            CT5F010        2          COLHDG('Flag 01  ........')
     A            CT5F020        2          COLHDG('Flag 02  ........')
     A            CT5F030        2          COLHDG('Flag 03  ........')
     A            CT5F040        2          COLHDG('Flag 04  ........')
     A            CT5F050        2          COLHDG('Flag 05  ........')
     A            CT5F060        2          COLHDG('Flag 06  ........')
     A            CT5F070        2          COLHDG('Flag 07  ........')
     A            CT5F080       10          COLHDG('Flag 08  ........')
     A            CT5F090       10          COLHDG('Flag 09  ........')
     A            CT5F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART60F0                                  *
     *  DESCRIZIONE   : ANAGR. INGREDIENTI CARTELLINO             *
     *  PREFISSO      : CT6                                       *
     ****************************************************************
     A            CT6STX0        1          COLHDG('Stato ...........')
     A            CT6USE0       10          COLHDG('Utente immissione')
     A            CT6DAE0        8  0       COLHDG('Data immissione .')
     A            CT6ORE0        6  0       COLHDG('Ora immissione...')
     A            CT6USA0       10          COLHDG('Utente aggiornam.')
     A            CT6DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT6ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT6NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT6CAZ0        4          COLHDG('Codice azione....')
     A            CT6PGM0       10          COLHDG('Programma immiss.')
     A            CT6PGA0       10          COLHDG('Programma modif..')
      *
    A            CT6CIN0       10          COLHDG('Cod.Ingrediente..')
     A            CT6DES0       40          COLHDG('Des.Ingrediente..')
     A            CT6DE10       40          COLHDG('Des.Ingrediente1.')
     A            CT6DE20       40          COLHDG('Des.Ingrediente2.')
    A            CT6CNO0       10          COLHDG('Cod.Nota.........')
     *
     A            CT6F010        2          COLHDG('Flag 01  ........')
     A            CT6F020        2          COLHDG('Flag 02  ........')
     A            CT6F030        2          COLHDG('Flag 03  ........')
     A            CT6F040        2          COLHDG('Flag 04  ........')
     A            CT6F050        2          COLHDG('Flag 05  ........')
     A            CT6F060        2          COLHDG('Flag 06  ........')
     A            CT6F070        2          COLHDG('Flag 07  ........')
     A            CT6F080       10          COLHDG('Flag 08  ........')
     A            CT6F090       10          COLHDG('Flag 09  ........')
     A            CT6F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART65F0                                  *
     *  DESCRIZIONE   : ANAGR. NOTE                               *
     *  PREFISSO      : C65                                       *
     ****************************************************************
     A            C65STX0        1          COLHDG('Stato ...........')
     A            C65USE0       10          COLHDG('Utente immissione')
     A            C65DAE0        8  0       COLHDG('Data immissione .')
     A            C65ORE0        6  0       COLHDG('Ora immissione...')
     A            C65USA0       10          COLHDG('Utente aggiornam.')
     A            C65DAA0        8  0       COLHDG('Data aggiornam...')
     A            C65ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C65NRX0        9  0       COLHDG('Numero Azione ...')
     A            C65CAZ0        4          COLHDG('Codice azione....')
     A            C65PGM0       10          COLHDG('Programma immiss.')
     A            C65PGA0       10          COLHDG('Programma modif..')
      *
    A            C65CNO0       10          COLHDG('Cod.Nota.........')
     A            C65DES0      160          COLHDG('Descrizione......')
     *
     A            C65F010        2          COLHDG('Flag 01  ........')
     A            C65F020        2          COLHDG('Flag 02  ........')
     A            C65F030        2          COLHDG('Flag 03  ........')
     A            C65F040        2          COLHDG('Flag 04  ........')
     A            C65F050        2          COLHDG('Flag 05  ........')
     A            C65F060        2          COLHDG('Flag 06  ........')
     A            C65F070        2          COLHDG('Flag 07  ........')
     A            C65F080       10          COLHDG('Flag 08  ........')
     A            C65F090       10          COLHDG('Flag 09  ........')
     A            C65F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART66F0                                  *
     *  DESCRIZIONE   : ANAGR. LOGO                               *
     *  PREFISSO      : C66                                       *
     ****************************************************************
     A            C66STX0        1          COLHDG('Stato ...........')
     A            C66USE0       10          COLHDG('Utente immissione')
     A            C66DAE0        8  0       COLHDG('Data immissione .')
     A            C66ORE0        6  0       COLHDG('Ora immissione...')
     A            C66USA0       10          COLHDG('Utente aggiornam.')
     A            C66DAA0        8  0       COLHDG('Data aggiornam...')
     A            C66ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C66NRX0        9  0       COLHDG('Numero Azione ...')
     A            C66CAZ0        4          COLHDG('Codice azione....')
     A            C66PGM0       10          COLHDG('Programma immiss.')
     A            C66PGA0       10          COLHDG('Programma modif..')
      *
    A            C66CLO0       10          COLHDG('Cod.Logo.........')
     A            C66DES0       50          COLHDG('Descrizione......')
     *
     A            C66F010        2          COLHDG('Flag 01  ........')
     A            C66F020        2          COLHDG('Flag 02  ........')
     A            C66F030        2          COLHDG('Flag 03  ........')
     A            C66F040        2          COLHDG('Flag 04  ........')
     A            C66F050        2          COLHDG('Flag 05  ........')
     A            C66F060        2          COLHDG('Flag 06  ........')
     A            C66F070        2          COLHDG('Flag 07  ........')
     A            C66F080       10          COLHDG('Flag 08  ........')
     A            C66F090       10          COLHDG('Flag 09  ........')
     A            C66F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART70F0                                  *
     *  DESCRIZIONE   : ANAGR. TENORI ANALITICI                   *
     *  PREFISSO      : CT7                                       *
     ****************************************************************
     A            CT7STX0        1          COLHDG('Stato ...........')
     A            CT7USE0       10          COLHDG('Utente immissione')
     A            CT7DAE0        8  0       COLHDG('Data immissione .')
     A            CT7ORE0        6  0       COLHDG('Ora immissione...')
     A            CT7USA0       10          COLHDG('Utente aggiornam.')
     A            CT7DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT7ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT7NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT7CAZ0        4          COLHDG('Codice azione....')
     A            CT7PGM0       10          COLHDG('Programma immiss.')
     A            CT7PGA0       10          COLHDG('Programma modif..')
      *
    A            CT7CAN0       10          COLHDG('Cod.Ten.Analitico')
     A            CT7DES0       40          COLHDG('Des.Ten.Analitico')
     A            CT7PER0        6  3       COLHDG('Percentuale%.....')
     *
     A            CT7F010        2          COLHDG('Flag 01  ........')
     A            CT7F020        2          COLHDG('Flag 02  ........')
     A            CT7F030        2          COLHDG('Flag 03  ........')
     A            CT7F040        2          COLHDG('Flag 04  ........')
     A            CT7F050        2          COLHDG('Flag 05  ........')
     A            CT7F060        2          COLHDG('Flag 06  ........')
     A            CT7F070        2          COLHDG('Flag 07  ........')
     A            CT7F080       10          COLHDG('Flag 08  ........')
     A            CT7F090       10          COLHDG('Flag 09  ........')
     A            CT7F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART80F0                                  *
     *  DESCRIZIONE   : ANAGR. VOCI INTEGRAZIONI                  *
     *  PREFISSO      : CT8                                       *
     ****************************************************************
     A            CT8STX0        1          COLHDG('Stato ...........')
     A            CT8USE0       10          COLHDG('Utente immissione')
     A            CT8DAE0        8  0       COLHDG('Data immissione .')
     A            CT8ORE0        6  0       COLHDG('Ora immissione...')
     A            CT8USA0       10          COLHDG('Utente aggiornam.')
     A            CT8DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT8ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT8NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT8CAZ0        4          COLHDG('Codice azione....')
     A            CT8PGM0       10          COLHDG('Programma immiss.')
     A            CT8PGA0       10          COLHDG('Programma modif..')
      *
     A            CT8CIT0       10          COLHDG('Cod.Integrazione.')
     A            CT8DES0       40          COLHDG('Des.Integrazione.')
     A            CT8UMI0        4          COLHDG('U.Misura.........')
     A            CT8NOT0       50          COLHDG('Annotazioni......')
     *
     A            CT8F010        2          COLHDG('Flag 01  ........')
     A            CT8F020        2          COLHDG('Flag 02  ........')
     A            CT8F030        2          COLHDG('Flag 03  ........')
     A            CT8F040        2          COLHDG('Flag 04  ........')
     A            CT8F050        2          COLHDG('Flag 05  ........')
     A            CT8F060        2          COLHDG('Flag 06  ........')
     A            CT8F070        2          COLHDG('Flag 07  ........')
     A            CT8F080       10          COLHDG('Cod. Gruppo Funz.')
     A            CT8F090       10          COLHDG('Flag 09  ........')
     A            CT8F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART85F0                                  *
     *  DESCRIZIONE   : ANAGR. VOCI MEDICAZIONI                   *
     *  PREFISSO      : CTA                                       *
     ****************************************************************
     A            C85STX0        1          COLHDG('Stato ...........')
     A            C85USE0       10          COLHDG('Utente immissione')
     A            C85DAE0        8  0       COLHDG('Data immissione .')
     A            C85ORE0        6  0       COLHDG('Ora immissione...')
     A            C85USA0       10          COLHDG('Utente aggiornam.')
     A            C85DAA0        8  0       COLHDG('Data aggiornam...')
     A            C85ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C85NRX0        9  0       COLHDG('Numero Azione ...')
     A            C85CAZ0        4          COLHDG('Codice azione....')
     A            C85PGM0       10          COLHDG('Programma immiss.')
     A            C85PGA0       10          COLHDG('Programma modif..')
      *
     A            C85CME0       10          COLHDG('Cod.Medicazione..')
     A            C85DES0       40          COLHDG('Des.Medicazione..')
     A            C85UMI0        4          COLHDG('U.Misura.........')
     A            C85NOT0       50          COLHDG('Annotazioni......')
     *
     A            C85F010        2          COLHDG('Flag 01  ........')
     A            C85F020        2          COLHDG('Flag 02  ........')
     A            C85F030        2          COLHDG('Flag 03  ........')
     A            C85F040        2          COLHDG('Flag 04  ........')
     A            C85F050        2          COLHDG('Flag 05  ........')
     A            C85F060        2          COLHDG('Flag 06  ........')
     A            C85F070        2          COLHDG('Flag 07  ........')
     A            C85F080       10          COLHDG('Cod. Gruppo Funz.')
     A            C85F090       10          COLHDG('Flag 09  ........')
     A            C85F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART90F0                                  *
     *  DESCRIZIONE   : ANAGR. AUTORIZZAZIONI                     *
     *  PREFISSO      : CT9                                       *
     ****************************************************************
     A            CT9STX0        1          COLHDG('Stato ...........')
     A            CT9USE0       10          COLHDG('Utente immissione')
     A            CT9DAE0        8  0       COLHDG('Data immissione .')
     A            CT9ORE0        6  0       COLHDG('Ora immissione...')
     A            CT9USA0       10          COLHDG('Utente aggiornam.')
     A            CT9DAA0        8  0       COLHDG('Data aggiornam...')
     A            CT9ORA0        6  0       COLHDG('Ora aggiornam....')
     A            CT9NRX0        9  0       COLHDG('Numero Azione ...')
     A            CT9CAZ0        4          COLHDG('Codice azione....')
     A            CT9PGM0       10          COLHDG('Programma immiss.')
     A            CT9PGA0       10          COLHDG('Programma modif..')
      *
     A            CT9MAG0        2          COLHDG('Cod.Magazzino....')
     A            CT9MED0        1          COLHDG('Flag Medicato....')
     A            CT9DE10       50          COLHDG('Des.Autoriz.1....')
     A            CT9DE20       50          COLHDG('Des.Autoriz.2....')
     A            CT9DE30       50          COLHDG('Des.Autoriz.3....')
     A            CT9DE40       50          COLHDG('Des.Autoriz.4....')
     A            CT9DTA0        8  0       COLHDG('Data Autoriz.....')
     *
     A            CT9F010        2          COLHDG('Flag 01  ........')
     A            CT9F020        2          COLHDG('Flag 02  ........')
     A            CT9F030        2          COLHDG('Flag 03  ........')
     A            CT9F040        2          COLHDG('Flag 04  ........')
     A            CT9F050        2          COLHDG('Flag 05  ........')
     A            CT9F060        2          COLHDG('Flag 06  ........')
     A            CT9F070        2          COLHDG('Flag 07  ........')
     A            CT9F080       10          COLHDG('Flag 08  ........')
     A            CT9F090       10          COLHDG('Flag 09  ........')
     A            CT9F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : INTE10F0                                  *
     *  DESCRIZIONE   : ANAGR. RIGHE INTEGRAZIONI                 *
     ****************************************************************
     A            IN1STX0        1          COLHDG('Stato ...........')
     A            IN1USE0       10          COLHDG('Utente immissione')
     A            IN1DAE0        8  0       COLHDG('Data immissione .')
     A            IN1ORE0        6  0       COLHDG('Ora immissione...')
     A            IN1USA0       10          COLHDG('Utente aggiornam.')
     A            IN1DAA0        8  0       COLHDG('Data aggiornam...')
     A            IN1ORA0        6  0       COLHDG('Ora aggiornam....')
     A            IN1NRX0        9  0       COLHDG('Numero Azione ...')
     A            IN1CAZ0        4          COLHDG('Codice azione....')
     A            IN1PGM0       10          COLHDG('Programma immiss.')
     A            IN1PGA0       10          COLHDG('Programma modif..')
      *
     A            IN1MAG0        2          COLHDG('Cod.Magazzino....')
     A            IN1COD0       15          COLHDG('Cod.Integratore..')
    A            IN1CIN0       10          COLHDG('Cod. Voce Integr.')
     A            IN1NRG0        4  0       COLHDG('Num.Riga.........')
     A            IN1NPO0        4  0       COLHDG('Num.Posizione....')
     A            IN1UMI0        4          COLHDG('Unità di Misura..')
     A            IN1QTA0       18  6       COLHDG('Quantità.........')
     *
     A            IN1F010        2          COLHDG('Flag 01  ........')
     A            IN1F020        2          COLHDG('Flag 02  ........')
     A            IN1F030        2          COLHDG('Flag 03  ........')
     A            IN1F040        2          COLHDG('Flag 04  ........')
     A            IN1F050        2          COLHDG('Flag 05  ........')
     A            IN1F060        2          COLHDG('Flag 06  ........')
     A            IN1F070        2          COLHDG('Flag 07  ........')
     A            IN1F080       10          COLHDG('Flag 08  ........')
     A            IN1F090       10          COLHDG('Flag 09  ........')
     A            IN1F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : MEDI10F0                                  *
     *  DESCRIZIONE   : ANAGR. RIGHE MEDICAZIONI                  *
     ****************************************************************
     A            ME1STX0        1          COLHDG('Stato ...........')
     A            ME1USE0       10          COLHDG('Utente immissione')
     A            ME1DAE0        8  0       COLHDG('Data immissione .')
     A            ME1ORE0        6  0       COLHDG('Ora immissione...')
     A            ME1USA0       10          COLHDG('Utente aggiornam.')
     A            ME1DAA0        8  0       COLHDG('Data aggiornam...')
     A            ME1ORA0        6  0       COLHDG('Ora aggiornam....')
     A            ME1NRX0        9  0       COLHDG('Numero Azione ...')
     A            ME1CAZ0        4          COLHDG('Codice azione....')
     A            ME1PGM0       10          COLHDG('Programma immiss.')
     A            ME1PGA0       10          COLHDG('Programma modif..')
      *
     A            ME1MAG0        2          COLHDG('Cod.Magazzino....')
     A            ME1COD0       15          COLHDG('Cod.Medicazione..')
    A            ME1CME0       10          COLHDG('Cod.Voce Medicaz.')
     A            ME1NRG0        4  0       COLHDG('Num.Riga.........')
     A            ME1NPO0        4  0       COLHDG('Num. Posizione...')
     A            ME1UMI0        4          COLHDG('Unità di Misura..')
     A            ME1QTA0       18  6       COLHDG('Quantità.........')
     *
     A            ME1F010        2          COLHDG('Flag 01  ........')
     A            ME1F020        2          COLHDG('Flag 02  ........')
     A            ME1F030        2          COLHDG('Flag 03  ........')
     A            ME1F040        2          COLHDG('Flag 04  ........')
     A            ME1F050        2          COLHDG('Flag 05  ........')
     A            ME1F060        2          COLHDG('Flag 06  ........')
     A            ME1F070        2          COLHDG('Flag 07  ........')
     A            ME1F080       10          COLHDG('Flag 08  ........')
     A            ME1F090       10          COLHDG('Flag 09  ........')
     A            ME1F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CART95F0                                  *
     *  DESCRIZIONE   : PUBBLICAZIONE CARTELLINO                  *
     *  PREFISSO      : C95                                       *
     ****************************************************************
     A            C95STX0        1          COLHDG('Stato ...........')
     A            C95USE0       10          COLHDG('Utente immissione')
     A            C95DAE0        8  0       COLHDG('Data immissione .')
     A            C95ORE0        6  0       COLHDG('Ora immissione...')
     A            C95USA0       10          COLHDG('Utente aggiornam.')
     A            C95DAA0        8  0       COLHDG('Data aggiornam...')
     A            C95ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C95NRX0        9  0       COLHDG('Numero Azione ...')
     A            C95CAZ0        4          COLHDG('Codice azione....')
     A            C95PGM0       10          COLHDG('Programma immiss.')
     A            C95PGA0       10          COLHDG('Programma modif..')
      *
     A            C95MAG0        2          COLHDG('Cod.Magazzino....')
     A            C95CPR0       15          COLHDG('Cod.Cartellino...')
     A            C95DPR0       30          COLHDG('Des.Cartellino...')
     A            C95ART0        6          COLHDG('Cod. Prodotto....')
     A            C95CME0        6          COLHDG('Cod. Medicazione.')
     A            C95MSC0        2          COLHDG('Mesi Scadenza....')
     A            C95LOG0        4          COLHDG('Cod.Logo.........')
     A            C95STS0        1          COLHDG('Status Cartellino')
     A            C95MED0        1          COLHDG('Prod.Medicato....')
     A            C95DDI0      300          COLHDG('Des.Dest.Impiego.')
     A*           C95DTA0      200          COLHDG('Des.Ten.Analitici')
     A            C95DTA0      300          COLHDG('Des.Ten.Analitici')
     A            C95DIN0      700          COLHDG('Des.Ingredienti..')
     A            C95NOT0      100          COLHDG('Note.............')
     A            C95IXU0     1200          COLHDG('Istruz. per uso..')
     A            C95AUT0      200          COLHDG('Autorizzazione...')
     A            C95SOC0      200          COLHDG('Società e Indiri.')
     *
     A            C95PRO0       15          COLHDG('Cod.Prodotto.....')
     A            C95LOT0        9          COLHDG('Nr.Lotto.........')
     A            C95DTP0       10          COLHDG('Data Produzione..')
     A            C95DTS0       10          COLHDG('Data Scadenza....')
     A            C95NCP0        4  0       COLHDG('Nr.Copie Stampa..')
     A            C95EAN0       15          COLHDG('Cod. EAN.........')
      *
     A            C95DI01       40          COLHDG('Des.Integrazione.')
     A            C95UM01        4          COLHDG('Un.Misura........')
     A            C95VA01        8          COLHDG('Valore...........')
     A            C95FL01        1          COLHDG('Flag Layout .....')
     A            C95DI02       40          COLHDG('Des.Integrazione.')
     A            C95UM02        4          COLHDG('Un.Misura........')
     A            C95VA02        8          COLHDG('Valore...........')
     A            C95FL02        1          COLHDG('Flag Layout .....')
     A            C95DI03       40          COLHDG('Des.Integrazione.')
     A            C95UM03        4          COLHDG('Un.Misura........')
     A            C95VA03        8          COLHDG('Valore...........')
     A            C95FL03        1          COLHDG('Flag Layout .....')
     A            C95DI04       40          COLHDG('Des.Integrazione.')
     A            C95UM04        4          COLHDG('Un.Misura........')
     A            C95VA04        8          COLHDG('Valore...........')
     A            C95FL04        1          COLHDG('Flag Layout .....')
     A            C95DI05       40          COLHDG('Des.Integrazione.')
     A            C95UM05        4          COLHDG('Un.Misura........')
     A            C95VA05        8          COLHDG('Valore...........')
     A            C95FL05        1          COLHDG('Flag Layout .....')
     A            C95DI06       40          COLHDG('Des.Integrazione.')
     A            C95UM06        4          COLHDG('Un.Misura........')
     A            C95VA06        8          COLHDG('Valore...........')
     A            C95FL06        1          COLHDG('Flag Layout .....')
     A            C95DI07       40          COLHDG('Des.Integrazione.')
     A            C95UM07        4          COLHDG('Un.Misura........')
     A            C95VA07        8          COLHDG('Valore...........')
     A            C95FL07        1          COLHDG('Flag Layout .....')
     A            C95DI08       40          COLHDG('Des.Integrazione.')
     A            C95UM08        4          COLHDG('Un.Misura........')
     A            C95VA08        8          COLHDG('Valore...........')
     A            C95FL08        1          COLHDG('Flag Layout .....')
     A            C95DI09       40          COLHDG('Des.Integrazione.')
     A            C95UM09        4          COLHDG('Un.Misura........')
     A            C95VA09        8          COLHDG('Valore...........')
     A            C95FL09        1          COLHDG('Flag Layout .....')
     A            C95DI10       40          COLHDG('Des.Integrazione.')
     A            C95UM10        4          COLHDG('Un.Misura........')
     A            C95VA10        8          COLHDG('Valore...........')
     A            C95FL10        1          COLHDG('Flag Layout .....')
     A            C95DI11       40          COLHDG('Des.Integrazione.')
     A            C95UM11        4          COLHDG('Un.Misura........')
     A            C95VA11        8          COLHDG('Valore...........')
     A            C95FL11        1          COLHDG('Flag Layout .....')
     A            C95DI12       40          COLHDG('Des.Integrazione.')
     A            C95UM12        4          COLHDG('Un.Misura........')
     A            C95VA12        8          COLHDG('Valore...........')
     A            C95FL12        1          COLHDG('Flag Layout .....')
     A            C95DI13       40          COLHDG('Des.Integrazione.')
     A            C95UM13        4          COLHDG('Un.Misura........')
     A            C95VA13        8          COLHDG('Valore...........')
     A            C95FL13        1          COLHDG('Flag Layout .....')
     A            C95DI14       40          COLHDG('Des.Integrazione.')
     A            C95UM14        4          COLHDG('Un.Misura........')
     A            C95VA14        8          COLHDG('Valore...........')
     A            C95FL14        1          COLHDG('Flag Layout .....')
     A            C95DI15       40          COLHDG('Des.Integrazione.')
     A            C95UM15        4          COLHDG('Un.Misura........')
     A            C95VA15        8          COLHDG('Valore...........')
     A            C95FL15        1          COLHDG('Flag Layout .....')
     A            C95DI16       40          COLHDG('Des.Integrazione.')
     A            C95UM16        4          COLHDG('Un.Misura........')
     A            C95VA16        8          COLHDG('Valore...........')
     A            C95FL16        1          COLHDG('Flag Layout .....')
     A            C95DI17       40          COLHDG('Des.Integrazione.')
     A            C95UM17        4          COLHDG('Un.Misura........')
     A            C95VA17        8          COLHDG('Valore...........')
     A            C95FL17        1          COLHDG('Flag Layout .....')
     A            C95DI18       40          COLHDG('Des.Integrazione.')
     A            C95UM18        4          COLHDG('Un.Misura........')
     A            C95VA18        8          COLHDG('Valore...........')
     A            C95FL18        1          COLHDG('Flag Layout .....')
     A            C95DI19       40          COLHDG('Des.Integrazione.')
     A            C95UM19        4          COLHDG('Un.Misura........')
     A            C95VA19        8          COLHDG('Valore...........')
     A            C95FL19        1          COLHDG('Flag Layout .....')
     A            C95DI20       40          COLHDG('Des.Integrazione.')
     A            C95UM20        4          COLHDG('Un.Misura........')
     A            C95VA20        8          COLHDG('Valore...........')
     A            C95FL20        1          COLHDG('Flag Layout .....')
     A            C95DI21       40          COLHDG('Des.Integrazione.')
     A            C95UM21        4          COLHDG('Un.Misura........')
     A            C95VA21        8          COLHDG('Valore...........')
     A            C95FL21        1          COLHDG('Flag Layout .....')
     A            C95DI22       40          COLHDG('Des.Integrazione.')
     A            C95UM22        4          COLHDG('Un.Misura........')
     A            C95VA22        8          COLHDG('Valore...........')
     A            C95FL22        1          COLHDG('Flag Layout .....')
     A            C95DI23       40          COLHDG('Des.Integrazione.')
     A            C95UM23        4          COLHDG('Un.Misura........')
     A            C95VA23        8          COLHDG('Valore...........')
     A            C95FL23        1          COLHDG('Flag Layout .....')
     A            C95DI24       40          COLHDG('Des.Integrazione.')
     A            C95UM24        4          COLHDG('Un.Misura........')
     A            C95VA24        8          COLHDG('Valore...........')
     A            C95FL24        1          COLHDG('Flag Layout .....')
     A            C95DI25       40          COLHDG('Des.Integrazione.')
     A            C95UM25        4          COLHDG('Un.Misura........')
     A            C95VA25        8          COLHDG('Valore...........')
     A            C95FL25        1          COLHDG('Flag Layout .....')
     A            C95DI26       40          COLHDG('Des.Integrazione.')
     A            C95UM26        4          COLHDG('Un.Misura........')
     A            C95VA26        8          COLHDG('Valore...........')
     A            C95FL26        1          COLHDG('Flag Layout .....')
      *
     A            C95F010        2          COLHDG('Flag 01  ........')
     A            C95F020        2          COLHDG('Flag 02  ........')
     A            C95F030        2          COLHDG('Marchio  ........')
     A            C95F040        2          COLHDG('Nr Copie Cartel..')
     A            C95F050        2          COLHDG('C=Coccidiostatico')
     A            C95F060        2          COLHDG('Flag 06  ........')
     A            C95F070        2          COLHDG('Layout stampa ...')
     A            C95F080       10          COLHDG('Flag 08  ........')
     A            C95F090       10          COLHDG('Flag 09  ........')
     A            C95F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : MPRITEF0                                  *
     *  DESCRIZIONE   : Testata MP per Rintracciabilità           *
     *  PREFISSO      : AC8                                       *
     ****************************************************************
     A            AC8STX0        1          COLHDG('Stato ...........')
     A            AC8USE0       10          COLHDG('Utente immissione')
     A            AC8DAE0        8  0       COLHDG('Data immissione .')
     A            AC8ORE0        6  0       COLHDG('Ora immissione...')
     A            AC8PGM0       10          COLHDG('Programma immiss.')
     A            AC8NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC8CAZ0        4          COLHDG('Codice azione....')
     A            AC8USA0       10          COLHDG('Utente aggiornam.')
     A            AC8DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC8ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC8PGA0       10          COLHDG('Programma aggior.')
     *
     A            AC8PRO0       15          COLHDG('Codice prodotto..')
     A            AC8STB0        3          COLHDG('Codice stabilim..')
     A            AC8MAG0        3          COLHDG('Codice magazzino.')
     A            AC8FOR0        6          COLHDG('Codice fornitore.')
     A            AC8DAB0        8  0       COLHDG('Data bolla ......')
     A            AC8SIB0        4          COLHDG('Sigla bolla .....')
     A            AC8NUB0        6  0       COLHDG('Numero bolla ....')
     A            AC8QTB0       12  3       COLHDG('Q.tà bolla ......')
     A            AC8QTE0       12  3       COLHDG('Q.tà effettiva ..')
     A            AC8UNM0        2          COLHDG('Unità di misura .')
     A            AC8NRP0        9  0       COLHDG('Numero progressi.')
     A            AC8CHI0        2          COLHDG('SI = chiuso .....')
     A            AC8DAI0        8  0       COLHDG('Data ingresso ...')
     *
     A            AC8F010        2          COLHDG('Flag 01  ........')
     A            AC8F020        2          COLHDG('Flag 02  ........')
     A            AC8F030        2          COLHDG('Flag 03  ........')
     A            AC8F040        2          COLHDG('Flag 04  ........')
     A            AC8F050        2          COLHDG('Flag 05  ........')
     A            AC8F060        2          COLHDG('Flag 06  ........')
     A            AC8F070        2          COLHDG('Flag 07  ........')
     A            AC8F080       10          COLHDG('Flag 08  ........')
     A            AC8F090       10          COLHDG('Flag 09  ........')
     A            AC8F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : MPRID1F0                                  *
     *  DESCRIZIONE   : Dettaglio 1° MP per Rintracciabilità      *
     *  PREFISSO      : AC9                                       *
     ****************************************************************
     A            AC9STX0        1          COLHDG('Stato ...........')
     A            AC9USE0       10          COLHDG('Utente immissione')
     A            AC9DAE0        8  0       COLHDG('Data immissione .')
     A            AC9ORE0        6  0       COLHDG('Ora immissione...')
     A            AC9PGM0       10          COLHDG('Programma immiss.')
     A            AC9NRX0        9  0       COLHDG('Numero Azione ...')
     A            AC9CAZ0        4          COLHDG('Codice azione....')
     A            AC9USA0       10          COLHDG('Utente aggiornam.')
     A            AC9DAA0        8  0       COLHDG('Data aggiornam...')
     A            AC9ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AC9PGA0       10          COLHDG('Programma aggior.')
     *
     A            AC9NUC0        9  0       COLHDG('Numero B.E.M.....')
     A            AC9DAC0        8  0       COLHDG('Data   B.E.M.....')
     A            AC9QTB0       12  3       COLHDG('Q.tà   B.E.M.....')
     A            AC9QTE0       12  3       COLHDG('Q.tà effettiva ..')
     A            AC9NRS0        9  0       COLHDG('NRSES di MOMAM ..')
     A            AC9NRM0        4  0       COLHDG('NRMOV di MOMAM ..')
     A            AC9NLO0       15          COLHDG('Numero lotto for.')
     A            AC9NRP0        9  0       COLHDG('Numero progressi.')
     A            AC9NRI0        4  0       COLHDG('Numero riga .....')
     A            AC9DAI0        8  0       COLHDG('Data ingresso ...')
     A            AC9SIL0        6          COLHDG('Silos stivaggio..')
     A            AC9CHI0        2          COLHDG('SI = chiuso .....')
     *
     A            AC9F010        2          COLHDG('Flag 01  ........')
     A            AC9F020        2          COLHDG('Flag 02  ........')
     A            AC9F030        2          COLHDG('Flag 03  ........')
     A            AC9F040        2          COLHDG('Flag 04  ........')
     A            AC9F050        2          COLHDG('Flag 05  ........')
     A            AC9F060        2          COLHDG('Flag 06  ........')
     A            AC9F070        2          COLHDG('Flag 07  ........')
     A            AC9F080       10          COLHDG('Flag 08  ........')
     A            AC9F090       10          COLHDG('Flag 09  ........')
     A            AC9F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : MPRID2F0                                  *
     *  DESCRIZIONE   : Dettaglio 2° MP per Rintracciabilità      *
     *                  Mp usate per miscelazione                 *
     *  PREFISSO      : AD1                                       *
     ****************************************************************
     A            AD1STX0        1          COLHDG('Stato ...........')
     A            AD1USE0       10          COLHDG('Utente immissione')
     A            AD1DAE0        8  0       COLHDG('Data immissione .')
     A            AD1ORE0        6  0       COLHDG('Ora immissione...')
     A            AD1PGM0       10          COLHDG('Programma immiss.')
     A            AD1NRX0        9  0       COLHDG('Numero Azione ...')
     A            AD1CAZ0        4          COLHDG('Codice azione....')
     A            AD1USA0       10          COLHDG('Utente aggiornam.')
     A            AD1DAA0        8  0       COLHDG('Data aggiornam...')
     A            AD1ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AD1PGA0       10          COLHDG('Programma aggior.')
     *
     A            AD1QTU0       12  3       COLHDG('Q.tà  miscelata .')
     A            AD1NLO0        9  0       COLHDG('Lotto miscelata .')
     A            AD1DAT0        8  0       COLHDG('Data  miscelata .')
     A            AD1NRP0        9  0       COLHDG('Numero progressi.')
     A            AD1NRI0        4  0       COLHDG('Numero riga .....')
     A            AD1NRR0        4  0       COLHDG('Numero riga lotto')
     A            AD1NRS0        9  0       COLHDG('NRSES di MOMAM ..')
     A            AD1NRM0        4  0       COLHDG('NRMOV di MOMAM ..')
     A            AD1SIL0        6          COLHDG('Silos prelievo ..')
     *
     A            AD1F010        2          COLHDG('Flag 01  ........')
     A            AD1F020        2          COLHDG('Flag 02  ........')
     A            AD1F030        2          COLHDG('Flag 03  ........')
     A            AD1F040        2          COLHDG('Flag 04  ........')
     A            AD1F050        2          COLHDG('Flag 05  ........')
     A            AD1F060        2          COLHDG('Flag 06  ........')
     A            AD1F070        2          COLHDG('Flag 07  ........')
     A            AD1F080       10          COLHDG('Flag 08  ........')
     A            AD1F090       10          COLHDG('Flag 09  ........')
     A            AD1F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CARTSTF0                                  *
     *  DESCRIZIONE   : Cartellini stampati per lotto             *
     *  PREFISSO      : AD2                                       *
     ****************************************************************
     A            AD2STX0        1          COLHDG('Stato ...........')
     A            AD2USE0       10          COLHDG('Utente immissione')
     A            AD2DAE0        8  0       COLHDG('Data immissione .')
     A            AD2ORE0        6  0       COLHDG('Ora immissione...')
     A            AD2PGM0       10          COLHDG('Programma immiss.')
     A            AD2NRX0        9  0       COLHDG('Numero Azione ...')
     A            AD2CAZ0        4          COLHDG('Codice azione....')
     A            AD2USA0       10          COLHDG('Utente aggiornam.')
     A            AD2DAA0        8  0       COLHDG('Data aggiornam...')
     A            AD2ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AD2PGA0       10          COLHDG('Programma aggior.')
     *
     A            AD2STB0        3          COLHDG('Codice stabilim..')
     A            AD2MAG0        3          COLHDG('Codice magazzino.')
     A            AD2NRI0        9  0       COLHDG('Num.lotto interno')
     A            AD2DAT0        8  0       COLHDG('Dat.lotto interno')
     A            AD2PRO0       15          COLHDG('Codice prodotto .')
     A            AD2ART0        6          COLHDG('Cod.Articolo.....')
     A            AD2CME0        6          COLHDG('Cod.Medicazione..')
     A            AD2NRC0        5  0       COLHDG('Numero cartellini')
     A            AD2DAS0        8  0       COLHDG('Data stampa .....')
     A            AD2ORS0        6  0       COLHDG('Ora  stampa .....')
     *
     A            AD2F010        2          COLHDG('Flag 01  ........')
     A            AD2F020        2          COLHDG('Flag 02  ........')
     A            AD2F030        2          COLHDG('Flag 03  ........')
     A            AD2F040        2          COLHDG('Flag 04  ........')
     A            AD2F050        2          COLHDG('Flag 05  ........')
     A            AD2F060        2          COLHDG('Flag 06  ........')
     A            AD2F070        2          COLHDG('Flag 07  ........')
     A            AD2F080       10          COLHDG('Flag 08  ........')
     A            AD2F090       10          COLHDG('Flag 09  ........')
     A            AD2F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : NUMDOTF0                                  *
     *  DESCRIZIONE   : Testata numeratori documenti              *
     *  PREFISSO      : AD3                                       *
     ****************************************************************
     A            AD3STX0        1          COLHDG('Stato ...........')
     A            AD3USE0       10          COLHDG('Utente immissione')
     A            AD3DAE0        8  0       COLHDG('Data immissione .')
     A            AD3ORE0        6  0       COLHDG('Ora immissione...')
     A            AD3PGE0       10          COLHDG('Programma immiss.')
     A            AD3NRX0        9  0       COLHDG('Numero Azione ...')
     A            AD3CAZ0        4          COLHDG('Codice azione....')
     A            AD3USA0       10          COLHDG('Utente aggiornam.')
     A            AD3DAA0        8  0       COLHDG('Data aggiornam...')
     A            AD3ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AD3PGA0       10          COLHDG('Programma aggior.')
     *
     A            AD3STB0        3          COLHDG('Codice stabilim..')
     A            AD3MAG0        3          COLHDG('Codice magazzino.')
     A            AD3TIP0        3          COLHDG('Tipo documento...')
     A            AD3PGM0       10          COLHDG('Progr.chiamante..')
     A            AD3NRI0        4  0       COLHDG('Numero interno ..')
     A            AD3SIG0        4          COLHDG('Sigla documento..')
     A            AD3CAU0        3          COLHDG('Causale contabile')
     A            AD3REG0        2          COLHDG('Cod.regis.vendite')
     A            AD3DNU0        6  0       COLHDG('Da numero docum. ')
     A            AD3ANU0        6  0       COLHDG('A  numero docum. ')
     A            AD3CAN0        3          COLHDG('Causale nota cred')
     A            AD3CAD0        3          COLHDG('Causale nota debi')
     A            AD3CA10        3          COLHDG('Causale generica.')
     A            AD3CA20        3          COLHDG('Causale generica.')
     A            AD3CA30        3          COLHDG('Causale generica.')
     *
     A            AD3F010        2          COLHDG('SI/NO causale cnt')
     A            AD3F020        2          COLHDG('Flag 02  ........')
     A            AD3F030        2          COLHDG('Flag 03  ........')
     A            AD3F040        2          COLHDG('Flag 04  ........')
     A            AD3F050        2          COLHDG('Flag 05  ........')
     A            AD3F060        2          COLHDG('Flag 06  ........')
     A            AD3F070        2          COLHDG('Flag 07  ........')
     A            AD3F080       10          COLHDG('Flag 08  ........')
     A            AD3F090       10          COLHDG('Flag 09  ........')
     A            AD3F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : NUMDODF0                                  *
     *  DESCRIZIONE   : Dettaglio numeratori documenti            *
     *  PREFISSO      : AD4                                       *
     ****************************************************************
     A            AD4STX0        1          COLHDG('Stato ...........')
     A            AD4USE0       10          COLHDG('Utente immissione')
     A            AD4DAE0        8  0       COLHDG('Data immissione .')
     A            AD4ORE0        6  0       COLHDG('Ora immissione...')
     A            AD4PGE0       10          COLHDG('Programma immiss.')
     A            AD4NRX0        9  0       COLHDG('Numero Azione ...')
     A            AD4CAZ0        4          COLHDG('Codice azione....')
     A            AD4USA0       10          COLHDG('Utente aggiornam.')
     A            AD4DAA0        8  0       COLHDG('Data aggiornam...')
     A            AD4ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AD4PGA0       10          COLHDG('Programma aggior.')
     *
     A            AD4NRI0        4  0       COLHDG('Numero interno ..')
     A            AD4ANN0        4  0       COLHDG('Anno documento...')
     A            AD4NUM0        6  0       COLHDG('Numero documento.')
     *
     A            AD4F010        2          COLHDG('Flag 01  ........')
     A            AD4F020        2          COLHDG('Flag 02  ........')
     A            AD4F030        2          COLHDG('Flag 03  ........')
     A            AD4F040        2          COLHDG('Flag 04  ........')
     A            AD4F050        2          COLHDG('Flag 05  ........')
     A            AD4F060        2          COLHDG('Flag 06  ........')
     A            AD4F070        2          COLHDG('Flag 07  ........')
     A            AD4F080       10          COLHDG('Flag 08  ........')
     A            AD4F090       10          COLHDG('Flag 09  ........')
     A            AD4F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : NUMDORF0                                  *
     *  DESCRIZIONE   : Dettaglio numeri a recupero.              *
     *  PREFISSO      : AD5                                       *
     ****************************************************************
     A            AD5STX0        1          COLHDG('Stato ...........')
     A            AD5USE0       10          COLHDG('Utente immissione')
     A            AD5DAE0        8  0       COLHDG('Data immissione .')
     A            AD5ORE0        6  0       COLHDG('Ora immissione...')
     A            AD5PGE0       10          COLHDG('Programma immiss.')
     A            AD5NRX0        9  0       COLHDG('Numero Azione ...')
     A            AD5CAZ0        4          COLHDG('Codice azione....')
     A            AD5USA0       10          COLHDG('Utente aggiornam.')
     A            AD5DAA0        8  0       COLHDG('Data aggiornam...')
     A            AD5ORA0        6  0       COLHDG('Ora aggiornam....')
     A            AD5PGA0       10          COLHDG('Programma aggior.')
     *
     A            AD5NRI0        4  0       COLHDG('Numero interno ..')
     A            AD5ANN0        4  0       COLHDG('Anno documento...')
     A            AD5NRR0        4  0       COLHDG('Numero progressi.')
     A            AD5DAT0        8  0       COLHDG('Data   documento.')
     A            AD5NUM0        6  0       COLHDG('Numero documento.')
     *
     A            AD5F010        2          COLHDG('Flag 01  ........')
     A            AD5F020        2          COLHDG('Flag 02  ........')
     A            AD5F030        2          COLHDG('Flag 03  ........')
     A            AD5F040        2          COLHDG('Flag 04  ........')
     A            AD5F050        2          COLHDG('Flag 05  ........')
     A            AD5F060        2          COLHDG('Flag 06  ........')
     A            AD5F070        2          COLHDG('Flag 07  ........')
     A            AD5F080       10          COLHDG('Numero ordine rec')
     A            AD5F090       10          COLHDG('Data controllo...')
     A            AD5F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : PROCUBF0                                  *
     *  DESCRIZIONE   : Produzione cubettatura.                   *
     *  PREFISSO      : AD6                                       *
     ****************************************************************
     A            AD6STX0        1          COLHDG('Stato ..............')
     *
     A            AD6USX0       10          COLHDG('Utente immissione...')
     A            AD6DAX0        8S 0       COLHDG('Data immissione.....')
     A            AD6ORX0        6S 0       COLHDG('Ora immissione......')
     A            AD6PGX0       10          COLHDG('Progr.immissione....')
     A            AD6CAZ0        4          COLHDG('Codice Azione ......')
     A            AD6USA0       10          COLHDG('Utente Variazione...')
     A            AD6DAA0        8S 0       COLHDG('Data variazione.....')
     A            AD6ORA0        6S 0       COLHDG('Ora variazione......')
     A            AD6PGV0       10          COLHDG('Progr.variazione....')
     *
     A            AD6STB0        3          COLHDG('Codice stabilimento.')
     A            AD6MAG0        3          COLHDG('Codice magazzino....')
     A            AD6NRI0        9  0       COLHDG('Numero lotto .......')
     A            AD6DAT0        8  0       COLHDG('Data   produzione...')
     A            AD6ORF0        6  0       COLHDG('Ora    produzione...')
     A            AD6LOT0       15          COLHDG('Lotto comp.processo.')
     A            AD6PRO0       15          COLHDG('Codice prodotto.....')
     A            AD6UNI0        2          COLHDG('Unità di misura.....')
     A            AD6QTA0       12  3       COLHDG('Quantità da lavorare')
     A            AD6QTP0       12  3       COLHDG('Quantità lavorata...')
     A            AD6DAI0        8  0       COLHDG('Data inizio operaz..')
     A            AD6ORI0        6  0       COLHDG('Ora  inizio operaz..')
     A            AD6DAO0        8  0       COLHDG('Data fine operazione')
     A            AD6ORO0        6  0       COLHDG('Ora  fine operazione')
     A            AD6OPE0        3          COLHDG('Operazione eseguita.')
     A            AD6TUR0        1          COLHDG('Turno ..............')
     A            AD6IMP0        3          COLHDG('Codice impianto.....')
     A            AD6MAC0        3          COLHDG('Codice macchina.....')
     A            AD6MAT0        5          COLHDG('Matricola dipendente')
     A            AD6SIP0        6          COLHDG('Silos di prelievo...')
     A            AD6SIL0        6          COLHDG('Silos di destinazion')
     A            AD6NS10        9  0       COLHDG('Num.sess.versamento.')
     A            AD6PRE0       15          COLHDG('Prodotto a recupero.')
     A            AD6URE0        2          COLHDG('Unità di misura.....')
     A            AD6QRE0       12  3       COLHDG('Quantità a recupero.')
     A            AD6QRP0       12  3       COLHDG('Quantità previs.rec.')
     A            AD6SIR0        6          COLHDG('Silos per recupero..')
     A            AD6TRF0       15          COLHDG('Codice trafila .....')
     *
     A            AD6F010        2          COLHDG('Temperatura (°C) ...')
     A            AD6F020        2          COLHDG('Durabilità  (%) ....')
     A            AD6F030        2          COLHDG('Flag 03  ...........')
     A            AD6F040        2          COLHDG('Flag 04  ...........')
     A            AD6F050        2          COLHDG('Flag 05  ...........')
     A            AD6F060        2          COLHDG('Flag 06  ...........')
     A            AD6F070        2          COLHDG('Flag 07  ...........')
     A            AD6F080       10          COLHDG('Flag 08  ...........')
     A            AD6F090       10          COLHDG('Flag 09  ...........')
     A            AD6F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : PROSCFF0                                  *
     *  DESCRIZIONE   : ProdOTTI Schiacciati da considerare Farina*
     *  PREFISSO      : AD7                                       *
     ****************************************************************
     A            AD7STX0        1          COLHDG('Stato ..............')
     *
     A            AD7USX0       10          COLHDG('Utente immissione...')
     A            AD7DAX0        8S 0       COLHDG('Data immissione.....')
     A            AD7ORX0        6S 0       COLHDG('Ora immissione......')
     A            AD7PGX0       10          COLHDG('Progr.immissione....')
     A            AD7CAZ0        4          COLHDG('Codice Azione ......')
     A            AD7USA0       10          COLHDG('Utente Variazione...')
     A            AD7DAA0        8S 0       COLHDG('Data variazione.....')
     A            AD7ORA0        6S 0       COLHDG('Ora variazione......')
     A            AD7PGV0       10          COLHDG('Progr.variazione....')
     *
     A            AD7STB0        3          COLHDG('Codice stabilimento.')
     A            AD7MAG0        3          COLHDG('Codice magazzino....')
     A            AD7PRO0       15          COLHDG('Prodotto ...........')
     *
     A            AD7F010        2          COLHDG('Flag 01  ...........')
     A            AD7F020        2          COLHDG('Flag 02  ...........')
     A            AD7F030        2          COLHDG('Flag 03  ...........')
     A            AD7F040        2          COLHDG('Flag 04  ...........')
     A            AD7F050        2          COLHDG('Flag 05  ...........')
     A            AD7F060        2          COLHDG('Flag 06  ...........')
     A            AD7F070        2          COLHDG('Flag 07  ...........')
     A            AD7F080       10          COLHDG('Flag 08  ...........')
     A            AD7F090       10          COLHDG('Flag 09  ...........')
     A            AD7F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : CLISCDF0                                  *
     *  DESCRIZIONE   : Clienti soccide                           *
     *  PREFISSO      : AD8                                       *
     ****************************************************************
     A            AD8STX0        1          COLHDG('Stato ..............')
     *
     A            AD8USX0       10          COLHDG('Utente immissione...')
     A            AD8DAX0        8S 0       COLHDG('Data immissione.....')
     A            AD8ORX0        6S 0       COLHDG('Ora immissione......')
     A            AD8PGX0       10          COLHDG('Progr.immissione....')
     A            AD8CAZ0        4          COLHDG('Codice Azione ......')
     A            AD8USA0       10          COLHDG('Utente Variazione...')
     A            AD8DAA0        8S 0       COLHDG('Data variazione.....')
     A            AD8ORA0        6S 0       COLHDG('Ora variazione......')
     A            AD8PGV0       10          COLHDG('Progr.variazione....')
     *
     A            AD8CLI0        6          COLHDG('Cliente ............')
     A            AD8STD0        3          COLHDG('Stabilimento destin.')
     A            AD8MGD0        3          COLHDG('Magazzino destinaz..')
     A            AD8CC10       12          COLHDG('Centro di costo 1...')
     A            AD8PC10        5  2       COLHDG('Percentuale     1...')
     A            AD8CC20       12          COLHDG('Centro di costo 2...')
     A            AD8PC20        5  2       COLHDG('Percentuale     2...')
     A            AD8CC30       12          COLHDG('Centro di costo 3...')
     A            AD8PC30        5  2       COLHDG('Percentuale     3...')
     *
     A            AD8F010        2          COLHDG('Flag 01  ...........')
     A            AD8F020        2          COLHDG('Flag 02  ...........')
     A            AD8F030        2          COLHDG('Flag 03  ...........')
     A            AD8F040        2          COLHDG('Flag 04  ...........')
     A            AD8F050        2          COLHDG('Flag 05  ...........')
     A            AD8F060        2          COLHDG('Flag 06  ...........')
     A            AD8F070        2          COLHDG('Flag 07  ...........')
     A            AD8F080       10          COLHDG('Flag 08  ...........')
     A            AD8F090       10          COLHDG('Flag 09  ...........')
     A            AD8F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  ARCHIVIO      : DREYF1F0                                  *
     *  DESCRIZIONE   : Tracciato record Dreyfus                  *
     *  PREFISSO      : DF                                        *
     ****************************************************************
     A            SDFDEP0        2S 0       COLHDG('Deposito ........')
     A            SDFDTB0        6S 0       COLHDG('Data bolla ......')
     A            SDFNRB0       10S 0       COLHDG('Numero bolla ....')
     A            SDFQTA0       10S 0       COLHDG('Quantità ........')
     A            SDFCLI0        6S 0       COLHDG('Cliente .........')
     A            SDFANN0        2S 0       COLHDG('Anno ordine .....')
     A            SDFNRO0        6S 0       COLHDG('Num. ordine .....')
     A            SDFRIG0        4S 0       COLHDG('Riga ordine .....')
     A            SDFFL10        6S 0       COLHDG('Vuoto ...........')
     A            SDFPAF0       12A         COLHDG('Partita fornitore')
     A            SDFINC0        8S 0       COLHDG('Incassi .........')
     A            SDFFL20        6S 0       COLHDG('Vuoto ...........')
     ****************************************************************
     *  TABELLA       : PROMOLF0                                  *
     *  DESCRIZIONE   : Produzione da molini.                     *
     *  PREFISSO      : AD9                                       *
     ****************************************************************
     A            AD9STX0        1          COLHDG('Stato ..............')
     *
     A            AD9USX0       10          COLHDG('Utente immissione...')
     A            AD9DAX0        8S 0       COLHDG('Data immissione.....')
     A            AD9ORX0        6S 0       COLHDG('Ora immissione......')
     A            AD9PGX0       10          COLHDG('Progr.immissione....')
     A            AD9CAZ0        4          COLHDG('Codice Azione ......')
     A            AD9USA0       10          COLHDG('Utente Variazione...')
     A            AD9DAA0        8S 0       COLHDG('Data variazione.....')
     A            AD9ORA0        6S 0       COLHDG('Ora variazione......')
     A            AD9PGV0       10          COLHDG('Progr.variazione....')
     *
     A            AD9STB0        3          COLHDG('Codice stabilimento.')
     A            AD9MAG0        3          COLHDG('Codice magazzino....')
     A            AD9MAT0        5          COLHDG('Matricola dipendente')
     A            AD9TUR0        1          COLHDG('Turno ..............')
     A            AD9IMP0        3          COLHDG('Codice impianto.....')
     A            AD9MAC0        3          COLHDG('Codice macchina.....')
     A            AD9TRF0       15          COLHDG('Codice trafila .....')
     A            AD9DAI0        8  0       COLHDG('Data inizio operaz..')
     A            AD9ORI0        6  0       COLHDG('Ora  inizio operaz..')
     A            AD9DAO0        8  0       COLHDG('Data fine operazione')
     A            AD9ORO0        6  0       COLHDG('Ora  fine operazione')
     A            AD9NS10        9  0       COLHDG('Num.sess.versamento.')
     *
     A            AD9PRP0       15          COLHDG('Prodotto prelevato..')
     A            AD9UNP0        2          COLHDG('Unità di misura.....')
     A            AD9QTP0       12  3       COLHDG('Quantità prelevata..')
     A            AD9SIP0        6          COLHDG('Silos di prelievo...')
     *
     A            AD9PV10       15          COLHDG('Prodotto versato....')
     A            AD9UV10        2          COLHDG('Unità di misura.....')
     A            AD9QV10       12  3       COLHDG('Quantità versata....')
     A            AD9SV10        6          COLHDG('Silos di versamento.')
     *
     A            AD9PV20       15          COLHDG('Prodotto versato....')
     A            AD9UV20        2          COLHDG('Unità di misura.....')
     A            AD9QV20       12  3       COLHDG('Quantità versata....')
     A            AD9SV20        6          COLHDG('Silos di versamento.')
     *
     A            AD9PV30       15          COLHDG('Prodotto versato....')
     A            AD9UV30        2          COLHDG('Unità di misura.....')
     A            AD9QV30       12  3       COLHDG('Quantità versata....')
     A            AD9SV30        6          COLHDG('Silos di versamento.')
     *
     A            AD9PRR0       15          COLHDG('Prodotto a recupero.')
     A            AD9UNR0        2          COLHDG('Unità di misura.....')
     A            AD9QTR0       12  3       COLHDG('Quantità a recupero.')
     A            AD9SIR0        6          COLHDG('Silos per recupero..')
     A            AD9QPR0       12  3       COLHDG('Quantità previs.rec.')
     *
     A            AD9F010        2          COLHDG('Flag 01  ...........')
     A            AD9F020        2          COLHDG('Flag 02  ...........')
     A            AD9F030        2          COLHDG('Flag 03  ...........')
     A            AD9F040        2          COLHDG('Flag 04  ...........')
     A            AD9F050        2          COLHDG('Flag 05  ...........')
     A            AD9F060        2          COLHDG('Flag 06  ...........')
     A            AD9F070        2          COLHDG('Flag 07  ...........')
     A            AD9F080       10          COLHDG('Numero lotto .......')
     A            AD9F090       10          COLHDG('Flag 09  ...........')
     A            AD9F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : ABIUTEF0                                  *
     *  DESCRIZIONE   : Abilitazioni Utente.                      *
     *  PREFISSO      : AU0                                       *
     ****************************************************************
     A            AU0STX0        1          COLHDG('Stato ..............')
     *
     A            AU0USX0       10          COLHDG('Utente immissione...')
     A            AU0DAX0        8S 0       COLHDG('Data immissione.....')
     A            AU0ORX0        6S 0       COLHDG('Ora immissione......')
     A            AU0PGX0       10          COLHDG('Progr.immissione....')
     A            AU0CAZ0        4          COLHDG('Codice Azione ......')
     A            AU0USA0       10          COLHDG('Utente Variazione...')
     A            AU0DAA0        8S 0       COLHDG('Data variazione.....')
     A            AU0ORA0        6S 0       COLHDG('Ora variazione......')
     A            AU0PGV0       10          COLHDG('Progr.variazione....')
     *
     A            AU0UTE0       10          COLHDG('Codice Utente.......')
     A            AU0PRG0       10          COLHDG('Nome Programma......')
     A            AU0DES0       30          COLHDG('Des. Programma......')
     ****************************************************************
     *  TABELLA       : NUMDOFF0                                  *
     *  DESCRIZIONE   : Dettaglio numeri fattura prenotati        *
     *  PREFISSO      : AE1                                       *
     ****************************************************************
     A            AE1STX0        1          COLHDG('Stato ..............')
     A            AE1USE0       10          COLHDG('Utente immissione...')
     A            AE1DAE0        8  0       COLHDG('Data immissione ....')
     A            AE1ORE0        6  0       COLHDG('Ora immissione......')
     A            AE1PGE0       10          COLHDG('Programma immissione')
     A            AE1NRX0        9  0       COLHDG('Numero Azione ......')
     A            AE1CAZ0        4          COLHDG('Codice azione.......')
     A            AE1USA0       10          COLHDG('Utente aggiornamento')
     A            AE1DAA0        8  0       COLHDG('Data aggiornamento..')
     A            AE1ORA0        6  0       COLHDG('Ora aggiornamento...')
     A            AE1PGA0       10          COLHDG('Programma aggiornam.')
     *
     A            AE1NUB0        6  0       COLHDG('Numero bolla .......')
     A            AE1SIB0        4          COLHDG('Sigla  bolla .......')
     A            AE1DAB0        8  0       COLHDG('Data   bolla .......')
     A            AE1NUF0        6  0       COLHDG('Numero fattura .....')
     A            AE1SIF0        4          COLHDG('Sigla  fattura .....')
     A            AE1DAF0        8  0       COLHDG('Data   fattura .....')
     *
     A            AE1F010        2          COLHDG('Flag 01  ...........')
     A            AE1F020        2          COLHDG('Flag 02  ...........')
     A            AE1F030        2          COLHDG('Flag 03  ...........')
     A            AE1F040        2          COLHDG('Flag 04  ...........')
     A            AE1F050        2          COLHDG('Flag 05  ...........')
     A            AE1F060        2          COLHDG('Flag 06  ...........')
     A            AE1F070        2          COLHDG('Flag 07  ...........')
     A            AE1F080       10          COLHDG('Flag 08  ...........')
     A            AE1F090       10          COLHDG('Flag 09  ...........')
     A            AE1F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : PRESEEF0                                  *
     *  DESCRIZIONE   : Presenze estemporanee.                    *
     *  PREFISSO      : AE2                                       *
     ****************************************************************
     A            AE2STX0        1          COLHDG('Stato ..............')
     A            AE2USE0       10          COLHDG('Utente immissione...')
     A            AE2DAE0        8  0       COLHDG('Data immissione ....')
     A            AE2ORE0        6  0       COLHDG('Ora immissione......')
     A            AE2PGE0       10          COLHDG('Programma immissione')
     A            AE2NRX0        9  0       COLHDG('Numero Azione ......')
     A            AE2CAZ0        4          COLHDG('Codice azione.......')
     A            AE2USA0       10          COLHDG('Utente aggiornamento')
     A            AE2DAA0        8  0       COLHDG('Data aggiornamento..')
     A            AE2ORA0        6  0       COLHDG('Ora aggiornamento...')
     A            AE2PGA0       10          COLHDG('Programma aggiornam.')
     *
     A            AE2MAG0        3          COLHDG('Codice magazzino....')
     A            AE2DAI0        8  0       COLHDG('Ingresso data.......')
     A            AE2ORI0        6  0       COLHDG('Ingresso ora........')
     A            AE2DAU0        8  0       COLHDG('Uscita data.........')
     A            AE2ORU0        6  0       COLHDG('Uscita ora..........')
     A            AE2BDG0       10          COLHDG('Numero badge........')
     A            AE2NOM0       40          COLHDG('Nominativo..........')
     A            AE2SOC0       40          COLHDG('Società.............')
     A            AE2TID0        3          COLHDG('Tipo documento......')
     A            AE2NUD0       20          COLHDG('Numero documento....')
     A            AE2TAR0       10          COLHDG('Numero targa........')
     A            AE2NO10       80          COLHDG('Nota 1 .............')
     A            AE2NO20       80          COLHDG('Nota 2 .............')
     A            AE2NUM0        9  0       COLHDG('Ultimo numero.......')
     A            AE2DEV0       40          COLHDG('Destinatario visita.')
     *
     A            AE2F010        2          COLHDG('Flag 01  ...........')
     A            AE2F020        2          COLHDG('Flag 02  ...........')
     A            AE2F030        2          COLHDG('Flag 03  ...........')
     A            AE2F040        2          COLHDG('Flag 04  ...........')
     A            AE2F050        2          COLHDG('Flag 05  ...........')
     A            AE2F060        2          COLHDG('Flag 06  ...........')
     A            AE2F070        2          COLHDG('Flag 07  ...........')
     A            AE2F080       10          COLHDG('Flag 08  ...........')
     A            AE2F090       10          COLHDG('Flag 09  ...........')
     A            AE2F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : TABGLLF0                                  *
     *  DESCRIZIONE   : ARCHIVIO TABELLE                          *
     *  PREFISSO      : T44                                       *
     *  SEZIONE       : TABELLA TIPI DOCUMENTO OSPITI             *
     *  TABELLA LAVORO: TABE44                                    *
     ****************************************************************
     A            T44DA0        40          COLHDG('Descrizione tipo doc')
     ****************************************************************
     *  TABELLA       : RESCL6F0                                  *
     *  DESCRIZIONE   : Fogli verdi processati.                   *
     *  PREFISSO      : AE3                                       *
     ****************************************************************
     A            AE3STX0        1          COLHDG('Stato ..............')
     A            AE3USE0       10          COLHDG('Utente immissione...')
     A            AE3DAE0        8  0       COLHDG('Data immissione ....')
     A            AE3ORE0        6  0       COLHDG('Ora immissione......')
     A            AE3PGE0       10          COLHDG('Programma immissione')
     A            AE3CAZ0        4          COLHDG('Codice azione.......')
     A            AE3USA0       10          COLHDG('Utente aggiornamento')
     A            AE3DAA0        8  0       COLHDG('Data aggiornamento..')
     A            AE3ORA0        6  0       COLHDG('Ora aggiornamento...')
     A            AE3PGA0       10          COLHDG('Programma aggiornam.')
     *
     A            AE3VIA0        9  0       COLHDG('Numero viaggio......')
     A            AE3CLI0        6          COLHDG('Cliente.............')
     A            AE3CAC0        6          COLHDG('Capocatena..........')
     A            AE3VET0        4          COLHDG('Vettore.............')
     A            AE3DAB0        8  0       COLHDG('Bolla data..........')
     A            AE3SIB0        4          COLHDG('Bolla sigla.........')
     A            AE3NUB0        6  0       COLHDG('Bolla numero........')
     A            AE3DAF0        8  0       COLHDG('Fattura data........')
     A            AE3SIF0        4          COLHDG('Fattura sigla.......')
     A            AE3NUF0        6  0       COLHDG('Fattura numero......')
     A            AE3PT10        1          COLHDG('C=C.clie, V=C.vett..')
     A            AE3PD10        4  0       COLHDG('Pallet documento....')
     A            AE3PR10        4  0       COLHDG('Pallet riscontrati..')
     A            AE3ET10        1          COLHDG('C=C.clie, V=C.vett..')
     A            AE3ED10        4  0       COLHDG('Europallet documento')
     A            AE3ER10        4  0       COLHDG('Europallet riscontr.')
     A            AE3SEG0        1          COLHDG('P=processato........')
     *
     A            AE3F010        2          COLHDG('Flag 01  ...........')
     A            AE3F020        2          COLHDG('Flag 02  ...........')
     A            AE3F030        2          COLHDG('Flag 03  ...........')
     A            AE3F040        2          COLHDG('Flag 04  ...........')
     A            AE3F050        2          COLHDG('Flag 05  ...........')
     A            AE3F060        2          COLHDG('Flag 06  ...........')
     A            AE3F070        2          COLHDG('Flag 07  ...........')
     A            AE3F080       10          COLHDG('Flag 08  ...........')
     A            AE3F090       10          COLHDG('Flag 09  ...........')
     A            AE3F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : INGAUNF0                                  *
     *  DESCRIZIONE   : Note per gestione viaggi.                 *
     *  PREFISSO      : AE4                                       *
     ****************************************************************
     A            AE4STX0        1          COLHDG('Stato ..............')
     A            AE4USE0       10          COLHDG('Utente immissione...')
     A            AE4DAE0        8  0       COLHDG('Data immissione ....')
     A            AE4ORE0        6  0       COLHDG('Ora immissione......')
     A            AE4PGE0       10          COLHDG('Programma immissione')
     A            AE4CAZ0        4          COLHDG('Codice azione.......')
     A            AE4USA0       10          COLHDG('Utente aggiornamento')
     A            AE4DAA0        8  0       COLHDG('Data aggiornamento..')
     A            AE4ORA0        6  0       COLHDG('Ora aggiornamento...')
     A            AE4PGA0       10          COLHDG('Programma aggiornam.')
     *
     A            AE4NMV0        9  0       COLHDG('Numero viaggio .....')
     A            AE4RIG0        4  0       COLHDG('Numero riga ........')
     A            AE4NOT0       78          COLHDG('Nota ...............')
     *
     A            AE4F010        2          COLHDG('Flag 01  ...........')
     A            AE4F020        2          COLHDG('Flag 02  ...........')
     A            AE4F030        2          COLHDG('Flag 03  ...........')
     A            AE4F040        2          COLHDG('Flag 04  ...........')
     A            AE4F050        2          COLHDG('Flag 05  ...........')
     A            AE4F060        2          COLHDG('Flag 06  ...........')
     A            AE4F070        2          COLHDG('Flag 07  ...........')
     A            AE4F080       10          COLHDG('Flag 08  ...........')
     A            AE4F090       10          COLHDG('Flag 09  ...........')
     A            AE4F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  TABELLA       : TABGLLF0                                  *
     *  DESCRIZIONE   : ARCHIVIO TABELLE                          *
     *  PREFISSO      : T45                                       *
     *  SEZIONE       : TABELLA ANAGRAFICO BADGE VISITATORI       *
     *  TABELLA LAVORO: TABE45                                    *
     ****************************************************************
     A            T45NOM0       40          COLHDG('Eventuale nominativo')
     A            T45DAT0        8S 0       COLHDG('Data attivazione....')
     A            T45DDI0        8S 0       COLHDG('Data disattivazione.')
     ****************************************************************
     *  TABELLA       : NIRRF0                                    *
     *  DESCRIZIONE   : Archivio per elaborazione da NIR.         *
     *  PREFISSO      : AE5                                       *
     ****************************************************************
     A            AE5STX0        1          COLHDG('Stato ..............')
     A            AE5USE0       10          COLHDG('Utente immissione...')
     A            AE5DAE0        8  0       COLHDG('Data immissione ....')
     A            AE5ORE0        6  0       COLHDG('Ora immissione......')
     A            AE5PGE0       10          COLHDG('Programma immissione')
     A            AE5CAZ0        4          COLHDG('Codice azione.......')
     *
     A            AE5NUD0        9  0       COLHDG('Numero documento....')
     A            AE5DAD0        8  0       COLHDG('Data   documento....')
     A            AE5UMI0       15  7       COLHDG('Umidità.............')
     A            AE5EUM0        1          COLHDG('Errore .............')
     A            AE5PRO0       15  7       COLHDG('Proteine............')
     A            AE5EPR0        1          COLHDG('Errore .............')
     A            AE5GRA0       15  7       COLHDG('Grassi..............')
     A            AE5EGR0        1          COLHDG('Errore .............')
     A            AE5FIB0       15  7       COLHDG('Fibre...............')
     A            AE5EFI0        1          COLHDG('Errore .............')
     A            AE5CEN0       15  7       COLHDG('Ceneri..............')
     A            AE5ECE0        1          COLHDG('Errore .............')
     A            AE5AMI0       15  7       COLHDG('Amido...............')
     A            AE5EAM0        1          COLHDG('Errore .............')
     A            AE5C010       15  7       COLHDG('Utilizzabile........')
     A            AE5E010        1          COLHDG('Errore .............')
     A            AE5C020       15  7       COLHDG('Utilizzabile........')
     A            AE5E020        1          COLHDG('Errore .............')
     A            AE5C030       15  7       COLHDG('Utilizzabile........')
     A            AE5E030        1          COLHDG('Errore .............')
     A            AE5C040       15  7       COLHDG('Utilizzabile........')
     A            AE5E040        1          COLHDG('Errore .............')
     *
     A            AE5F010        2          COLHDG('Flag 01  ...........')
     A            AE5F020        2          COLHDG('Flag 02  ...........')
     A            AE5F030        2          COLHDG('Flag 03  ...........')
     A            AE5F040        2          COLHDG('Flag 04  ...........')
     A            AE5F050        2          COLHDG('Flag 05  ...........')
     A            AE5F060        2          COLHDG('Flag 06  ...........')
     A            AE5F070        2          COLHDG('Flag 07  ...........')
     A            AE5F080       10          COLHDG('Flag 08  ...........')
     A            AE5F090       10          COLHDG('Flag 09  ...........')
     A            AE5F100       10          COLHDG('Flag 10  ...........')
     ****************************************************************
     *  ARCHIVIO      : MGZI10F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Testata                 *
     *  PREFISSO      : MO1                                       *
     ****************************************************************
     A            MO1STX0        1          COLHDG('Stato ..............')
      *
     A            MO1USX0       10          COLHDG('Utente .............')
     A            MO1SCX0        2S 0       COLHDG('Sec. variazione ....')
     A            MO1ANX0        2S 0       COLHDG('aa.  variazione ....')
     A            MO1MSX0        2S 0       COLHDG('mm.  variazione ....')
     A            MO1GRX0        2S 0       COLHDG('gg.  variazione ....')
     A            MO1ORX0        6  0       COLHDG('Ora agg.to .........')
     A            MO1CAI0        4A         COLHDG('Codice Azione immis.')
     A            MO1CAV0        4A         COLHDG('Codice Azione varia.')
     A            MO1PGI0       10          COLHDG('Programma immissione')
     A            MO1PGV0       10          COLHDG('Programma variazione')
      *
     A            MO1SOC0        2          COLHDG('Società ............')
     A            MO1USE0       10          COLHDG('Utente .............')
     A            MO1SCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MO1ANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MO1MSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MO1GRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MO1SGO0        4          COLHDG('Sig. ordine ........')
     A            MO1NRO0        9S 0       COLHDG('nr.  ordine ........')
      *
     A            MO1SCP0        2S 0       COLHDG('Sec. Richiesta .....')
     A            MO1ANP0        2S 0       COLHDG('aa.  Richiesta .....')
     A            MO1MSP0        2S 0       COLHDG('mm.  Richiesta .....')
     A            MO1GRP0        2S 0       COLHDG('gg.  Richiesta .....')
      *
     A            MO1US10       10          COLHDG('Descrizione nave 1..')
     A            MO1US20       10          COLHDG('Descrizione nave 2..')
     A            MO1US30       10          COLHDG('Descrizione nave 3..')
      *
     A            MO1FO10        6          COLHDG('Fornitore ordine....')
     A            MO1FO20        6          COLHDG('Fornitore bolla ....')
     A            MO1FO30        6          COLHDG('Fornitore fattura...')
     A            MO1MCO0        3          COLHDG('SI=Franco partenz...')
     A            MO1PAG0        3          COLHDG('Pagamento ..........')
     A            MO1MAG0        3          COLHDG('Magazzino ricev. ...')
     A            MO1SCC0        2S 0       COLHDG('Sec. presunta cn....')
     A            MO1ANC0        2S 0       COLHDG('aa.  presunta cn....')
     A            MO1MSC0        2S 0       COLHDG('mm.  presunta cn....')
     A            MO1GRC0        2S 0       COLHDG('gg.  presunta cn....')
     A            MO1VA10       18  5       COLHDG('Valore presunto.....')
     A            MO1EVA0        1          COLHDG('S=Ordine evaso......')
     A            MO1CCO0       12          COLHDG('Centro di costo ....')
     A            MO1VO10        1          COLHDG('Voce spesa pref.....')
     A            MO1VO20       12          COLHDG('Voce di spesa ......')
     A            MO1CON0       12          COLHDG('Conto contabile ....')
     A            MO1UFF0        4          COLHDG('Ufficio / Serviz....')
     A            MO1F010        1          COLHDG('Flag 01 ............')
      *                                             S=Ordine provvis.
     A            MO1F020        1          COLHDG('Flag 02 ............')
     A            MO1F030        1          COLHDG('Flag 03 ............')
     A            MO1F040        1          COLHDG('Flag 04 ............')
     A            MO1F050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MO1F060       10          COLHDG('Data inizio Fat.Nave')
     A            MO1F070       10          COLHDG('Flag 07 ............')
     A            MO1F080       10          COLHDG('Flag 08 ............')
     A            MO1F090       10          COLHDG('Flag 09 ............')
     A            MO1F100       10          COLHDG('Luogo di ritiro.....')
      *                                             Primi 6 bytes
     A            MO1MA20        3          COLHDG('Magazzino di rich...')
     ****************************************************************
     *  ARCHIVIO      : MGZI12F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Disposizione di ritiro  *
     *  PREFISSO      : ME3               prodotti                *
     *                  Il file delle disposizioni di ritiro ha 2 *
     *                  proveninze: Se commercializzati ha come te-*
     *                  stata ORDF11, se materie prime ha come te-*
     *                  stata ORDF33.                             *
     ****************************************************************
     A            ME3STX0        1          COLHDG('Stato ..............')
     A            ME3USE0       10          COLHDG('Utente .............')
     A            ME3SCX0        2S 0       COLHDG('Sec. variazione ....')
     A            ME3ANX0        2S 0       COLHDG('aa.  variazione ....')
     A            ME3MSX0        2S 0       COLHDG('mm.  variazione ....')
     A            ME3GRX0        2S 0       COLHDG('gg.  variazione ....')
     A            ME3ORX0        6  0       COLHDG('Ora agg.to .........')
     A            ME3CAZ0        4A         COLHDG('Codice azione immis.')
     A            ME3CAV0        4A         COLHDG('Codice azione varia.')
     A            ME3PGI0       10          COLHDG('Programma immissione')
     A            ME3PGV0       10          COLHDG('Programma variazione')
      *
     A            ME3ABR0        4S 0       COLHDG('Anno buono ritiro...')
     A            ME3NBR0        6S 0       COLHDG('Num. buono ritiro...')
      *
     A            ME3SOC0        2          COLHDG('Società ............')
     A            ME3SCO0        2S 0       COLHDG('Sec. ordine ........')
     A            ME3ANO0        2S 0       COLHDG('aa.  ordine ........')
     A            ME3MSO0        2S 0       COLHDG('mm.  ordine ........')
     A            ME3GRO0        2S 0       COLHDG('gg.  ordine ........')
     A            ME3SGO0        4          COLHDG('Sig. ordine ........')
     A            ME3NRO0        9S 0       COLHDG('nr.  ordine ........')
     A            ME3NRI0        4S 0       COLHDG('nr.  riga ..........')
      *
     A            ME3PRO0       20          COLHDG('Prodotto ...........')
     A            ME3PRF0       20          COLHDG('Prodotto fornit.....')
     A            ME3QT10       12  3       COLHDG('Q.tà Ritiro ........')
     A            ME3F010        1          COLHDG('P=pagam.al ritiro...')
     A            ME3F020        1          COLHDG('M=omaggio...........')
     A            ME3F030        1          COLHDG('S=Merce fatturata...')
     A            ME3F040        1          COLHDG('Flag 04 ............')
     A            ME3F050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            ME3F060       10          COLHDG('Riferim.disposiz....')
     A            ME3F070       10          COLHDG('Flag 07 ............')
     A            ME3F080       10          COLHDG('Memo Prezzo 4dec....')
     A            ME3F090       10          COLHDG('Data blocco quote...')
     A            ME3F100       10          COLHDG('Vedi sotto .........')
      *                                       byte 1-6  = Codice fornitore x stampa x vendita.
      *                                       byte 8-10 = Codice pagamento cliente x vendita.
     A            ME3NRP0        4S 0       COLHDG('nr.progress.quota...')
      *                                       riguardante (ORDF33)
     A            ME3NRR0        4S 0       COLHDG('nr.progress.disp....')
     A            ME3LUR0        6          COLHDG('Luogo di ritiro ....')
     A            ME3DDC0        8S 0       COLHDG('Da data consegna....')
     A            ME3ADC0        8S 0       COLHDG('A data consegna.....')
     A            ME3MAG0        3          COLHDG('Stabilim.destinaz...')
     A            ME3ZON0        6          COLHDG('Zona di viaggio.....')
     A            ME3PRZ0       18  6       COLHDG('Prezzo unit.al kg...')
     A            ME3PRV0       18  6       COLHDG('Provvigioni in E....')
      *
     A            ME3AND0        4S 0       COLHDG('Anno disposizione...')
     A            ME3NUD0        9S 0       COLHDG('Num. disposizione...')
     A            ME3DAD0        8S 0       COLHDG('Data disposizione...')
     A            ME3CHD0        1          COLHDG('C=Disposiz.chiusa...')
     A            ME3MCO0        3          COLHDG('SI=Franco partenz...')
      *           ------------------------- Informazioni di vendita
     A            ME3VEN0        2          COLHDG('SI=Disp.vendita  ...')
     A            ME3CLI0        6          COLHDG('Cliente vendita  ...')
     A            ME3PR10       18  6       COLHDG('Prezzo unit.al kg...')
     A            ME3MDV0        6          COLHDG('Mediatore...........')
     A            ME3PRM0       18  6       COLHDG('Provvigioni in E....')
     A            ME3PRP0        8  5       COLHDG('% provvigioni.......')
     A            ME3VDR0        2          COLHDG('Vendita dir.SI/NO...')
     A            ME3VSN0       15          COLHDG('Ns.num.contratto....')
     A            ME3VSD0        8  0       COLHDG('Ns.dat.contratto....')
      *           ------------------------- Costi accessori.
     A            ME3CAC0        2          COLHDG('SI/NO   costi acc...')
     A            ME3ICA0       18  6       COLHDG('Importo costi acc...')
     A            ME3FCA0        6          COLHDG('Fornit. costi acc...')
     A            ME3SNC0        2          COLHDG('SI/NO   campioni....')
     A            ME3ICP0       18  6       COLHDG('Importo campionat...')
     A            ME3FCP0        6          COLHDG('Fornit. campionat...')
     A            ME3IMG0       18  6       COLHDG('Importo maggioraz...')
     A            ME3FMG0        6          COLHDG('Fornit. maggioraz...')
     ****************************************************************
     *  ARCHIVIO      : MGZI13F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Testata contratto M.P.  *
     *  PREFISSO      : MOH                                       *
     *  --------------------------------------------------------  *
     *  Contratto (Mgzi10+Mgzi13+Mgzi30)                          *
     *     Quote      (Mgzi33)                                    *
     *         Disposizioni   (Mgzi12)                            *
     *             Ordini ritiro   (Mgzi34)                       *
     *                 Entrate merce    (Mgzi35)                  *
     ****************************************************************
      * Il file MGZI13F0 è legato univocamente all'ordine MGZI10F0. Ogni
      * contratto deve avere uno ed un solo ordine fornitore.
     A            MOHSTX0        1          COLHDG('Stato ..............')
     A            MOHUSX0       10          COLHDG('Utente immissione...')
     A            MOHDAX0        8  0       COLHDG('Data immissione ....')
     A            MOHORX0        6  0       COLHDG('Ora immissione .....')
     A            MOHUSA0       10          COLHDG('Utente aggiornam....')
     A            MOHDAA0        8  0       COLHDG('Data aggiornam. ....')
     A            MOHORA0        6  0       COLHDG('Ora aggiornam. .....')
     A            MOHCAZ0        4A         COLHDG('Codice azione immis.')
     A            MOHCAV0        4A         COLHDG('Codice Azione aggio.')
     A            MOHPGI0       10A         COLHDG('Programma immissione')
     A            MOHPGV0       10A         COLHDG('Programma aggiorname')
     A            MOHSOC0        2          COLHDG('Società ............')
      *
     A            MOHSCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MOHANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MOHMSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MOHGRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MOHSGO0        4          COLHDG('Sig. ordine ........')
     A            MOHNRO0        9S 0       COLHDG('nr.  ordine ........')
     A            MOHNBC0        6S 0       COLHDG('Numero contratto....')
     A            MOHDAC0        8S 0       COLHDG('Data contratto......')
     A            MOHABC0        4S 0       COLHDG('Anno contratto......')
      *
     A            MOHTIP0        1          COLHDG('Tipo decorr.pagam...')
     A            MOHDAF0        8  0       COLHDG('Data fissa pagam....')
     A            MOHMAG0        3          COLHDG('Stabilim.destinaz...')
     A            MOHMED0        6          COLHDG('Mediatore...........')
     A            MOHPRV0       18  6       COLHDG('Provvigioni in E....')
     A            MOHPRP0        8  5       COLHDG('% provvigioni.......')
      * Il prezzo materia prima e tutto quello che riguarda il codice prodotto
      * sono ubicati presso il fileMGZI30F0.
     A            MOHPPR0       18  6       COLHDG('Prezzo provvisor....')
     A            MOHLUR0        6          COLHDG('Luogo di ritiro ....')
     A            MOHZON0        6          COLHDG('Zona di viaggio.....')
     A            MOHSTO0        1          COLHDG('C  = ordine chius...')
     A            MOHSTA0        1          COLHDG('SI/NO ord.stampab...')
     A            MOHNUQ0        4  0       COLHDG('Numero quote .......')
     A            MOHDPQ0        8  0       COLHDG('Data part.quote ....')
     A            MOHPER0        8  0       COLHDG('Periodic.o franch...')
     A            MOHQQT0       12  3       COLHDG('Q.tà per quota .....')
      * Per i contratti viene inserito un solo prodotto per contratto che
      * scrivo nel file Ordf30f0 alla riga n.1 e non inMGZI13F0.
      * Le note di stampa sono quelle diMGZI20F0.
     A            MOHF010        1          COLHDG('Flag 01 ............')
     A            MOHF020        1          COLHDG('S=Campioni .........')
     A            MOHF030        2          COLHDG('Flag 03 ............')
     A            MOHF040        2          COLHDG('Flag 04 ............')
     A            MOHF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MOHF060       10          COLHDG('Num.sess.Momam cari.')
     A            MOHF070        2          COLHDG('Flag 07 ............')
     A            MOHF080        2          COLHDG('Flag 08 ............')
     A            MOHF090        2          COLHDG('Flag 09 ............')
     A            MOHF100        2          COLHDG('Flag 10 ............')
     A            MOHCDR0        2          COLHDG('Contr.dir. SI/NO ...')
     A            MOHVSN0       16          COLHDG('Vs.num.contratto....')
     A            MOHVSD0        8  0       COLHDG('Vs.dat.contratto....')
     A            MOHCAC0        2          COLHDG('SI/NO   costi acc...')
     A            MOHICA0       18  6       COLHDG('Importo costi acc...')
     A            MOHFCA0        6          COLHDG('Fornit. costi acc...')
     A            MOHICP0       18  6       COLHDG('Importo campionat...')
     A            MOHFCP0        6          COLHDG('Fornit. campionat...')
     A            MOHIMG0       18  6       COLHDG('Importo maggioraz...')
     A            MOHFMG0        6          COLHDG('Fornit. maggioraz...')
     ****************************************************************
     *  ARCHIVIO      : MGZI30F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Righe                   *
     *  PREFISSO      : MO3                                       *
     ****************************************************************
     A            MO3STX0        1          COLHDG('Stato ..............')
     A            MO3USE0       10          COLHDG('Utente .............')
     A            MO3SCX0        2S 0       COLHDG('Sec. variazione ....')
     A            MO3ANX0        2S 0       COLHDG('aa.  variazione ....')
     A            MO3MSX0        2S 0       COLHDG('mm.  variazione ....')
     A            MO3GRX0        2S 0       COLHDG('gg.  variazione ....')
     A            MO3ORX0        6S 0       COLHDG('Ora agg.to .........')
     A            MO3CAI0        4A         COLHDG('Codice azione immis.')
     A            MO3CAV0        4A         COLHDG('Codice azione varia.')
     A            MO3PGI0       10A         COLHDG('Programma immissione')
     A            MO3PGV0       10A         COLHDG('Programma variazione')
      *
     A            MO3SOC0        2          COLHDG('Società ............')
     A            MO3SCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MO3ANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MO3MSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MO3GRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MO3SGO0        4          COLHDG('Sig. ordine ........')
     A            MO3NRO0        9S 0       COLHDG('nr.  ordine ........')
     A            MO3NRI0        4S 0       COLHDG('nr.  riga ..........')
      *
     A            MO3PRO0       20          COLHDG('Prodotto ...........')
      ****        MO3PRF0       20          COLHDG('Prodotto fornit.....')
      ****        MO3DE10       40          COLHDG('Descrizione 1 ......')
      ****        MO3DE20       40          COLHDG('Descrizione 2 ......')
      ****        MO3DE30       40          COLHDG('Descrizione 3 ......')
      ****        MO3DE40       40          COLHDG('Descrizione 4 ......')
     A            MO3QT10       12  3       COLHDG('Q.tà ordinata ......')
     A            MO3UM10        2          COLHDG('u.misura ordine.....')
     A            MO3PR10       18  6       COLHDG('Prezzo listino......')
      ****        MO3COE0       12  8       COLHDG('Coeffic.conversione.')
      ****        MO3PRM0       18  6       COLHDG('Prezzo in valuta....')
      ****        MO3MON0        3          COLHDG('Moneta .............')
      ****        MO3UM20        2          COLHDG('u.misura prezzo.....')
      ****        MO3SC10        5  2       COLHDG('Sconto 1 % .........')
      ****        MO3SC20        5  2       COLHDG('Sconto 2 % .........')
      ****        MO3SC30        5  2       COLHDG('Sconto 3 % .........')
      ****        MO3SC40        5  2       COLHDG('Sconto 4 % .........')
      ****        MO3SC50        5  2       COLHDG('Sconto 5 % .........')
      ****        MO3SCL0       18  6       COLHDG('Sconto in lire......')
      ****        MO3PR20       18  6       COLHDG('Prezzo netto........')
      ****        MO3QT20       12  3       COLHDG('Q.tà presunta.......')
      ****        MO3VA10       18  6       COLHDG('Valore netto .......')
      ****        MO3VA20       18  6       COLHDG('Valore netto Mon....')
     A            MO3PI10        5  2       COLHDG('% Iva ..............')
      ****        MO3VI10       18  6       COLHDG('Valore ivato .......')
     A            MO3F010        1          COLHDG('Messa a disposiz....')
     A            MO3F020        1          COLHDG('M=omaggio...........')
     A            MO3F030        1          COLHDG('C = Ordine chiuso...')
     A            MO3F040        1          COLHDG('Flag 04 ............')
     A            MO3F050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MO3F060       10          COLHDG('Flag 06.............')
      *                                             i primi due byte di MO3F060
      *                                             sono l'Aspetto Esteriore per
      *                                             il contratto (MGZI13F0).
     A            MO3F070       10          COLHDG('Flag 07 ............')
     A            MO3F080       10          COLHDG('Flag 08 ............')
     A            MO3F090       10          COLHDG('Flag 09 ............')
     A            MO3F100       10          COLHDG('Flag 10 ............')
     A            MO3CCO0       12          COLHDG('Centro di costo ....')
     A            MO3VO10        1          COLHDG('Voce spesa pref.....')
     A            MO3VO20       12          COLHDG('Voce di spesa ......')
     A            MO3CON0       12          COLHDG('Conto contabile ....')
     A            MO3NRF0        9S 0       COLHDG('Num.rec.offerta.....')
     ****************************************************************
     *  ARCHIVIO      : MGZI33F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Righe quote contratti   *
     *  PREFISSO      : MOI                                       *
     ****************************************************************
     A            MOISTX0        1          COLHDG('Stato ..............')
     A            MOIUSX0       10          COLHDG('Utente immissione...')
     A            MOIDAX0        8S 0       COLHDG('Data immissione ....')
     A            MOIORX0        6S 0       COLHDG('Ora immissione .....')
     A            MOIUSA0       10          COLHDG('Utente aggiornam....')
     A            MOIDAA0        8S 0       COLHDG('Data aggiornam. ....')
     A            MOIORA0        6S 0       COLHDG('Ora aggiornam. .....')
     A            MOICAZ0        4A         COLHDG('Codice azione immis.')
     A            MOICAV0        4A         COLHDG('Codice azione modif.')
     A            MOIPGI0       10A         COLHDG('Programma immissione')
     A            MOIPGV0       10A         COLHDG('Programma variazione')
     A            MOISOC0        2          COLHDG('Società ............')
      *
     A            MOISCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MOIANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MOIMSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MOIGRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MOISGO0        4          COLHDG('Sig. ordine ........')
     A            MOINRO0        9S 0       COLHDG('nr.  ordine ........')
     A            MOINRI0        4S 0       COLHDG('nr.  riga ordine....')
     A            MOINRP0        4S 0       COLHDG('nr.progress.quota...')
     A            MOIMAG0        3          COLHDG('Stabilim.destinaz...')
     A            MOILUR0        6          COLHDG('Luogo di ritiro ....')
     A            MOIZON0        6          COLHDG('Zona di viaggio.....')
     A            MOIPRE0        4          COLHDG('Numero quota........')
     A            MOIPRS0        4          COLHDG('Numero sottoquota...')
     A            MOIMCO0        3          COLHDG('SI=Franco partenz...')
     A            MOIDDC0        8S 0       COLHDG('Da data consegna....')
     A            MOIADC0        8S 0       COLHDG('A data consegna.....')
     A            MOIQT10       12  3       COLHDG('Q.tà quota..........')
     A            MOIF010        1          COLHDG('C=Ordine chiuso ....')
     A            MOIF020        1          COLHDG('Flag 02 ............')
     A            MOIF030        2          COLHDG('Flag 03 ............')
     A            MOIF040        2          COLHDG('Flag 04 ............')
     A            MOIF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MOIF060       10          COLHDG('Flag 06 ............')
     A            MOIF070        2          COLHDG('Flag 07 ............')
     A            MOIF080        2          COLHDG('Flag 08 ............')
     A            MOIF090        2          COLHDG('Flag 09 ............')
     A            MOIF100        2          COLHDG('Flag 10 ............')
     A            MOICLI0        6          COLHDG('Codice cliente .....')
     ****************************************************************
     *  ARCHIVIO      : MGZI20F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Note testata            *
     *  PREFISSO      : MO2                                       *
     ****************************************************************
     A            MO2STX0        1          COLHDG('Stato ...........')
     A            MO2USE0       10          COLHDG('Utente ..........')
     A            MO2SCX0        2S 0       COLHDG('Sec. variazione .')
     A            MO2ANX0        2S 0       COLHDG('aa.  variazione .')
     A            MO2MSX0        2S 0       COLHDG('mm.  variazione .')
     A            MO2GRX0        2S 0       COLHDG('gg.  variazione .')
     A            MO2ORX0        6S 0       COLHDG('Ora agg.to ......')
     A            MO2NRX0        9  0       COLHDG('Numero Azione ...')
      *
      *
     A            MO2SOC0        2          COLHDG('Società .........')
     A            MO2SCO0        2S 0       COLHDG('Sec. ordine .....')
     A            MO2ANO0        2S 0       COLHDG('aa.  ordine .....')
     A            MO2MSO0        2S 0       COLHDG('mm.  ordine .....')
     A            MO2GRO0        2S 0       COLHDG('gg.  ordine .....')
     A            MO2SGO0        4          COLHDG('Sig. ordine .....')
     A            MO2NRO0        9S 0       COLHDG('nr.  ordine .....')
     A            MO2NRR0        4S 0       COLHDG('nr.  riga .......')
      *
     A            MO2NOT0       60          COLHDG('Note ............')
     ****************************************************************
     *  ARCHIVIO      : MGZI34F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Righe ordini di ritiro. *
     *  PREFISSO      : MOK                                       *
     ****************************************************************
     A            MOKSTX0        1          COLHDG('Stato ..............')
     A            MOKUSX0       10          COLHDG('Utente immissione...')
     A            MOKDAX0        8S 0       COLHDG('Data immissione ....')
     A            MOKORX0        6  0       COLHDG('Ora immissione .....')
     A            MOKUSA0       10          COLHDG('Utente aggiornam....')
     A            MOKDAA0        8S 0       COLHDG('Data aggiornam. ....')
     A            MOKORA0        6  0       COLHDG('Ora aggiornam. .....')
     A            MOKCAZ0        4A         COLHDG('Codice azione immis.')
     A            MOKCAV0        4A         COLHDG('Codice azione varia.')
     A            MOKPGI0       10A         COLHDG('Programma immissione')
     A            MOKPGV0       10A         COLHDG('Programma variazione')
     A            MOKSOC0        2          COLHDG('Società ............')
      *
     A            MOKSCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MOKANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MOKMSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MOKGRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MOKSGO0        4          COLHDG('Sig. ordine ........')
     A            MOKNRO0        9S 0       COLHDG('nr.  ordine ........')
     A            MOKNRI0        4S 0       COLHDG('nr.  riga ordine....')
     A            MOKNRP0        4S 0       COLHDG('nr.progress.quota...')
      *                                       riguardante (ORDF33)
     A            MOKNRR0        4S 0       COLHDG('nr.progress.disp....')
      *                                       riguardante (ORDF12)
     A            MOKNOO0        4S 0       COLHDG('nr.progress.ordi....')
     A            MOKMAG0        3          COLHDG('Stabilim.destinaz...')
     A            MOKLUR0        6          COLHDG('Luogo di ritiro ....')
     A            MOKZON0        6          COLHDG('Zona di viaggio.....')
     A            MOKMCO0        3          COLHDG('SI=Franco partenz...')
     A            MOKDDC0        8S 0       COLHDG('Da data consegna....')
     A            MOKADC0        8S 0       COLHDG('A data consegna.....')
     A            MOKQT10       12  3       COLHDG('Q.tà ordine.........')
     A            MOKPRZ0       18  6       COLHDG('Prezzo unit.al KG...')
     A            MOKPRV0       18  6       COLHDG('Provvigioni in E....')
     A            MOKF010        1          COLHDG('P=pagam.al ritiro...')
     A            MOKF020        1          COLHDG('Flag 02 ............')
     A            MOKF030        2          COLHDG('S=Merce fatturata...')
     A            MOKF040        2          COLHDG('Flag 04 ............')
     A            MOKF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MOKF060       10          COLHDG('Rif.forn.dispos.....')
     A            MOKF070        2          COLHDG('Flag 07 ............')
     A            MOKF080        2          COLHDG('Flag 08 ............')
     A            MOKF090        2          COLHDG('Flag 09 ............')
     A            MOKF100        2          COLHDG('Flag 10 ............')
      *
     A            MOKANC0        4S 0       COLHDG('Anno B.E.M. ........')
     A            MOKNUC0        9S 0       COLHDG('Num. B.E.M. ........')
     A            MOKDAC0        8S 0       COLHDG('Data B.E.M. ........')
     A            MOKCHC0        1          COLHDG('C = B.E.M. chiusa...')
     A            MOKVIA0        9  0       COLHDG('Numero viaggio......')
     A            MOKMEZ0        4          COLHDG('Vettore ............')
     A            MOKDAR0        8S 0       COLHDG('Data ritiro ........')
      * Questi pesi devono essere gli stessi dei files INGAUTF0 ed INGAU1F0.
     A            MOKQT20       12  3       COLHDG('Peso tot.automezz...')
     A            MOKQT30       12  3       COLHDG('Peso tara...........')
     A            MOKQT40       12  3       COLHDG('Peso netto..........')
     A            MOKQT50       12  3       COLHDG('Peso reso merce.....')
      *
     A            MOKCAC0        2          COLHDG('SI/NO   costi acc...')
     A            MOKICA0       18  6       COLHDG('Importo costi acc...')
     A            MOKFCA0        6          COLHDG('Fornit. costi acc...')
     A            MOKICP0       18  6       COLHDG('Importo campionat...')
     A            MOKFCP0        6          COLHDG('Fornit. campionat...')
     A            MOKSNC0        2          COLHDG('SI/NO   campioni....')
     A            MOKIMG0       18  6       COLHDG('Importo immagazz....')
     A            MOKFMG0        6          COLHDG('Fornit. immagazz....')
      *           ------------------------- Informazioni di vendita
     A            MOKVEN0        2          COLHDG('SI=Disp.vendita  ...')
     A            MOKCLI0        6          COLHDG('Cliente vendita  ...')
     A            MOKPR10       18  6       COLHDG('Prezzo unit.al kg...')
     A            MOKMDV0        6          COLHDG('Mediatore...........')
     A            MOKPRM0       18  6       COLHDG('Provvigioni in E....')
     A            MOKPRP0        8  5       COLHDG('% provvigioni.......')
     A            MOKVDR0        2          COLHDG('Vendita dir.SI/NO...')
     A            MOKVSN0       15          COLHDG('Ns.num.contratto....')
     A            MOKVSD0        8  0       COLHDG('Ns.dat.contratto....')
      *           ------------------------- Informazioni programmazione viaggi.
     A            MOKUSP0       10          COLHDG('Utente programma....')
     A            MOKDAP0        8S 0       COLHDG('Data programmaz ....')
     A            MOKORP0        6S 0       COLHDG('Ora programmaz .....')
      *           ------------------------- Informazioni pallets.
     A            MOKPAF0        4S 0       COLHDG('N.pallet fornito....')
     A            MOKEPF0        4S 0       COLHDG('N.europa.fornito....')
     A            MOKSAF0        4S 0       COLHDG('N.saccon.fornito....')
     A            MOKPAR0        4S 0       COLHDG('N.pallet riscont....')
     A            MOKEUR0        4S 0       COLHDG('N.europa.riscont....')
     A            MOKSAR0        4S 0       COLHDG('N.saccon.riscont....')
     ****************************************************************
     *  ARCHIVIO      : MGZI35F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Righe entrata merci.    *
     *  PREFISSO      : MOL                                       *
     *  Alcuni dati (come il peso riscontrato ecc.) stanno nel    *
     *  file ORDF60F0 standard.                                   *
     ****************************************************************
     A            MOLSTX0        1          COLHDG('Stato ..............')
     A            MOLUSX0       10          COLHDG('Utente immissione...')
     A            MOLDAX0        8S 0       COLHDG('Data immissione ....')
     A            MOLORX0        6S 0       COLHDG('Ora immissione .....')
     A            MOLUSA0       10          COLHDG('Utente aggiornam....')
     A            MOLDAA0        8S 0       COLHDG('Data aggiornam. ....')
     A            MOLORA0        6S 0       COLHDG('Ora aggiornam. .....')
     A            MOLCAZ0        4A         COLHDG('Codice azione ......')
     A            MOLCAV0        4A         COLHDG('Codice azione varia.')
     A            MOLPGI0       10A         COLHDG('Programma immissione')
     A            MOLPGV0       10A         COLHDG('Programma variazione')
     A            MOLSOC0        2          COLHDG('Società ............')
      *
     A            MOLSCO0        2S 0       COLHDG('Sec. ordine ........')
     A            MOLANO0        2S 0       COLHDG('aa.  ordine ........')
     A            MOLMSO0        2S 0       COLHDG('mm.  ordine ........')
     A            MOLGRO0        2S 0       COLHDG('gg.  ordine ........')
     A            MOLSGO0        4          COLHDG('Sig. ordine ........')
     A            MOLNRO0        9S 0       COLHDG('nr.  ordine ........')
     A            MOLNRI0        4S 0       COLHDG('nr.  riga ordine....')
     A            MOLNRP0        4S 0       COLHDG('nr.progress.quota...')
      *                                       riguardante (ORDF33)
     A            MOLNRR0        4S 0       COLHDG('nr.progress.disp....')
      *                                       riguardante (ORDF12)
     A            MOLNOO0        4S 0       COLHDG('nr.progress.ordi....')
      *                                       riguardante (ORDF34)
     A            MOLNOE0        4S 0       COLHDG('nr.  progressivo....')
     A            MOLMAG0        3          COLHDG('Stabilim.destinaz...')
     A            MOLLUR0        6          COLHDG('Silos 1° prelievo...')
     A            MOLZON0        6          COLHDG('Silos 2° prelievo...')
     A            MOLMCO0        3          COLHDG('SI=Franco partenz...')
     A            MOLDAB0        8S 0       COLHDG('Data bolla..........')
     A            MOLSIB0        4          COLHDG('Sigla bolla.........')
     A            MOLNUB0        6S 0       COLHDG('Numero bolla........')
     A            MOLQT10       12  3       COLHDG('Q.tà ordinata ......')
     A            MOLQT20       12  3       COLHDG('Q.tà 1° silos ......')
     A            MOLPRZ0       18  6       COLHDG('Prezzo unit.al KG...')
     A            MOLPRV0       18  6       COLHDG('Provvigioni in E....')
     A            MOLNRS0        9A         COLHDG('Numero sessione ....')
     A            MOLNRM0        5  0       COLHDG('Numero movimento ...')
     A            MOLGRR0        2S 0       COLHDG('gg.richie.analis....')
     A            MOLMSR0        2S 0       COLHDG('mm.richie.analis....')
     A            MOLSCR0        2S 0       COLHDG('ss.richie.analis....')
     A            MOLANR0        2S 0       COLHDG('aa.richie.analis....')
     A            MOLNUR0        9S 0       COLHDG('Nu.richie.analis....')
     A            MOLDTI0        8S 0       COLHDG('Data ingresso mer...')
     A            MOLUSD0       10          COLHDG('Ut.che ha autoriz...')
     A            MOLDTD0        8S 0       COLHDG('Data autorizzazi....')
     A            MOLORD0        6S 0       COLHDG('Ora  autorizzazi....')
     A            MOLF010        1          COLHDG('C = controllati ....')
     A            MOLF020        1          COLHDG('S = Campioni .......')
     A            MOLF030        2          COLHDG('Emiss.fatt.SI/NO....')
     A            MOLF040        2          COLHDG('Flag 04 ............')
     A            MOLF050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MOLF060       10          COLHDG('RM = reso merce ....')
     A            MOLF070        2          COLHDG('Flag 07 ............')
     A            MOLF080        2          COLHDG('Flag 08 ............')
     A            MOLF090        2          COLHDG('Flag 09 ............')
     A            MOLF100        2          COLHDG('Flag 10 ............')
     A            MOLCAC0        2          COLHDG('SI/NO   costi acc...')
     A            MOLICA0       18  6       COLHDG('Q.tà 2° silos ......')
     A            MOLFCA0        6          COLHDG('Fornit. costi acc...')
     A            MOLNR10        5  0       COLHDG('Numero movimento ...')
     A            MOLICP0       18  6       COLHDG('Importo campionat...')
     A            MOLFCP0        6          COLHDG('Fornit. campionat...')
     A            MOLNR20        5  0       COLHDG('Numero movimento ...')
     A            MOLIMG0       18  6       COLHDG('Importo immagazz....')
     A            MOLFMG0        6          COLHDG('Fornit. immagazz....')
     A            MOLNR30        5  0       COLHDG('Numero movimento ...')
     A            MOLNR40        5  0       COLHDG('Numero mov.mediaz...')
     A            MOLNR50        5  0       COLHDG('Numero med.vend. ...')
     A            MOLDAS0        8S 0       COLHDG('Data scad.pagam ....')
     ****************************************************************
     *  ARCHIVIO      : MGZI36F0                                  *
     *  DESCRIZIONE   : Ordini fornitori: Note  ordini di ritiro. *
     *  PREFISSO      : MNOR                                      *
     ****************************************************************
     A            MNORSTX0       1          COLHDG('Stato ..............')
     A            MNORUSX0      10          COLHDG('Utente immissione...')
     A            MNORDAX0       8  0       COLHDG('Data immissione ....')
     A            MNORORX0       6  0       COLHDG('Ora immissione .....')
     A            MNORUSA0      10          COLHDG('Utente aggiornam....')
     A            MNORDAA0       8  0       COLHDG('Data aggiornam. ....')
     A            MNORORA0       6  0       COLHDG('Ora aggiornam. .....')
     A            MNORCAZ0       4          COLHDG('Codice azione ......')
     A            MNORNRX0       9  0       COLHDG('Numero Azione ......')
     A            MNORSOC0       2          COLHDG('Società ............')
      *
     A            MNORSCO0       2S 0       COLHDG('Sec. ordine ........')
     A            MNORANO0       2S 0       COLHDG('aa.  ordine ........')
     A            MNORMSO0       2S 0       COLHDG('mm.  ordine ........')
     A            MNORGRO0       2S 0       COLHDG('gg.  ordine ........')
     A            MNORSGO0       4          COLHDG('Sig. ordine ........')
     A            MNORNRO0       9S 0       COLHDG('nr.  ordine ........')
     A            MNORNRI0       4  0       COLHDG('nr.  riga ordine....')
     A            MNORNRP0       4  0       COLHDG('nr.progress.quota...')
      *                                       riguardante (ORDF33)
     A            MNORNRR0       4  0       COLHDG('nr.progress.disp....')
      *                                       riguardante (ORDF12)
     A            MNORNOO0       4  0       COLHDG('nr.progress.ordi....')
      *                                       riguardante (ORDF34)
     A            MNORNOR0       4  0       COLHDG('Numero riga ........')
     A            MNORDES0      60          COLHDG('Nota ...............')
     A            MNORF010       1          COLHDG('Flag 01 ............')
     A            MNORF020       1          COLHDG('Flag 02 ............')
     A            MNORF030       2          COLHDG('Flag 03 ............')
     A            MNORF040       2          COLHDG('Flag 04 ............')
     A            MNORF050       1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            MNORF060      10          COLHDG('Flag 06 ............')
     A            MNORF070       2          COLHDG('Flag 07 ............')
     A            MNORF080       2          COLHDG('Flag 08 ............')
     A            MNORF090       2          COLHDG('Flag 09 ............')
     A            MNORF100       2          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : MGZI38F0                                  *
     *  DESCRIZIONE   : Magazzinaggi INDESIL: silos stivaggio.    *
     *  PREFISSO      : AE6                                       *
     ****************************************************************
     A            AE6STX0        1          COLHDG('Stato ..............')
     A            AE6USX0       10          COLHDG('Immissione utente...')
     A            AE6DAX0        8S 0       COLHDG('Immissione data ....')
     A            AE6ORX0        6  0       COLHDG('Immissione ora .....')
     A            AE6PGI0       10A         COLHDG('Immissione programma')
     A            AE6CAZ0        4A         COLHDG('Immissione azione...')
     A            AE6USA0       10          COLHDG('Aggiornamento utente')
     A            AE6DAA0        8S 0       COLHDG('Aggiornamento data..')
     A            AE6ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            AE6CAV0        4A         COLHDG('Aggiornamento azione')
     A            AE6PGV0       10A         COLHDG('Aggiornamento progr.')
     A            AE6SOC0        2          COLHDG('Società ............')
      *
     A            AE6DAO0        8S 0       COLHDG('Data ordine ........')
     A            AE6SGO0        4          COLHDG('Sig. ordine ........')
     A            AE6NRO0        9S 0       COLHDG('nr.  ordine ........')
     A            AE6NOE0        4S 0       COLHDG('nr.  progressivo....')
     A            AE6SIL0        6          COLHDG('Codice silos........')
     A            AE6QTA0       12  3       COLHDG('Q.tà   silos........')
     A            AE6UNM0        2A         COLHDG('Unità di misura ....')
      *
     A            AE6F010        1          COLHDG('Flag 01 ............')
     A            AE6F020        1          COLHDG('Flag 02 ............')
     A            AE6F030        2          COLHDG('Flag 03 ............')
     A            AE6F040        2          COLHDG('Flag 04 ............')
     A            AE6F050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            AE6F060        2          COLHDG('Flag 06 ............')
     A            AE6F070       10          COLHDG('Flag 07 ............')
     A            AE6F080       10          COLHDG('Flag 08 ............')
     A            AE6F090       10          COLHDG('Flag 09 ............')
     A            AE6F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : MGZI39F0                                  *
     *  DESCRIZIONE   : Magazzinaggi INDESIL: trsf.pulitura silos.*
     *  PREFISSO      : AE7                                       *
     ****************************************************************
     A            AE7STX0        1          COLHDG('Stato ..............')
     A            AE7USX0       10          COLHDG('Immissione utente...')
     A            AE7DAX0        8S 0       COLHDG('Immissione data ....')
     A            AE7ORX0        6  0       COLHDG('Immissione ora .....')
     A            AE7PGI0       10A         COLHDG('Immissione programma')
     A            AE7CAZ0        4A         COLHDG('Immissione azione...')
     A            AE7USA0       10          COLHDG('Aggiornamento utente')
     A            AE7DAA0        8S 0       COLHDG('Aggiornamento data..')
     A            AE7ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            AE7CAV0        4A         COLHDG('Aggiornamento azione')
     A            AE7PGV0       10A         COLHDG('Aggiornamento progr.')
     A            AE7SOC0        2          COLHDG('Società ............')
      *
     A            AE7DAO0        8S 0       COLHDG('Data ordine ........')
     A            AE7SGO0        4          COLHDG('Sig. ordine ........')
     A            AE7NRO0        9S 0       COLHDG('nr.  ordine ........')
     A            AE7SI10        6A         COLHDG('Codice silos 1 .....')
     A            AE7SI20        6A         COLHDG('Codice silos 2 .....')
     A            AE7QTA0       12  3       COLHDG('Q.tà   silos........')
     A            AE7UNM0        2A         COLHDG('Unità di misura ....')
     A            AE7CAU0        3A         COLHDG('Causale ............')
      *                                             TRA = trasferimento tra silos
      *                                             PUL = pulitura silos
     A            AE7DAM0        8S 0       COLHDG('Data movimento......')
     A            AE7NRS0        9  0       COLHDG('Numero sessione.....')
     A            AE7NRM0        4  0       COLHDG('Numero movimento....')
     A            AE7NO10       40          COLHDG('Nota 01 ............')
     A            AE7NO20       40          COLHDG('Nota 02 ............')
     A            AE7DAOA0       8S 0       COLHDG('Data ordine arrivo..')
     A            AE7SGOA0       4          COLHDG('Sig. ordine arrivo..')
     A            AE7NROA0       9S 0       COLHDG('nr.  ordine arrivo..')
      *
     A            AE7F010        1          COLHDG('Tipo trasfer. 1/2 ..')
     A            AE7F020        1          COLHDG('Flag 02 ............')
     A            AE7F030        2          COLHDG('Flag 03 ............')
     A            AE7F040        2          COLHDG('Flag 04 ............')
     A            AE7F050        1          COLHDG('1. Ordini per ser...')
      *                                             2. Ord.per commerc.
      *                                             3. ord.per acquisti
     A            AE7F060        2          COLHDG('Flag 06 ............')
     A            AE7F070       10          COLHDG('Flag 07 ............')
     A            AE7F080       10          COLHDG('Flag 08 ............')
     A            AE7F090       10          COLHDG('Flag 09 ............')
     A            AE7F100       10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  ARCHIVIO      : CNTMOLF0                                  *
     *  DESCRIZIONE   : Contratti Molino (Petrini)                *
     *  PREFISSO      : CNT                                       *
     ****************************************************************
     A            CNTSTX0        1          COLHDG('Stato ..............')
     A            CNTUSX0       10          COLHDG('Immissione utente...')
     A            CNTDAX0        8S 0       COLHDG('Immissione data ....')
     A            CNTORX0        6  0       COLHDG('Immissione ora .....')
     A            CNTPGI0       10A         COLHDG('Immissione programma')
     A            CNTCAZ0        4A         COLHDG('Immissione azione...')
     A            CNTUSA0       10          COLHDG('Aggiornamento utente')
     A            CNTDAA0        8S 0       COLHDG('Aggiornamento data..')
     A            CNTORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CNTCAV0        4A         COLHDG('Aggiornamento azione')
     A            CNTPGV0       10A         COLHDG('Aggiornamento progr.')
     A            CNTSOC0        2          COLHDG('Società ............')
      *
     A            CNTMAG0        2          COLHDG('Magazzino...........')
     A            CNTCLI0        6          COLHDG('Cod. Cliente Fatt...')
     A            CNTNCP0        6S 0       COLHDG('Nr. Contr. Petrini..')
     A            CNTNCC0       10          COLHDG('Nr. Contr. Cliente..')
     A            CNTART0       15          COLHDG('Cod.Articolo........')
     A            CNTDTI0        8  0       COLHDG('Data Inizio Val.....')
     A            CNTDTF0        8  0       COLHDG('Data Fine   Val.....')
     A            CNTQTA0       12  3       COLHDG('Q.tà Contratto......')
     A            CNTPZO0       18  6       COLHDG('Prezzo..............')
      *
     A            CNTF010        2          COLHDG('Flag 01 ............')
     A            CNTF020        2          COLHDG('Flag 02 ............')
     A            CNTF030        2          COLHDG('Flag 03 ............')
     A            CNTF040        2          COLHDG('Flag 04 ............')
     A            CNTF050        2          COLHDG('Flag 05.............')
     A            CNTF060        2          COLHDG('Flag 06 ............')
     A            CNTF070       10          COLHDG('Flag 07 ............')
     A            CNTF080       10          COLHDG('Flag 08 ............')
     A            CNTF090       10          COLHDG('Flag 09 ............')
     A            CNTF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : RCSCPTF0                                     *
     *  DESCRIZIONE   : Richiesta sconti ad personam testata.        *
     *  PREFISSO      : CNA                                          *
     * =============================================================== *
     A            CNASTX0        1          COLHDG('Stato ..............')
     A            CNAUSX0       10          COLHDG('Immissione utente...')
     A            CNADAX0        8S 0       COLHDG('Immissione data ....')
     A            CNAORX0        6  0       COLHDG('Immissione ora .....')
     A            CNAPGI0       10A         COLHDG('Immissione programma')
     A            CNACAZ0        4A         COLHDG('Immissione azione...')
     A            CNAUSA0       10          COLHDG('Aggiornamento utente')
     A            CNADAA0        8S 0       COLHDG('Aggiornamento data..')
     A            CNAORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CNACAV0        4A         COLHDG('Aggiornamento azione')
     A            CNAPGV0       10A         COLHDG('Aggiornamento progr.')
     A            CNASOC0        2          COLHDG('Società ............')
      *
     A            CNAUSR0       30          COLHDG('User sessione ......')
     A            CNATIP0        3          COLHDG('Tipo sessione ......')
     A            CNACOD0        6          COLHDG('Codice user sessione')
     A            CNADER0       30          COLHDG('Descr. user sessione')
      *
     A            CNACLI0        6          COLHDG('Cliente ............')
     A            CNADAR0        8  0       COLHDG('Richiesta data .....')
     A            CNANUR0        6  0       COLHDG('Richiesta numero ...')
     A            CNASAC0        1          COLHDG('S = Sacchi .........')
     A            CNASFU0        1          COLHDG('S = Sfuso ..........')
     A            CNADT10        8  0       COLHDG('Data inizio validità')
     A            CNADT20        8  0       COLHDG('Data fine validità..')
     A            CNAVDC0        1          COLHDG('S = Visto dire.comm.')
     A            CNAVCD0        1          COLHDG('S = Visto capo dipa.')
     A            CNAVCS0        1          COLHDG('S = Visto capo dist.')
     A            CNADTC0        8  0       COLHDG('Data   conferma ....')
     A            CNAUSC0       10          COLHDG('User   conferma ....')
     A            CNAMAG0        3          COLHDG('Codice magazzino ...')
     A            CNACOL0        2          COLHDG('Codice listino .....')
     A            CNANLI0        2          COLHDG('Numero listino .....')
     A            CNAALI0        4S 0       COLHDG('Anno   listino .....')
     A            CNANO10       40          COLHDG('Nota 01 ............')
     A            CNANO20       40          COLHDG('Nota 02 ............')
     A            CNANO30       40          COLHDG('Nota 03 ............')
      *
     A            CNAF010        2          COLHDG('Flag 01 ............')
     A            CNAF020        2          COLHDG('Flag 02 ............')
     A            CNAF030        2          COLHDG('Flag 03 ............')
     A            CNAF040        2          COLHDG('Flag 04 ............')
     A            CNAF050        2          COLHDG('Flag 05.............')
     A            CNAF060        2          COLHDG('Flag 06 ............')
     A            CNAF070       10          COLHDG('Flag 07 ............')
     A            CNAF080       10          COLHDG('Flag 08 ............')
     A            CNAF090       10          COLHDG('Flag 09 ............')
     A            CNAF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : RCSCPDF0                                     *
     *  DESCRIZIONE   : Richiesta sconti ad personam dettaglio.      *
     *  PREFISSO      : CNB                                          *
     * =============================================================== *
     A            CNBSTX0        1          COLHDG('Stato ..............')
     A            CNBUSX0       10          COLHDG('Immissione utente...')
     A            CNBDAX0        8S 0       COLHDG('Immissione data ....')
     A            CNBORX0        6  0       COLHDG('Immissione ora .....')
     A            CNBPGI0       10A         COLHDG('Immissione programma')
     A            CNBCAZ0        4A         COLHDG('Immissione azione...')
     A            CNBUSA0       10          COLHDG('Aggiornamento utente')
     A            CNBDAA0        8S 0       COLHDG('Aggiornamento data..')
     A            CNBORA0        6  0       COLHDG('Aggiornamento ora...')
     A            CNBCAV0        4A         COLHDG('Aggiornamento azione')
     A            CNBPGV0       10A         COLHDG('Aggiornamento progr.')
     A            CNBSOC0        2          COLHDG('Società ............')
      *
     A            CNBDAR0        8  0       COLHDG('Richiesta data .....')
     A            CNBNUR0        6  0       COLHDG('Richiesta numero ...')
     A            CNBNRR0        6  0       COLHDG('Richiesta numero rig')
     A            CNBLIN0        2          COLHDG('Linea (esclusivo)...')
     A            CNBPRO0        6          COLHDG('Prodotto (esclusivo)')
     A            CNBCFZ0        2          COLHDG('Confezio.(esclusivo)')
     *           ------------------------- Per sconto quantità.
     A            CNBQTA0       12  3       COLHDG('Quantità minima ....')
     A            CNBQSC0        5  2       COLHDG('Quantità percent. ..')
     A            CNBQPR0       18  8       COLHDG('Quantità importo ...')
     *           ------------------------- Promozioni.
     A            CNBPSC0        5  2       COLHDG('Promozioni percent..')
     A            CNBPPR0       18  8       COLHDG('Promozioni importo .')
     *           ------------------------- Ad personam.
     A            CNBASC0        5  2       COLHDG('Ad personam percent.')
     A            CNBAPR0       18  8       COLHDG('Ad personam importo.')
     *           ------------------------- Sconto sostitutivo.
     A            CNBSSC0        5  2       COLHDG('Sc.sostitut.percent.')
     A            CNBSPR0       18  8       COLHDG('Sc.sostitut.importo.')
      *
     A            CNBPFI0       18  8       COLHDG('Prezzo finito ......')
     A            CNBSCA0        5  2       COLHDG('Sconto cassa .......')
     A            CNBPNT0       18  8       COLHDG('Prezzo nettissimo ..')
      *
     A            CNBF010        2          COLHDG('Flag 01 ............')
     A            CNBF020        2          COLHDG('Flag 02 ............')
     A            CNBF030        2          COLHDG('Flag 03 ............')
     A            CNBF040        2          COLHDG('Flag 04 ............')
     A            CNBF050        2          COLHDG('Flag 05.............')
     A            CNBF060        2          COLHDG('Flag 06 ............')
     A            CNBF070       10          COLHDG('Flag 07 ............')
     A            CNBF080       10          COLHDG('Flag 08 ............')
     A            CNBF090       10          COLHDG('Flag 09 ............')
     A            CNBF100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TCRID1F0                                     *
     *  DESCRIZIONE   : Tracciabilità Lotti/Bem  (Acquisti)          *
     *  PREFISSO      : TC1                                          *
     * =============================================================== *
     A            TC1STX0        1          COLHDG('Stato ..............')
     A            TC1USX0       10          COLHDG('Immissione utente...')
     A            TC1DAX0        8  0       COLHDG('Immissione data ....')
     A            TC1ORX0        6  0       COLHDG('Immissione ora .....')
     A            TC1PGI0       10          COLHDG('Immissione programma')
     A            TC1CAZ0       10          COLHDG('Immissione azione...')
     A            TC1USA0       10          COLHDG('Aggiornamento utente')
     A            TC1DAA0        8  0       COLHDG('Aggiornamento data..')
     A            TC1ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            TC1PGV0       10          COLHDG('Aggiornamento progr.')
     A            TC1CAV0       10          COLHDG('Aggiornamento azione')
     A            TC1SOC0        2          COLHDG('Società ............')
      *
     A            TC1CFO0        6          COLHDG('Cod. Fornitore......')
     A            TC1DBL0        8  0       COLHDG('Data Bolla Forn.....')
     A            TC1SBL0        4          COLHDG('Sigla Bolla Forn....')
     A            TC1NBL0        6  0       COLHDG('Num. Bolla Forn. ...')
     A            TC1DBE0        8  0       COLHDG('Data Bem............')
     A            TC1NBE0        9  0       COLHDG('Num. Bem............')
     A            TC1ABE0        4  0       COLHDG('Anno Bem............')
     A            TC1MAG0        3          COLHDG('Magazzino...........')
     A            TC1PRO0       15          COLHDG('Prodotto............')
     A            TC1DMO0        8  0       COLHDG('Data movimento......')
     A            TC1QTE0       12  2       COLHDG('Quantità entrata....')
     A            TC1QTU0       12  2       COLHDG('Quantità utilizzata.')
     A            TC1QTR0       12  2       COLHDG('Quantità residua....')
     A            TC1CAU0        2          COLHDG('Causale movimento...')
     A            TC1CHI0        1          COLHDG('Flag Chiusura ......')
     A            TC1NSE0        9  0       COLHDG('Num. Sessione.......')
     A            TC1NMO0        4  0       COLHDG('Num. Movimento......')
     A            TC1NMR0        4  0       COLHDG('Num. Movimento riga.')
     A            TC1NUM0        9  0       COLHDG('Numeratore interno..')
     A            TC1SIL0        6          COLHDG('Silos di carico ....')
     A            TC1DEF0        1          COLHDG('D=definitivo .......')
     A            TC1CAT0        2          COLHDG('Causale trasferimen.')
     A            TC1SIT0        6          COLHDG('Silos trasferimento.')
     A            TC1NMT0        4  0       COLHDG('Num. Movimento riga.')
      *
     A            TC1F010        2          COLHDG('Flag 01 ............')
     A            TC1F020        2          COLHDG('Flag 02 ............')
     A            TC1F030        2          COLHDG('Flag 03 ............')
     A            TC1F040        2          COLHDG('Flag 04 ............')
     A            TC1F050        2          COLHDG('Flag 05.............')
     A            TC1F060        2          COLHDG('Flag 06 ............')
     A            TC1F070       10          COLHDG('Data chius. AAMMGG..')
     A            TC1F080       10          COLHDG('Flag 08 ............')
     A            TC1F090       10          COLHDG('Flag 09 ............')
     A            TC1F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TCRID2F0                                     *
     *  DESCRIZIONE   : Tracciabilità Lotti/Bem  (Consumi)           *
     *  PREFISSO      : TC2                                          *
     * =============================================================== *
     A            TC2STX0        1          COLHDG('Stato ..............')
     A            TC2USX0       10          COLHDG('Immissione utente...')
     A            TC2DAX0        8  0       COLHDG('Immissione data ....')
     A            TC2ORX0        6  0       COLHDG('Immissione ora .....')
     A            TC2PGI0       10          COLHDG('Immissione programma')
     A            TC2CAZ0       10          COLHDG('Immissione azione...')
     A            TC2USA0       10          COLHDG('Aggiornamento utente')
     A            TC2DAA0        8  0       COLHDG('Aggiornamento data..')
     A            TC2ORA0        6  0       COLHDG('Aggiornamento ora...')
     A            TC2PGV0       10          COLHDG('Aggiornamento progr.')
     A            TC2CAV0       10          COLHDG('Aggiornamento azione')
     A            TC2SOC0        2          COLHDG('Società ............')
      *
     A            TC2NUM0        9  0       COLHDG('Numeratore interno..')
     A            TC2RIG0        5  0       COLHDG('Riga numeratore int.')
     A            TC2MAG0        3          COLHDG('Magazzino...........')
     A            TC2PRO0       15          COLHDG('Prodotto............')
     A            TC2DMO0        8  0       COLHDG('Data movimento......')
     A            TC2QTA0       12  2       COLHDG('Quantità............')
     A            TC2CHI0        1          COLHDG('Flag Chiusura ......')
     A            TC2NSE0        9  0       COLHDG('Num. Sessione.......')
     A            TC2NMO0        4  0       COLHDG('Num. Movimento......')
     A            TC2NMR0        4  0       COLHDG('Num. Movimento riga.')
     A            TC2CAU0        2          COLHDG('Causale movimento...')
     A            TC2SIL0        6          COLHDG('Silos di carico ....')
      *
     A            TC2F010        2          COLHDG('Flag 01 ............')
     A            TC2F020        2          COLHDG('Flag 02 ............')
     A            TC2F030        2          COLHDG('Flag 03 ............')
     A            TC2F040        2          COLHDG('Flag 04 ............')
     A            TC2F050        2          COLHDG('Flag 05.............')
     A            TC2F060        2          COLHDG('Flag 06 ............')
     A            TC2F070       10          COLHDG('Flag 07 ............')
     A            TC2F080       10          COLHDG('Flag 08 ............')
     A            TC2F090       10          COLHDG('Flag 09 ............')
     A            TC2F100       10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MAPVITF0                                     *
     *  DESCRIZIONE   : Mappa di un viaggio da MAP&GUIDE testata.    *
     *  PREFISSO      : MGT                                          *
     * =============================================================== *
     A            MGTSTATO0      1          COLHDG('Stato ..............')
     A            MGTIMMUT0     10          COLHDG('Immissione utente...')
     A            MGTIMMDA0      8  0       COLHDG('Immissione data ....')
     A            MGTIMMOR0      6  0       COLHDG('Immissione ora .....')
     A            MGTIMMPG0     10A         COLHDG('Immissione programma')
     A            MGTIMMAZ0      4A         COLHDG('Immissione azione...')
     A            MGTAGGUT0     10          COLHDG('Aggiornamento utente')
     A            MGTAGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            MGTAGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            MGTAGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            MGTAGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            MGTSOCIE0      2          COLHDG('Società ............')
      *
     A            MGTNUMVI0      9S 0       COLHDG('Num.   Viaggio .....')
     A            MGTTOTKM0     18S 8       COLHDG('Kilometri totali....')
      *
     A            MGTFLA010      2          COLHDG('Flag 01 ............')
     A            MGTFLA020      2          COLHDG('Flag 02 ............')
     A            MGTFLA030      2          COLHDG('Flag 03 ............')
     A            MGTFLA040      2          COLHDG('Flag 04 ............')
     A            MGTFLA050      2          COLHDG('Flag 05.............')
     A            MGTFLA060      2          COLHDG('Flag 06 ............')
     A            MGTFLA070     10          COLHDG('Flag 07 ............')
     A            MGTFLA080     10          COLHDG('Flag 08 ............')
     A            MGTFLA090     10          COLHDG('Flag 09 ............')
     A            MGTFLA100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MAPVIAF0                                     *
     *  DESCRIZIONE   : Mappa di un viaggio da MAP&GUIDE.            *
     *  PREFISSO      : MG                                           *
     * =============================================================== *
     A            MGSTATOR0      1          COLHDG('Stato ..............')
     A            MGIMMUTE0     10          COLHDG('Immissione utente...')
     A            MGIMMDAT0      8  0       COLHDG('Immissione data ....')
     A            MGIMMORA0      6  0       COLHDG('Immissione ora .....')
     A            MGIMMPRG0     10A         COLHDG('Immissione programma')
     A            MGIMMAZI0      4A         COLHDG('Immissione azione...')
     A            MGAGGUTE0     10          COLHDG('Aggiornamento utente')
     A            MGAGGDAT0      8  0       COLHDG('Aggiornamento data..')
     A            MGAGGORA0      6  0       COLHDG('Aggiornamento ora...')
     A            MGAGGPRG0     10A         COLHDG('Aggiornamento progr.')
     A            MGAGGAZI0      4A         COLHDG('Aggiornamento azione')
     A            MGSOCIET0      2          COLHDG('Società ............')
      *
     A            MGNUMVIA0      9S 0       COLHDG('Num.   Viaggio .....')
     A            MGSEQEN10      4S 0       COLHDG('Sequenza ...........')
     A            MGSEQEN20      4S 0       COLHDG('Sequenza m&G........')
     A            MGCLIENT0      6          COLHDG('Cliente  ...........')
     A            MGCDAVPO0      5          COLHDG('C a p    ...........')
     A            MGLOCALI0     40          COLHDG('Località ...........')
     A            MGCHIL010     18S 8       COLHDG('Km.parziali ........')
     A            MGCHIL020     18S 8       COLHDG('Km.progressivi .....')
     A            MGCAPMGU0      5          COLHDG('C a p   m&g ........')
      *
     A            MGFLAG010      2          COLHDG('Errore M&G .........')
     A            MGFLAG020      2          COLHDG('Flag 02 ............')
     A            MGFLAG030      2          COLHDG('Flag 03 ............')
     A            MGFLAG040      2          COLHDG('Flag 04 ............')
     A            MGFLAG050      2          COLHDG('Flag 05.............')
     A            MGFLAG060      2          COLHDG('Flag 06 ............')
     A            MGFLAG070     10          COLHDG('Coord.longitudine ..')
     A            MGFLAG080     10          COLHDG('Coord.latitudine ...')
     A            MGFLAG090     10          COLHDG('Numero ordine ......')
     A            MGFLAG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LVPBMPF0                                     *
     *  DESCRIZIONE   : Listino di vendita materie prime PREZZO BASE  *
     *  PREFISSO      : LV1                                          *
     * =============================================================== *
     A            LV1STATO0      1          COLHDG('Stato ..............')
     A            LV1IMMUT0     10          COLHDG('Immissione utente...')
     A            LV1IMMDA0      8  0       COLHDG('Immissione data ....')
     A            LV1IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            LV1IMMPG0     10A         COLHDG('Immissione programma')
     A            LV1IMMAZ0      4A         COLHDG('Immissione azione...')
     A            LV1AGGUT0     10          COLHDG('Aggiornamento utente')
     A            LV1AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            LV1AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            LV1AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            LV1AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            LV1SOCIE0      2          COLHDG('Società ............')
      *
     A            LV1PRODO0     15          COLHDG('Prodotto............')
     A            LV1PREZZ0     18  8       COLHDG('Prezzo unitario .. .')
     A            LV1DTAIN0      8  0       COLHDG('Data inizio ...... .')
     A            LV1PREZ20     18  8       COLHDG('Prezzo unitario 2. .')
      *
     A            LV1FLG010      2          COLHDG('Flag 01 ............')
     A            LV1FLG020      2          COLHDG('Flag 02 ............')
     A            LV1FLG030      2          COLHDG('Flag 03 ............')
     A            LV1FLG040      2          COLHDG('Flag 04 ............')
     A            LV1FLG050      2          COLHDG('Flag 05 ............')
     A            LV1FLG060     10          COLHDG('Flag 06 ............')
     A            LV1FLG070     10          COLHDG('Flag 07 ............')
     A            LV1FLG080     10          COLHDG('Flag 08 ............')
     A            LV1FLG090     10          COLHDG('Flag 09 ............')
     A            LV1FLG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LVATMPF0                                     *
     *  DESCRIZIONE   : Listino di vendita materie prime ADD.TRASP.   *
     *  PREFISSO      : LV2                                          *
     * =============================================================== *
     A            LV2STATO0      1          COLHDG('Stato ..............')
     A            LV2IMMUT0     10          COLHDG('Immissione utente...')
     A            LV2IMMDA0      8  0       COLHDG('Immissione data ....')
     A            LV2IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            LV2IMMPG0     10A         COLHDG('Immissione programma')
     A            LV2IMMAZ0      4A         COLHDG('Immissione azione...')
     A            LV2AGGUT0     10          COLHDG('Aggiornamento utente')
     A            LV2AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            LV2AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            LV2AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            LV2AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            LV2SOCIE0      2          COLHDG('Società ............')
      *
     A            LV2LOC010      6          COLHDG('Località partenza...')
     A            LV2LOC020      6          COLHDG('Località arrivo ....')
     A            LV2PREZZ0     18  8       COLHDG('Prezzo unitario .. .')
     A            LV2DTAIN0      8  0       COLHDG('Data inizio ...... .')
      *
     A            LV2FLG010      2          COLHDG('Flag 01 ............')
     A            LV2FLG020      2          COLHDG('Flag 02 ............')
     A            LV2FLG030      2          COLHDG('Flag 03 ............')
     A            LV2FLG040      2          COLHDG('Flag 04 ............')
     A            LV2FLG050      2          COLHDG('Flag 05 ............')
     A            LV2FLG060     10          COLHDG('Flag 06 ............')
     A            LV2FLG070     10          COLHDG('Flag 07 ............')
     A            LV2FLG080     10          COLHDG('Flag 08 ............')
     A            LV2FLG090     10          COLHDG('Flag 09 ............')
     A            LV2FLG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LVDVMPF0                                     *
     *  DESCRIZIONE   : Listino di vendita materie prime DATE VALID   *
     *  PREFISSO      : LV3                                          *
     * =============================================================== *
     A            LV3STATO0      1          COLHDG('Stato ..............')
     A            LV3IMMUT0     10          COLHDG('Immissione utente...')
     A            LV3IMMDA0      8  0       COLHDG('Immissione data ....')
     A            LV3IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            LV3IMMPG0     10A         COLHDG('Immissione programma')
     A            LV3IMMAZ0      4A         COLHDG('Immissione azione...')
     A            LV3AGGUT0     10          COLHDG('Aggiornamento utente')
     A            LV3AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            LV3AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            LV3AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            LV3AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            LV3SOCIE0      2          COLHDG('Società ............')
      *
     A            LV3DTAIN0      8  0       COLHDG('Data inizio ...... .')
     A            LV3DESCR0     40          COLHDG('Descrizione ...... .')
      *
     A            LV3FLG010      2          COLHDG('Flag 01 ............')
     A            LV3FLG020      2          COLHDG('Flag 02 ............')
     A            LV3FLG030      2          COLHDG('Flag 03 ............')
     A            LV3FLG040      2          COLHDG('Flag 04 ............')
     A            LV3FLG050      2          COLHDG('Flag 05 ............')
     A            LV3FLG060     10          COLHDG('Flag 06 ............')
     A            LV3FLG070     10          COLHDG('Flag 07 ............')
     A            LV3FLG080     10          COLHDG('Flag 08 ............')
     A            LV3FLG090     10          COLHDG('Flag 09 ............')
     A            LV3FLG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MF1MAFA0                                     *
     *  DESCRIZIONE   : MacinaFarm Budget obbiettivo RURAL - PETFOOD  *
     *  PREFISSO      : MF1                                          *
     * =============================================================== *
     A            MF1STATO0      1          COLHDG('Stato ..............')
     A            MF1IMMUT0     10          COLHDG('Immissione utente...')
     A            MF1IMMDA0      8  0       COLHDG('Immissione data ....')
     A            MF1IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            MF1IMMPG0     10A         COLHDG('Immissione programma')
     A            MF1IMMAZ0      4A         COLHDG('Immissione azione...')
     A            MF1AGGUT0     10          COLHDG('Aggiornamento utente')
     A            MF1AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            MF1AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            MF1AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            MF1AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            MF1SOCIE0      2          COLHDG('Società ............')
      *
     A            MF1ANBDG0      4          COLHDG('Anno Budget....... .')
     A            MF1CDFAT0      6          COLHDG('Cliente fatturaz.. .')
     A            MF1PAIVA0     11          COLHDG('Partita iva......  .')
     A            MF1OBRUR0     18  6       COLHDG('Obbiet. EURO RURAL..')
     A            MF1OBFOD0     18  6       COLHDG('Obbiet. EURO FOOD...')
     A            MF1OBBI30     18  6       COLHDG('Obbiet. EURO      ..')
     A            MF1OBBI40     18  6       COLHDG('Obbiet. EURO     ...')
     A            MF1QTRUR0     18  6       COLHDG('Quantità RURAL......')
     A            MF1QTFOD0     18  6       COLHDG('Quantità FOOD.......')
     A            MF1QUAN30     18  6       COLHDG('Quantità      ......')
     A            MF1QUAN40     18  6       COLHDG('Quantità     .......')
     A            MF1CANAL0      1          COLHDG('Canale..............')
     A            MF1DISTR0      3          COLHDG('Distretto...........')
     A            MF1AGENT0      3          COLHDG('Agente..............')
      *
     A            MF1RIRUR0     18  6       COLHDG('Risult. EURO RURAL..')
     A            MF1RIFOD0     18  6       COLHDG('Risult. EURO FOOD...')
     A            MF1RIBI30     18  6       COLHDG('Risult. EURO      ..')
     A            MF1RIBI40     18  6       COLHDG('Risult. EURO     ...')
     A            MF1RIQTRU0    18  6       COLHDG('Risult. Qta Rural...')
     A            MF1RIQTFO0    18  6       COLHDG('Risult. Qta Food....')
     A            MF1RIQT30     18  6       COLHDG('Quantità      ......')
     A            MF1RIQT40     18  6       COLHDG('Quantità     .......')
      *
     A            MF1FLG010      2          COLHDG('Flag 01 ............')
     A            MF1FLG020      2          COLHDG('Flag 02 ............')
     A            MF1FLG030      2          COLHDG('Flag 03 ............')
     A            MF1FLG040      2          COLHDG('Flag 04 ............')
     A            MF1FLG050      2          COLHDG('Flag 05 ............')
     A            MF1FLG060     10          COLHDG('Flag 06 ............')
     A            MF1FLG070     10          COLHDG('Flag 07 ............')
     A            MF1FLG080     10          COLHDG('Flag 08 ............')
     A            MF1FLG090     10          COLHDG('Flag 09 ............')
     A            MF1FLG100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : MF2MAFA0                                     *
     *  DESCRIZIONE   : MacinaFarm Budget obbiettivo RURAL - PETFOOD  *
     *                  DETTAGLIO LINEE                               *
     *  PREFISSO      : MF1                                          *
     * =============================================================== *
     A            MF2STATO0      1          COLHDG('Stato ..............')
     A            MF2IMMUT0     10          COLHDG('Immissione utente...')
     A            MF2IMMDA0      8  0       COLHDG('Immissione data ....')
     A            MF2IMMOR0      6  0       COLHDG('Immissione ora .....')
     A            MF2IMMPG0     10A         COLHDG('Immissione programma')
     A            MF2IMMAZ0      4A         COLHDG('Immissione azione...')
     A            MF2AGGUT0     10          COLHDG('Aggiornamento utente')
     A            MF2AGGDA0      8  0       COLHDG('Aggiornamento data..')
     A            MF2AGGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            MF2AGGPG0     10A         COLHDG('Aggiornamento progr.')
     A            MF2AGGAZ0      4A         COLHDG('Aggiornamento azione')
     A            MF2SOCIE0      2          COLHDG('Società ............')
      *
     A            MF2ANBDG0      4          COLHDG('Anno Budget....... .')
     A            MF2CDFAT0      6          COLHDG('Cliente fatturaz.. .')
     A            MF2PAIVA0     11          COLHDG('Partita iva......  .')
     A            MF2OBRUR0     18  6       COLHDG('Obbiet. EURO RURAL..')
     A            MF2OBFOD0     18  6       COLHDG('Obbiet. EURO FOOD...')
     A            MF2OBBI30     18  6       COLHDG('Obbiet. EURO      ..')
     A            MF2OBBI40     18  6       COLHDG('Obbiet. EURO     ...')
     A            MF2QTRUR0     18  6       COLHDG('Quantità RURAL......')
     A            MF2QTFOD0     18  6       COLHDG('Quantità FOOD.......')
     A            MF2QUAN30     18  6       COLHDG('Quantità      ......')
     A            MF2QUAN40     18  6       COLHDG('Quantità     .......')
     A            MF2CANAL0      1          COLHDG('Canale..............')
     A            MF2DISTR0      3          COLHDG('Distretto...........')
     A            MF2AGENT0      3          COLHDG('Agente..............')
      *
     A            MF2RIRUR0     18  6       COLHDG('Risult. EURO RURAL..')
     A            MF2RIFOD0     18  6       COLHDG('Risult. EURO FOOD...')
     A            MF2RIBI30     18  6       COLHDG('Risult. EURO      ..')
     A            MF2RIBI40     18  6       COLHDG('Risult. EURO     ...')
     A            MF2RIQTRU0    18  6       COLHDG('Risult. Qta Rural...')
     A            MF2RIQTFO0    18  6       COLHDG('Risult. Qta Food....')
     A            MF2RIQT30     18  6       COLHDG('Quantità      ......')
     A            MF2RIQT40     18  6       COLHDG('Quantità     .......')
     A            MF2LINEA0      4          COLHDG('Linea        .......')
      *
     A            MF2FLG010      2          COLHDG('Flag 01 ............')
     A            MF2FLG020      2          COLHDG('Flag 02 ............')
     A            MF2FLG030      2          COLHDG('Flag 03 ............')
     A            MF2FLG040      2          COLHDG('Flag 04 ............')
     A            MF2FLG050      2          COLHDG('Flag 05 ............')
     A            MF2FLG060     10          COLHDG('Flag 06 ............')
     A            MF2FLG070     10          COLHDG('Flag 07 ............')
     A            MF2FLG080     10          COLHDG('Flag 08 ............')
     A            MF2FLG090     10          COLHDG('Flag 09 ............')
     A            MF2FLG100     10          COLHDG('Flag 10 ............')
