     A          R DIZMI7
     ****************************************************************
     *  TABELLA       : CART91F0                                  *
     *  DESCRIZIONE   : PUBBLICAZIONE CARTELLINO UNICO            *
     *  PREFISSO      : C91                                       *
     ****************************************************************
     A            C91STX0        1          COLHDG('Stato ...........')
     A            C91USE0       10          COLHDG('Utente immissione')
     A            C91DAE0        8  0       COLHDG('Data immissione .')
     A            C91ORE0        6  0       COLHDG('Ora immissione...')
     A            C91USA0       10          COLHDG('Utente aggiornam.')
     A            C91DAA0        8  0       COLHDG('Data aggiornam...')
     A            C91ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C91NRX0        9  0       COLHDG('Numero Azione ...')
     A            C91CAZ0        4          COLHDG('Codice azione....')
     A            C91PGM0       10          COLHDG('Programma immiss.')
     A            C91PGA0       10          COLHDG('Programma modif..')
      *
     A            C91MAG0        2          COLHDG('Cod.Magazzino....')
     A            C91CPR0       15          COLHDG('Cod.Cartellino...')
     A            C91DPR0       30          COLHDG('Des.Cartellino...')
     A            C91ART0        6          COLHDG('Cod. Prodotto....')
     A            C91CME0        6          COLHDG('Cod. Medicazione.')
     A            C91MSC0        2          COLHDG('Mesi Scadenza....')
     A            C91LOG0        4          COLHDG('Cod.Logo.........')
     A            C91STS0        1          COLHDG('Status Cartellino')
     A            C91MED0        1          COLHDG('Prod.Medicato....')
     A            C91DDI0      300          COLHDG('Des.Dest.Impiego.')
     A            C91DTA0      600          COLHDG('Des.Ten.Analitici')
     A            C91DIN0     1000          COLHDG('Des.Ingredienti..')
     A            C91NOT0      100          COLHDG('Note.............')
     A            C91IXU0     1200          COLHDG('Istruz. per uso..')
     A            C91AUT0      200          COLHDG('Autorizzazione...')
     A            C91SOC0      200          COLHDG('Società e Indiri.')
     *
     A            C91PRO0       15          COLHDG('Cod.Prodotto.....')
     A            C91LOT0        9          COLHDG('Nr.Lotto.........')
     A            C91DTP0       10          COLHDG('Data Produzione..')
     A            C91DTS0       10          COLHDG('Data Scadenza....')
     A            C91NCP0        4  0       COLHDG('Nr.Copie Stampa..')
     A            C91EAN0       15          COLHDG('Cod. EAN.........')
      *
     A            C91DI01       40          COLHDG('Des.Integrazione.')
     A            C91UM01        4          COLHDG('Un.Misura........')
     A            C91VA01        8          COLHDG('Valore...........')
     A            C91FL01        1          COLHDG('Flag Layout .....')
     A            C91DI02       40          COLHDG('Des.Integrazione.')
     A            C91UM02        4          COLHDG('Un.Misura........')
     A            C91VA02        8          COLHDG('Valore...........')
     A            C91FL02        1          COLHDG('Flag Layout .....')
     A            C91DI03       40          COLHDG('Des.Integrazione.')
     A            C91UM03        4          COLHDG('Un.Misura........')
     A            C91VA03        8          COLHDG('Valore...........')
     A            C91FL03        1          COLHDG('Flag Layout .....')
     A            C91DI04       40          COLHDG('Des.Integrazione.')
     A            C91UM04        4          COLHDG('Un.Misura........')
     A            C91VA04        8          COLHDG('Valore...........')
     A            C91FL04        1          COLHDG('Flag Layout .....')
     A            C91DI05       40          COLHDG('Des.Integrazione.')
     A            C91UM05        4          COLHDG('Un.Misura........')
     A            C91VA05        8          COLHDG('Valore...........')
     A            C91FL05        1          COLHDG('Flag Layout .....')
     A            C91DI06       40          COLHDG('Des.Integrazione.')
     A            C91UM06        4          COLHDG('Un.Misura........')
     A            C91VA06        8          COLHDG('Valore...........')
     A            C91FL06        1          COLHDG('Flag Layout .....')
     A            C91DI07       40          COLHDG('Des.Integrazione.')
     A            C91UM07        4          COLHDG('Un.Misura........')
     A            C91VA07        8          COLHDG('Valore...........')
     A            C91FL07        1          COLHDG('Flag Layout .....')
     A            C91DI08       40          COLHDG('Des.Integrazione.')
     A            C91UM08        4          COLHDG('Un.Misura........')
     A            C91VA08        8          COLHDG('Valore...........')
     A            C91FL08        1          COLHDG('Flag Layout .....')
     A            C91DI09       40          COLHDG('Des.Integrazione.')
     A            C91UM09        4          COLHDG('Un.Misura........')
     A            C91VA09        8          COLHDG('Valore...........')
     A            C91FL09        1          COLHDG('Flag Layout .....')
     A            C91DI10       40          COLHDG('Des.Integrazione.')
     A            C91UM10        4          COLHDG('Un.Misura........')
     A            C91VA10        8          COLHDG('Valore...........')
     A            C91FL10        1          COLHDG('Flag Layout .....')
     A            C91DI11       40          COLHDG('Des.Integrazione.')
     A            C91UM11        4          COLHDG('Un.Misura........')
     A            C91VA11        8          COLHDG('Valore...........')
     A            C91FL11        1          COLHDG('Flag Layout .....')
     A            C91DI12       40          COLHDG('Des.Integrazione.')
     A            C91UM12        4          COLHDG('Un.Misura........')
     A            C91VA12        8          COLHDG('Valore...........')
     A            C91FL12        1          COLHDG('Flag Layout .....')
     A            C91DI13       40          COLHDG('Des.Integrazione.')
     A            C91UM13        4          COLHDG('Un.Misura........')
     A            C91VA13        8          COLHDG('Valore...........')
     A            C91FL13        1          COLHDG('Flag Layout .....')
     A            C91DI14       40          COLHDG('Des.Integrazione.')
     A            C91UM14        4          COLHDG('Un.Misura........')
     A            C91VA14        8          COLHDG('Valore...........')
     A            C91FL14        1          COLHDG('Flag Layout .....')
     A            C91DI15       40          COLHDG('Des.Integrazione.')
     A            C91UM15        4          COLHDG('Un.Misura........')
     A            C91VA15        8          COLHDG('Valore...........')
     A            C91FL15        1          COLHDG('Flag Layout .....')
     A            C91DI16       40          COLHDG('Des.Integrazione.')
     A            C91UM16        4          COLHDG('Un.Misura........')
     A            C91VA16        8          COLHDG('Valore...........')
     A            C91FL16        1          COLHDG('Flag Layout .....')
     A            C91DI17       40          COLHDG('Des.Integrazione.')
     A            C91UM17        4          COLHDG('Un.Misura........')
     A            C91VA17        8          COLHDG('Valore...........')
     A            C91FL17        1          COLHDG('Flag Layout .....')
     A            C91DI18       40          COLHDG('Des.Integrazione.')
     A            C91UM18        4          COLHDG('Un.Misura........')
     A            C91VA18        8          COLHDG('Valore...........')
     A            C91FL18        1          COLHDG('Flag Layout .....')
     A            C91DI19       40          COLHDG('Des.Integrazione.')
     A            C91UM19        4          COLHDG('Un.Misura........')
     A            C91VA19        8          COLHDG('Valore...........')
     A            C91FL19        1          COLHDG('Flag Layout .....')
     A            C91DI20       40          COLHDG('Des.Integrazione.')
     A            C91UM20        4          COLHDG('Un.Misura........')
     A            C91VA20        8          COLHDG('Valore...........')
     A            C91FL20        1          COLHDG('Flag Layout .....')
     A            C91DI21       40          COLHDG('Des.Integrazione.')
     A            C91UM21        4          COLHDG('Un.Misura........')
     A            C91VA21        8          COLHDG('Valore...........')
     A            C91FL21        1          COLHDG('Flag Layout .....')
     A            C91DI22       40          COLHDG('Des.Integrazione.')
     A            C91UM22        4          COLHDG('Un.Misura........')
     A            C91VA22        8          COLHDG('Valore...........')
     A            C91FL22        1          COLHDG('Flag Layout .....')
     A            C91DI23       40          COLHDG('Des.Integrazione.')
     A            C91UM23        4          COLHDG('Un.Misura........')
     A            C91VA23        8          COLHDG('Valore...........')
     A            C91FL23        1          COLHDG('Flag Layout .....')
     A            C91DI24       40          COLHDG('Des.Integrazione.')
     A            C91UM24        4          COLHDG('Un.Misura........')
     A            C91VA24        8          COLHDG('Valore...........')
     A            C91FL24        1          COLHDG('Flag Layout .....')
     A            C91DI25       40          COLHDG('Des.Integrazione.')
     A            C91UM25        4          COLHDG('Un.Misura........')
     A            C91VA25        8          COLHDG('Valore...........')
     A            C91FL25        1          COLHDG('Flag Layout .....')
     A            C91DI26       40          COLHDG('Des.Integrazione.')
     A            C91UM26        4          COLHDG('Un.Misura........')
     A            C91VA26        8          COLHDG('Valore...........')
     A            C91FL26        1          COLHDG('Flag Layout .....')
     A            C91DI27       40          COLHDG('Des.Integrazione.')
     A            C91UM27        4          COLHDG('Un.Misura........')
     A            C91VA27        8          COLHDG('Valore...........')
     A            C91FL27        1          COLHDG('Flag Layout .....')
     A            C91DI28       40          COLHDG('Des.Integrazione.')
     A            C91UM28        4          COLHDG('Un.Misura........')
     A            C91VA28        8          COLHDG('Valore...........')
     A            C91FL28        1          COLHDG('Flag Layout .....')
     A            C91DI29       40          COLHDG('Des.Integrazione.')
     A            C91UM29        4          COLHDG('Un.Misura........')
     A            C91VA29        8          COLHDG('Valore...........')
     A            C91FL29        1          COLHDG('Flag Layout .....')
     A            C91DI30       40          COLHDG('Des.Integrazione.')
     A            C91UM30        4          COLHDG('Un.Misura........')
     A            C91VA30        8          COLHDG('Valore...........')
     A            C91FL30        1          COLHDG('Flag Layout .....')
     A            C91DI31       40          COLHDG('Des.Integrazione.')
     A            C91UM31        4          COLHDG('Un.Misura........')
     A            C91VA31        8          COLHDG('Valore...........')
     A            C91FL31        1          COLHDG('Flag Layout .....')
     A            C91DI32       40          COLHDG('Des.Integrazione.')
     A            C91UM32        4          COLHDG('Un.Misura........')
     A            C91VA32        8          COLHDG('Valore...........')
     A            C91FL32        1          COLHDG('Flag Layout .....')
     A            C91DI33       40          COLHDG('Des.Integrazione.')
     A            C91UM33        4          COLHDG('Un.Misura........')
     A            C91VA33        8          COLHDG('Valore...........')
     A            C91FL33        1          COLHDG('Flag Layout .....')
     A            C91DI34       40          COLHDG('Des.Integrazione.')
     A            C91UM34        4          COLHDG('Un.Misura........')
     A            C91VA34        8          COLHDG('Valore...........')
     A            C91FL34        1          COLHDG('Flag Layout .....')
     A            C91DI35       40          COLHDG('Des.Integrazione.')
     A            C91UM35        4          COLHDG('Un.Misura........')
     A            C91VA35        8          COLHDG('Valore...........')
     A            C91FL35        1          COLHDG('Flag Layout .....')
     A            C91DI36       40          COLHDG('Des.Integrazione.')
     A            C91UM36        4          COLHDG('Un.Misura........')
     A            C91VA36        8          COLHDG('Valore...........')
     A            C91FL36        1          COLHDG('Flag Layout .....')
     A            C91DI37       40          COLHDG('Des.Integrazione.')
     A            C91UM37        4          COLHDG('Un.Misura........')
     A            C91VA37        8          COLHDG('Valore...........')
     A            C91FL37        1          COLHDG('Flag Layout .....')
     A            C91DI38       40          COLHDG('Des.Integrazione.')
     A            C91UM38        4          COLHDG('Un.Misura........')
     A            C91VA38        8          COLHDG('Valore...........')
     A            C91FL38        1          COLHDG('Flag Layout .....')
     A            C91DI39       40          COLHDG('Des.Integrazione.')
     A            C91UM39        4          COLHDG('Un.Misura........')
     A            C91VA39        8          COLHDG('Valore...........')
     A            C91FL39        1          COLHDG('Flag Layout .....')
     A            C91DI40       40          COLHDG('Des.Integrazione.')
     A            C91UM40        4          COLHDG('Un.Misura........')
     A            C91VA40        8          COLHDG('Valore...........')
     A            C91FL40        1          COLHDG('Flag Layout .....')
     A            C91DI41       40          COLHDG('Des.Integrazione.')
     A            C91UM41        4          COLHDG('Un.Misura........')
     A            C91VA41        8          COLHDG('Valore...........')
     A            C91FL41        1          COLHDG('Flag Layout .....')
     A            C91DI42       40          COLHDG('Des.Integrazione.')
     A            C91UM42        4          COLHDG('Un.Misura........')
     A            C91VA42        8          COLHDG('Valore...........')
     A            C91FL42        1          COLHDG('Flag Layout .....')
     A            C91DI43       40          COLHDG('Des.Integrazione.')
     A            C91UM43        4          COLHDG('Un.Misura........')
     A            C91VA43        8          COLHDG('Valore...........')
     A            C91FL43        1          COLHDG('Flag Layout .....')
     A            C91DI44       40          COLHDG('Des.Integrazione.')
     A            C91UM44        4          COLHDG('Un.Misura........')
     A            C91VA44        8          COLHDG('Valore...........')
     A            C91FL44        1          COLHDG('Flag Layout .....')
     A            C91DI45       40          COLHDG('Des.Integrazione.')
     A            C91UM45        4          COLHDG('Un.Misura........')
     A            C91VA45        8          COLHDG('Valore...........')
     A            C91FL45        1          COLHDG('Flag Layout .....')
     A            C91DI46       40          COLHDG('Des.Integrazione.')
     A            C91UM46        4          COLHDG('Un.Misura........')
     A            C91VA46        8          COLHDG('Valore...........')
     A            C91FL46        1          COLHDG('Flag Layout .....')
     A            C91DI47       40          COLHDG('Des.Integrazione.')
     A            C91UM47        4          COLHDG('Un.Misura........')
     A            C91VA47        8          COLHDG('Valore...........')
     A            C91FL47        1          COLHDG('Flag Layout .....')
     A            C91DI48       40          COLHDG('Des.Integrazione.')
     A            C91UM48        4          COLHDG('Un.Misura........')
     A            C91VA48        8          COLHDG('Valore...........')
     A            C91FL48        1          COLHDG('Flag Layout .....')
     A            C91DI49       40          COLHDG('Des.Integrazione.')
     A            C91UM49        4          COLHDG('Un.Misura........')
     A            C91VA49        8          COLHDG('Valore...........')
     A            C91FL49        1          COLHDG('Flag Layout .....')
     A            C91DI50       40          COLHDG('Des.Integrazione.')
     A            C91UM50        4          COLHDG('Un.Misura........')
     A            C91VA50        8          COLHDG('Valore...........')
     A            C91FL50        1          COLHDG('Flag Layout .....')
     A            C91DI51       40          COLHDG('Des.Integrazione.')
     A            C91UM51        4          COLHDG('Un.Misura........')
     A            C91VA51        8          COLHDG('Valore...........')
     A            C91FL51        1          COLHDG('Flag Layout .....')
     A            C91DI52       40          COLHDG('Des.Integrazione.')
     A            C91UM52        4          COLHDG('Un.Misura........')
     A            C91VA52        8          COLHDG('Valore...........')
     A            C91FL52        1          COLHDG('Flag Layout .....')
     A            C91DI53       40          COLHDG('Des.Integrazione.')
     A            C91UM53        4          COLHDG('Un.Misura........')
     A            C91VA53        8          COLHDG('Valore...........')
     A            C91FL53        1          COLHDG('Flag Layout .....')
     A            C91DI54       40          COLHDG('Des.Integrazione.')
     A            C91UM54        4          COLHDG('Un.Misura........')
     A            C91VA54        8          COLHDG('Valore...........')
     A            C91FL54        1          COLHDG('Flag Layout .....')
     A            C91DI55       40          COLHDG('Des.Integrazione.')
     A            C91UM55        4          COLHDG('Un.Misura........')
     A            C91VA55        8          COLHDG('Valore...........')
     A            C91FL55        1          COLHDG('Flag Layout .....')
     A            C91DI56       40          COLHDG('Des.Integrazione.')
     A            C91UM56        4          COLHDG('Un.Misura........')
     A            C91VA56        8          COLHDG('Valore...........')
     A            C91FL56        1          COLHDG('Flag Layout .....')
     A            C91DI57       40          COLHDG('Des.Integrazione.')
     A            C91UM57        4          COLHDG('Un.Misura........')
     A            C91VA57        8          COLHDG('Valore...........')
     A            C91FL57        1          COLHDG('Flag Layout .....')
     A            C91DI58       40          COLHDG('Des.Integrazione.')
     A            C91UM58        4          COLHDG('Un.Misura........')
     A            C91VA58        8          COLHDG('Valore...........')
     A            C91FL58        1          COLHDG('Flag Layout .....')
     A            C91DI59       40          COLHDG('Des.Integrazione.')
     A            C91UM59        4          COLHDG('Un.Misura........')
     A            C91VA59        8          COLHDG('Valore...........')
     A            C91FL59        1          COLHDG('Flag Layout .....')
     A            C91DI60       40          COLHDG('Des.Integrazione.')
     A            C91UM60        4          COLHDG('Un.Misura........')
     A            C91VA60        8          COLHDG('Valore...........')
     A            C91FL60        1          COLHDG('Flag Layout .....')
      *
     A            C91F010        2          COLHDG('Flag 01  ........')
     A            C91F020        2          COLHDG('Flag 02  ........')
     A            C91F030        2          COLHDG('Marchio  ........')
     A            C91F040        2          COLHDG('Nr Copie Cartel..')
     A            C91F050        2          COLHDG('C=Coccidiostatico')
     A            C91F060        2          COLHDG('Flag 06  ........')
     A            C91F070        2          COLHDG('Layout stampa ...')
     A            C91F080       10          COLHDG('Flag 08  ........')
     A            C91F090       10          COLHDG('Flag 09  ........')
     A            C91F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : LOGO02F0                                  *
     *  DESCRIZIONE   : Log file Orcl02f0                         *
     *  PREFISSO      : JB2                                       *
     ****************************************************************
     A            JB2STX0        1          COLHDG('Stato ...........')
     A            JB2USE0       10          COLHDG('Utente immissione')
     A            JB2DAE0        8  0       COLHDG('Data immissione .')
     A            JB2ORE0        6  0       COLHDG('Ora immissione...')
     A            JB2USA0       10          COLHDG('Utente aggiornam.')
     A            JB2DAA0        8  0       COLHDG('Data aggiornam...')
     A            JB2ORA0        6  0       COLHDG('Ora aggiornam....')
     A            JB2NRX0        9  0       COLHDG('Numero Azione ...')
     A            JB2CAZ0        4          COLHDG('Codice azione....')
     A            JB2PGM0       10          COLHDG('Programma immiss.')
     A            JB2PGA0       10          COLHDG('Programma modif..')
      *
     A            JB2JOENTL      5  0       COLHDG('Lunghezza della voce')
     A            JB2JOSEQN     10  0       COLHDG('Numero di sequenza  ')
     A            JB2JOCODE      1          COLHDG('Codice giornale     ')
     A            JB2JOENTT      2          COLHDG('Tipo di voce        ')
     A            JB2JODATE      6          COLHDG('Data immiss.: format')
     A            JB2JOTIME      6  0       COLHDG('Ora immiss.: ore/min')
     A            JB2JOJOB      10          COLHDG('Nome del lavoro     ')
     A            JB2JOUSER     10          COLHDG('Nome utente         ')
     A            JB2JONBR       6  0       COLHDG('Numero del lavoro   ')
     A            JB2JOPGM      10          COLHDG('Nome del programma  ')
     A            JB2JOOBJ      10          COLHDG('Nome dell''oggetto  ')
     A            JB2JOLIB      10          COLHDG('Libreria            ')
     A            JB2JOMBR      10          COLHDG('Nome del membro     ')
     A            JB2JOCTRR     10  0       COLHDG('Conteg. o numero rel')
     A            JB2JOFLAG      1          COLHDG('Indicatore: 1 o 0   ')
     A            JB2JOCCID     10  0       COLHDG('Identificativo ciclo')
     * =============================================================== *
     *  ARCHIVIO      : ORDF42F0                                     *
     *  DESCRIZIONE   : Tabella costi magazzinaggio                   *
     *  PREFISSO      : PE10                                         *
     * =============================================================== *
     A            PE10STAT0      1A         COLHDG('Stato ..............')
     A            PE10IMUT0     10A         COLHDG('Immissione utente...')
     A            PE10IMDA0      8  0       COLHDG('Immissione data ....')
     A            PE10IMOR0      6  0       COLHDG('Immissione ora .....')
     A            PE10IMPG0     10A         COLHDG('Immissione programma')
     A            PE10IMAZ0     10A         COLHDG('Immissione azione...')
     A            PE10AGUT0     10A         COLHDG('Aggiornamento utente')
     A            PE10AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            PE10AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            PE10AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            PE10AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            PE10SOCI0      2A         COLHDG('Società ............')
     *
     A            PE10SEQZ0      4  0       COLHDG('Sequenza ...........')
     A            PE10DESC0    400          COLHDG('Descrizione ........')
     *
     A            PE10PED10      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA10      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP10     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS10     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED20      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA20      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP20     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS20     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED30      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA30      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP30     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS30     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED40      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA40      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP40     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS40     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED50      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA50      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP50     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS50     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED60      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA60      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP60     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS60     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10PED70      4  0       COLHDG('Periodo DA .........')
     A            PE10PEA70      4  0       COLHDG('Periodo A ..........')
     A            PE10IMP70     11  6       COLHDG('Importo al KG ......')
     A            PE10ASS70     11  6       COLHDG('Assicurazione al KG.')
     *
     A            PE10FL010      2          COLHDG('Flag 01 ............')
     A            PE10FL020      2          COLHDG('Flag 02 ............')
     A            PE10FL030      2          COLHDG('Flag 03 ............')
     A            PE10FL040      2          COLHDG('Flag 04 ............')
     A            PE10FL050      2          COLHDG('Flag 05 ............')
     A            PE10FL060     10          COLHDG('Flag 06 ............')
     A            PE10FL070     10          COLHDG('Flag 07 ............')
     A            PE10FL080     10          COLHDG('Flag 08 ............')
     A            PE10FL090     10          COLHDG('Flag 09 ............')
     A            PE10FL100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LOGALLF0                                     *
     *  DESCRIZIONE   : Log per invio e-mail con allegato documenti   *
     *  PREFISSO      : AL00                                         *
     * =============================================================== *
     A            AL00STAT0      1A         COLHDG('Stato ..............')
     A            AL00IMUT0     10A         COLHDG('Immissione utente...')
     A            AL00IMDA0      8  0       COLHDG('Immissione data ....')
     A            AL00IMOR0      6  0       COLHDG('Immissione ora .....')
     A            AL00IMPG0     10A         COLHDG('Immissione programma')
     A            AL00IMAZ0     10A         COLHDG('Immissione azione...')
     A            AL00AGUT0     10A         COLHDG('Aggiornamento utente')
     A            AL00AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            AL00AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            AL00AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            AL00AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            AL00SOCI0      2A         COLHDG('Società ............')
     *
     A            AL00DDOC0      8  0       COLHDG('Data Documento .....')
     A            AL00NDOC0      6  0       COLHDG('Num. Documento .....')
     A            AL00CLIE0      6          COLHDG('Cliente Int.Fatt. ..')
     A            AL00MES10    100          COLHDG('Messaggio 1 ........')
     A            AL00MES20    100          COLHDG('Messaggio 2 ........')
     *
     A            AL00FL010      2          COLHDG('Flag 01 ............')
     A            AL00FL020      2          COLHDG('Flag 02 ............')
     A            AL00FL030      2          COLHDG('Flag 03 ............')
     A            AL00FL040      2          COLHDG('Flag 04 ............')
     A            AL00FL050      2          COLHDG('Flag 05 ............')
     A            AL00FL060     10          COLHDG('Flag 06 ............')
     A            AL00FL070     10          COLHDG('Flag 07 ............')
     A            AL00FL080     10          COLHDG('Flag 08 ............')
     A            AL00FL090     10          COLHDG('Flag 09 ............')
     A            AL00FL100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : ANACAUF0                                     *
     *  DESCRIZIONE   : Anagr. Causali per errore di invio .XML a SDI *
     *  PREFISSO      : CS00                                         *
     * =============================================================== *
     A            CS00STAT0      1A         COLHDG('Stato ..............')
     A            CS00IMUT0     10A         COLHDG('Immissione utente...')
     A            CS00IMDA0      8  0       COLHDG('Immissione data ....')
     A            CS00IMOR0      6  0       COLHDG('Immissione ora .....')
     A            CS00IMPG0     10A         COLHDG('Immissione programma')
     A            CS00IMAZ0     10A         COLHDG('Immissione azione...')
     A            CS00AGUT0     10A         COLHDG('Aggiornamento utente')
     A            CS00AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            CS00AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            CS00AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            CS00AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            CS00SOCI0      2A         COLHDG('Società ............')
     *
     A            CS00CCAU0     10          COLHDG('Cod. Causale .......')
     A            CS00DCAU0     30          COLHDG('Des. Causale .......')
     *
     A            CS00FL010      2          COLHDG('Flag 01 ............')
     A            CS00FL020      2          COLHDG('Flag 02 ............')
     A            CS00FL030      2          COLHDG('Flag 03 ............')
     A            CS00FL040      2          COLHDG('Flag 04 ............')
     A            CS00FL050      2          COLHDG('Flag 05 ............')
     A            CS00FL060     10          COLHDG('Flag 06 ............')
     A            CS00FL070     10          COLHDG('Flag 07 ............')
     A            CS00FL080     10          COLHDG('Flag 08 ............')
     A            CS00FL090     10          COLHDG('Flag 09 ............')
     A            CS00FL100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : PROINSF0                                     *
     *  DESCRIZIONE   : Articoli con dati per programma Insacco       *
     *  PREFISSO      : CS01                                         *
     * =============================================================== *
     A            CS01STAT0      1A         COLHDG('Stato ..............')
     A            CS01IMUT0     10A         COLHDG('Immissione utente...')
     A            CS01IMDA0      8  0       COLHDG('Immissione data ....')
     A            CS01IMOR0      6  0       COLHDG('Immissione ora .....')
     A            CS01IMPG0     10A         COLHDG('Immissione programma')
     A            CS01IMAZ0     10A         COLHDG('Immissione azione...')
     A            CS01AGUT0     10A         COLHDG('Aggiornamento utente')
     A            CS01AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            CS01AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            CS01AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            CS01AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            CS01SOCI0      2A         COLHDG('Società ............')
     *
     A            CS01PROD0     15          COLHDG('Cod. Prodotto ......')
     A            CS01PRGN0      4  0       COLHDG('Nr Programma .......')
     A            CS01PRGP0      4  0       COLHDG('Nr Progr. Pallettiz.')
     *
     A            CS01FL010      2          COLHDG('Flag 01 ............')
     A            CS01FL020      2          COLHDG('Flag 02 ............')
     A            CS01FL030      2          COLHDG('Flag 03 ............')
     A            CS01FL040      2          COLHDG('Flag 04 ............')
     A            CS01FL050      2          COLHDG('Flag 05 ............')
     A            CS01FL060     10          COLHDG('Flag 06 ............')
     A            CS01FL070     10          COLHDG('Flag 07 ............')
     A            CS01FL080     10          COLHDG('Flag 08 ............')
     A            CS01FL090     10          COLHDG('Flag 09 ............')
     A            CS01FL100     10          COLHDG('Flag 10 ............')
     * ================================================================== *
     *  ARCHIVIO      : VENMEDF0                                        *
     *  DESCRIZIONE   : Vendita medicati da segnalare con mail ad utenti *
     *  PREFISSO      : VM01                                            *
     * ================================================================== *
     A            VM01MAGA0      2          COLHDG('Magazzino ..........')
     A            VM01DDOC0      8  0       COLHDG('Data Documento .....')
     A            VM01NDOC0      6  0       COLHDG('Num. Documento .....')
     A            VM01NORD0      9  0       COLHDG('Num. Ordine ........')
     A            VM01RDOC0      4  0       COLHDG('Riga Documento .....')
     A            VM01TDOC0      2          COLHDG('Tipo Documento .....')
     A            VM01CPRO0     15          COLHDG('Cod. Prodotto ......')
     A            VM01DPRO0     30          COLHDG('Des. Prodotto ......')
     A            VM01LOTT0      9  0       COLHDG('Nr Lotto ...........')
     A            VM01QUAN0     12  2       COLHDG('Q.tà Prodotto ......')
     A            VM01OMAG0      1          COLHDG('Omaggio ............')
     A            VM01SCAD0      8  0       COLHDG('Data Scadenza ......')
     A            VM01CVET0      6          COLHDG('Cod. Veterinario ...')
     A            VM01DVET0     30          COLHDG('Des. Veterinario ...')
     A            VM01CCLI0      6          COLHDG('Cod. Cliente .......')
     A            VM01DCLI0     30          COLHDG('Des. Cliente .......')
     A            VM01OKVE0      2          COLHDG('OK=caricato Vetinfo.')
     * ================================================================== *
     *  ARCHIVIO      : DETRICF0                                        *
     *  DESCRIZIONE   : File di Dettaglio Riconsegne per Indesil         *
     *  PREFISSO      : DR0                                             *
     * ================================================================== *
     A            DR0DTDOC0      8  0       COLHDG('Data Documento .....')
     A            DR0NRDOC0      6  0       COLHDG('Num. Documento .....')
     A            DR0QUANT0     12  2       COLHDG('Quantità ...........')
     A            DR0CDPAR0     15          COLHDG('Cod. Prodotto ......')
     A            DR0DEPAR0     30          COLHDG('Des. Prodotto ......')
     A            DR0CDCLI0      6          COLHDG('Cod. Cliente .......')
     A            DR0RASCL0     30          COLHDG('Rag.Soc.Cliente ....')
     A            DR0DISPO0     15          COLHDG('Disposizione .......')
     A            DR0IMBAR0     20          COLHDG('Imbarcazione .......')
     * =============================================================== *
     *  ARCHIVIO      : FORPERF0                                     *
     *  DESCRIZIONE   : Formule Personal delta valore tra versioni    *
     *  PREFISSO      : FP0                                          *
     * =============================================================== *
     A            FP0STAT0       1A         COLHDG('Stato ..............')
     A            FP0IMUT0      10A         COLHDG('Immissione utente...')
     A            FP0IMDA0       8  0       COLHDG('Immissione data ....')
     A            FP0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            FP0IMPG0      10A         COLHDG('Immissione programma')
     A            FP0IMAZ0      10A         COLHDG('Immissione azione...')
     A            FP0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            FP0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            FP0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            FP0AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            FP0AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            FP0SOCI0       2A         COLHDG('Società ............')
     *
     A            FP0MAGA0       2          COLHDG('Cod. Magazzino .....')
     A            FP0FORM0       6          COLHDG('Cod. Formula daeti .')
     A            FP0PROD0      15          COLHDG('Cod. Prodotto ......')
     A            FP0CLIE0       6          COLHDG('Cod. Cliente .......')
     A            FP0PZOA0      12  4       COLHDG('Costo form. attuale ')
     A            FP0PZOP0      12  4       COLHDG('Costo form. preced. ')
     A            FP0MDCO0      12  4       COLHDG('Margine Contrib. ...')
     *
     A            FP0DTRI0       8  0       COLHDG('Data Riferimento ...')
     A            FP0FASE0       2          COLHDG('Fase record ........')
     A            FP0UTEN0      10          COLHDG('Utente Autorizz. ...')
     A            FP0DATA0       8  0       COLHDG('Data   Autorizz. ...')
     A            FP0ORAR0       6  0       COLHDG('Ora    Autorizz. ...')
     A            FP0AGEN0       3          COLHDG('Cod. Agente ........')
     A            FP0ISPE0       3          COLHDG('Cod. Ispettore .....')
     A            FP0AREA0       3          COLHDG('Cod. Area Manager ..')
     A            FP0MARC0       2          COLHDG('Marchio ............')
     *
     A            FP0FL010       2          COLHDG('Flag 01 ............')
     A            FP0FL020       2          COLHDG('Flag 02 ............')
     A            FP0FL030       2          COLHDG('Flag 03 ............')
     A            FP0FL040       2          COLHDG('Flag 04 ............')
     A            FP0FL050       2          COLHDG('Flag 05 ............')
     A            FP0FL060      10          COLHDG('Flag 06 ............')
     A            FP0FL070      10          COLHDG('Flag 07 ............')
     A            FP0FL080      10          COLHDG('Flag 08 ............')
     A            FP0FL090      10          COLHDG('Flag 09 ............')
     A            FP0FL100      10          COLHDG('Flag 10 ............')
     ****************************************************************
     *  TABELLA       : FLSATEF0                                  *
     *  DESCRIZIONE   : Salvataggio dati Fatturazione Libera Testata
     *  PREFISSO      : TFL                                       *
     ****************************************************************
     A            TFLSTX0        1          COLHDG('Stato ...........')
     A            TFLUSE0       10          COLHDG('Utente immissione')
     A            TFLDAE0        8  0       COLHDG('Data immissione .')
     A            TFLORE0        6  0       COLHDG('Ora immissione...')
     A            TFLPGM0       10          COLHDG('Programma immiss.')
     A            TFLUSA0       10          COLHDG('Utente aggiornam.')
     A            TFLDAA0        8  0       COLHDG('Data aggiornam...')
     A            TFLORA0        6  0       COLHDG('Ora aggiornam....')
     A            TFLPGA0       10          COLHDG('Programma modif..')
      *
     A            TFLCLI0        6          COLHDG('Codice cliente...')
     A            TFLMAR0        2          COLHDG('Marchio .........')
     A            TFLDAD0        8  0       COLHDG('Data documento...')
     A            TFLNUO0        9  0       COLHDG('Numero ordine ...')
     A            TFLTID0        3          COLHDG('Tipo documento...')
     A            TFLTIF0        1          COLHDG('Tipo fatturazione')
     A            TFLCAD0        2          COLHDG('Causale documento')
     A            TFLPAG0        3          COLHDG('Codice pagamento.')
     A            TFLDAS0        8  0       COLHDG('Data scadenza....')
     A            TFLNOT0       80          COLHDG('Nota in testata..')
     A            TFLNOP0       80          COLHDG('Nota pie pagina..')
     A            TFLDAF0        8  0       COLHDG('Data fattura vera')
     A            TFLNUF0        6  0       COLHDG('Nume.fattura vera')
     A            TFLCAN0        2          COLHDG('Tipo accredito...')
     A            TFLDAR0        8  0       COLHDG('Data fat.riferim.')
     A            TFLNUR0        6  0       COLHDG('Nume.fat.riferim.')
     A            TFLTDE0        4          COLHDG('Tip.Doc.Fatt.Elettr.')
     *
     A            TFLF010        2          COLHDG('Flag 01 ............')
     A            TFLF020        2          COLHDG('Flag 01 ............')
     A            TFLF030        2          COLHDG('Flag 01 ............')
     A            TFLF040        2          COLHDG('Flag 01 ............')
     A            TFLF050        2          COLHDG('Flag 01 ............')
     A            TFLF060       10          COLHDG('Flag 01 ............')
     A            TFLF070       10          COLHDG('Flag 01 ............')
     A            TFLF080       10          COLHDG('Flag 01 ............')
     A            TFLF090       10          COLHDG('Flag 01 ............')
     A            TFLF100       10          COLHDG('Flag 01 ............')
     ****************************************************************
     *  TABELLA       : FLSADEF0                                  *
     *  DESCRIZIONE   : Salvataggio dati Fatturazione Libera Dettaglio
     *  PREFISSO      : TFd                                       *
     ****************************************************************
     A            TFDSTX0        1          COLHDG('Stato ...........')
     A            TFDUSE0       10          COLHDG('Utente immissione')
     A            TFDDAE0        8  0       COLHDG('Data immissione .')
     A            TFDORE0        6  0       COLHDG('Ora immissione...')
     A            TFDPGM0       10          COLHDG('Programma immiss.')
     A            TFDUSA0       10          COLHDG('Utente aggiornam.')
     A            TFDDAA0        8  0       COLHDG('Data aggiornam...')
     A            TFDORA0        6  0       COLHDG('Ora aggiornam....')
     A            TFDPGA0       10          COLHDG('Programma modif..')
      *
     A            TFDNUO0        9  0       COLHDG('Numero ordine....')
     A            TFDRIO0        4  0       COLHDG('Riga ordine......')
     A            TFDTXT0     1000          COLHDG('Testo div.x 40 ca')
     A            TFDUNM0        2          COLHDG('Unità di misura..')
     A            TFDQTA0        9  3       COLHDG('Quantità.........')
     A            TFDPRZ0       11  5       COLHDG('Prezzo...........')
     A            TFDIMP0       11  2       COLHDG('Importo..........')
     A            TFDIVA0        2          COLHDG('Aliquota iva.....')
     A            TFDCNT0       12          COLHDG('Conto ACG........')
     A            TFDFAN0        1          COLHDG('Flag analitica ..')
     A            TFDFCN0       12          COLHDG('Conto analitica..')
     A            TFDCTC0        7          COLHDG('Centro di costo..')
     *
     A            TFDF010        2          COLHDG('Flag 01 ............')
     A            TFDF020        2          COLHDG('Flag 01 ............')
     A            TFDF030        2          COLHDG('Flag 01 ............')
     A            TFDF040        2          COLHDG('Flag 01 ............')
     A            TFDF050        2          COLHDG('Flag 01 ............')
     A            TFDF060       10          COLHDG('Flag 01 ............')
     A            TFDF070       10          COLHDG('Flag 01 ............')
     A            TFDF080       10          COLHDG('Flag 01 ............')
     A            TFDF090       10          COLHDG('Flag 01 ............')
     A            TFDF100       10          COLHDG('Flag 01 ............')
      *
     * ============================================================ *
     *  TABELLA       : SACCOGF0                                  *
     *  DESCRIZIONE   : Produzione sacchi per Cogeim              *
     *  PREFISSO      : PS02                                      *
     * ============================================================ *
     A            PS02STAT0      1A         COLHDG('Stato ..............')
      *
     A            PS02MAGA0      2          COLHDG('Magazzino ..........')
     A            PS02PROD0     15          COLHDG('Cod.  Prodotto .....')
     A            PS02DESC0     30          COLHDG('Des.  Prodotto .....')
     A            PS02DAET0      6          COLHDG('Daeti cod. formula .')
     A            PS02CLAP0      3          COLHDG('Tipo Prodotto Forma ')
     A            PS02UNMI0      2          COLHDG('Unità di Misura ....')
     A            PS02MARC0      2          COLHDG('Marchio ............')
     A            PS02DICU0      1          COLHDG('Dimensione Cubetto .')
      *
     A            PS02QTAA0     12  0       COLHDG('Q.tà in Giacenza ...')
     A            PS02QTAB0     12  0       COLHDG('Q.tà in Evasione ...')
     A            PS02QTAC0     12  0       COLHDG('Q.tà in Progr. Prod.')
     A            PS02QTAD0     12  0       COLHDG('Q.tà Disp. .........')
     A            PS02QTAE0     12  0       COLHDG('Q.tà da Spedire ....')
     A            PS02QTAF0     12  0       COLHDG('Q.tà Mancante ......')
     A            PS02QTAG0     12  0       COLHDG('Q.tà da Lanciare ...')
      *
     A            PS02IMPI0      3          COLHDG('Insacco ............')
     A            PS02CUBE0      3          COLHDG('Cubettatrice .......')
     A            PS02SEQU0      4  0       COLHDG('Sequenza ...........')
     A            PS02ANNU0      3          COLHDG('ANN = Annullamento .')
     A            PS02MAOR0      4  0       COLHDG('Mancherà Ora .......')
     A            PS02MADT0      8  0       COLHDG('Mancherà Data ......')
      *
     A            PS02NOTE0    100          COLHDG('Note ...............')
     A            PS02NORD0      9  0       COLHDG('Nr Ordine ..........')
     A            PS02NVIA0      9  0       COLHDG('Nr Viaggio .........')
      *
     A            PS02FASE0      1          COLHDG('Fase: 0=Inv.a Cogeim')
      *                                                   1=Inizio prod.')
      *                                                   2=Fine   prod')
      *
     A            PS02DASP0      8  0       COLHDG('Data Spedizione ....')
     A            PS02ORAR0      6  0       COLHDG('Ora  Spedizione ....')
      *
     A            PS02LINE0      2          COLHDG('Linea Prodotto .....')
     A            PS02FL010      2          COLHDG('Flag 01 ............')
     A            PS02FL020      2          COLHDG('Flag 02 ............')
     A            PS02FL030      2          COLHDG('Flag 03 ............')
     A            PS02FL040      2          COLHDG('Flag 04 ............')
     A            PS02FL050      2          COLHDG('Flag 05 ............')
     A            PS02FL060     10          COLHDG('Flag 06 ............')
     A            PS02FL070     10          COLHDG('Flag 07 ............')
     A            PS02FL080     10          COLHDG('Flag 08 ............')
     A            PS02FL090     10          COLHDG('Flag 09 ............')
     A            PS02FL100     10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : EMATECF0                                  *
     *  DESCRIZIONE   : Email tecnici per invio report analisi    *
     *  PREFISSO      : ET01                                      *
     * ============================================================ *
     A            ET01STAT0      1A         COLHDG('Stato ..............')
     A            ET01IMUT0     10A         COLHDG('Immissione utente...')
     A            ET01IMDA0      8  0       COLHDG('Immissione data ....')
     A            ET01IMOR0      6  0       COLHDG('Immissione ora .....')
     A            ET01IMPG0     10A         COLHDG('Immissione programma')
     A            ET01IMAZ0     10A         COLHDG('Immissione azione...')
     A            ET01AGUT0     10A         COLHDG('Aggiornamento utente')
     A            ET01AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            ET01AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            ET01AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            ET01AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            ET01SOCI0      2A         COLHDG('Società ............')
      *
     A            ET01CRIC0      3          COLHDG('Cod. Richiedente ...')
     A            ET01EMAI0     60          COLHDG('E-Mail Richiedente .')
      *
     A            ET01FL010      2          COLHDG('Flag 01 ............')
     A            ET01FL020      2          COLHDG('Flag 02 ............')
     A            ET01FL030      2          COLHDG('Flag 03 ............')
     A            ET01FL040      2          COLHDG('Flag 04 ............')
     A            ET01FL050      2          COLHDG('Flag 05 ............')
     A            ET01FL060     10          COLHDG('Flag 06 ............')
     A            ET01FL070     10          COLHDG('Flag 07 ............')
     A            ET01FL080     10          COLHDG('Flag 08 ............')
     A            ET01FL090     10          COLHDG('Flag 09 ............')
     A            ET01FL100     10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : EMARICF0                                  *
     *  DESCRIZIONE   : Memo nr richiesta analisi inviata  x email *
     *  PREFISSO      : ET02                                      *
     * ============================================================ *
     A            ET02STAT0      1A         COLHDG('Stato ..............')
     A            ET02IMUT0     10A         COLHDG('Immissione utente...')
     A            ET02IMDA0      8  0       COLHDG('Immissione data ....')
     A            ET02IMOR0      6  0       COLHDG('Immissione ora .....')
     A            ET02IMPG0     10A         COLHDG('Immissione programma')
     A            ET02IMAZ0     10A         COLHDG('Immissione azione...')
     A            ET02AGUT0     10A         COLHDG('Aggiornamento utente')
     A            ET02AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            ET02AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            ET02AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            ET02AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            ET02SOCI0      2A         COLHDG('Società ............')
      *
     A            ET02NRIC0      9  0       COLHDG('Num. Richiesta Anal.')
      *
     A            ET02FL010      2          COLHDG('Flag 01 ............')
     A            ET02FL020      2          COLHDG('Flag 02 ............')
     A            ET02FL030      2          COLHDG('Flag 03 ............')
     A            ET02FL040      2          COLHDG('Flag 04 ............')
     A            ET02FL050      2          COLHDG('Flag 05 ............')
     A            ET02FL060     10          COLHDG('Flag 06 ............')
     A            ET02FL070     10          COLHDG('Flag 07 ............')
     A            ET02FL080     10          COLHDG('Flag 08 ............')
     A            ET02FL090     10          COLHDG('Flag 09 ............')
     A            ET02FL100     10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : PTVVIAF0                                  *
     *  DESCRIZIONE   : viaggio ottimizzato da PTV                *
     *  PREFISSO      : PTV                                       *
     * ============================================================ *
     A            PTVSTAT0       1A         COLHDG('Stato ..............')
     A            PTVIMUT0      10A         COLHDG('Immissione utente...')
     A            PTVIMDA0       8  0       COLHDG('Immissione data ....')
     A            PTVIMOR0       6  0       COLHDG('Immissione ora .....')
     A            PTVIMPG0      10A         COLHDG('Immissione programma')
     A            PTVIMAZ0      10A         COLHDG('Immissione azione...')
     A            PTVAGUT0      10A         COLHDG('Aggiornamento utente')
     A            PTVAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            PTVAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            PTVAGPG0      10A         COLHDG('Aggiornamento progr.')
     A            PTVAGAZ0      10A         COLHDG('Aggiornamento azione')
     A            PTVSOCI0       2A         COLHDG('Società ............')
      *
     A            PTVNVIA0       9  0       COLHDG('Numero viaggio .....')
     A            PTVNVI10       9  0       COLHDG('Numero viaggio 1....')
     A            PTVNVI20       9  0       COLHDG('Numero viaggio 2....')
     A            PTVSEQU0       3  0       COLHDG('Numero sequenza PTV.')
     A            PTVCLIE0       6          COLHDG('Codice cliente .....')
     A            PTVCIND0      45          COLHDG('Indirizzo ERP ......')
     A            PTVPIND0      60          COLHDG('Indirizzo PTV ......')
     A            PTVPCIV0       6          COLHDG('Civico    PTV ......')
     A            PTVCLOC0      45          COLHDG('Località  ERP ......')
     A            PTVPLOC0      60          COLHDG('Località  PTV ......')
     A            PTVCCOM0      45          COLHDG('Comune    ERP ......')
     A            PTVPCOM0      60          COLHDG('Comune    PTV ......')
     A            PTVCCAP0       5          COLHDG('Cap       ERP ......')
     A            PTVPCAP0       5          COLHDG('Cap       PTV ......')
     A            PTVPTIC0       1          COLHDG('Tipo coordinate M/P.')
      *                                             M=Mignini   P=PTV
     A            PTVPCOX0      15          COLHDG('Coordinate X PTV ...')
     A            PTVPCOY0      15          COLHDG('Coordinate Y PTV ...')
     A            PTVPKMI0       8  2       COLHDG('KM intermedi .......')
     A            PTVPKMP0       8  2       COLHDG('KM progressivi .....')
     A            PTVPREC0      30          COLHDG('Precisione PTV .....')
      *
     A            PTVFL010       2          COLHDG('Flag 01 ............')
     A            PTVFL020       2          COLHDG('Flag 02 ............')
     A            PTVFL030       2          COLHDG('Flag 03 ............')
     A            PTVFL040       2          COLHDG('Flag 04 ............')
     A            PTVFL050       2          COLHDG('Flag 05 ............')
     A            PTVFL060      10          COLHDG('Flag 06 ............')
     A            PTVFL070      10          COLHDG('Flag 07 ............')
     A            PTVFL080      10          COLHDG('Flag 08 ............')
     A            PTVFL090      10          COLHDG('Flag 09 ............')
     A            PTVFL100      10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : BOLDOCF0                                  *
     *  DESCRIZIONE   : Memo Nr Doc. con Bollo Virtuale           *
     *  PREFISSO      : BV0                                       *
     * ============================================================ *
     A            BV0STAT0       1A         COLHDG('Stato ..............')
     A            BV0IMUT0      10A         COLHDG('Immissione utente...')
     A            BV0IMDA0       8  0       COLHDG('Immissione data ....')
     A            BV0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BV0IMPG0      10A         COLHDG('Immissione programma')
     A            BV0IMAZ0      10A         COLHDG('Immissione azione...')
     A            BV0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BV0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BV0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BV0AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BV0AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BV0SOCI0       2A         COLHDG('Società ............')
      *
     A            BV0DDOC0       8  0       COLHDG('Data Documento .....')
     A            BV0NDOC0       6  0       COLHDG('Num. Documento .....')
     A            BV0CLIE0       6          COLHDG('Codice cliente .....')
     A            BV0NORD0       9  0       COLHDG('Num. Ordine ........')
      *
     A            BV0FL010       2          COLHDG('Flag 01 ............')
     A            BV0FL020       2          COLHDG('Flag 02 ............')
     A            BV0FL030       2          COLHDG('Flag 03 ............')
     A            BV0FL040       2          COLHDG('Flag 04 ............')
     A            BV0FL050       2          COLHDG('Flag 05 ............')
     A            BV0FL060      10          COLHDG('Flag 06 ............')
     A            BV0FL070      10          COLHDG('Flag 07 ............')
     A            BV0FL080      10          COLHDG('Flag 08 ............')
     A            BV0FL090      10          COLHDG('Flag 09 ............')
     A            BV0FL100      10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : ENTMERF0                                  *
     *  DESCRIZIONE   : Entrate merci m.p.                        *
     *  PREFISSO      : EM0                                       *
     * ============================================================ *
     A            EM0STAB0       2          COLHDG('Stabilimento .......')
     A            EM0ANNO0       4  0       COLHDG('Anno ...............')
     A            EM0CMAT0      15          COLHDG('Cod. M.P. ..........')
     A            EM0DMAT0      30          COLHDG('Des. M.P. ..........')
      *
     A            EM0QL010      12  2       COLHDG('Q.li ........... Gen')
     A            EM0EU010      12  2       COLHDG('Euro q.le merci  Gen')
     A            EM0SG010      12  2       COLHDG('Euro q.le std G  Gen')
     A            EM0SC010      12  2       COLHDG('Euro q.le std C  Gen')
     A            EM0QL020      12  2       COLHDG('Q.li ........... Feb')
     A            EM0EU020      12  2       COLHDG('Euro q.le merci  Feb')
     A            EM0SG020      12  2       COLHDG('Euro q.le std G  Feb')
     A            EM0SC020      12  2       COLHDG('Euro q.le std C  Feb')
     A            EM0QL030      12  2       COLHDG('Q.li ........... Mar')
     A            EM0EU030      12  2       COLHDG('Euro q.le merci  Mar')
     A            EM0SG030      12  2       COLHDG('Euro q.le std G  Mar')
     A            EM0SC030      12  2       COLHDG('Euro q.le std C  Mar')
     A            EM0QL040      12  2       COLHDG('Q.li ........... Apr')
     A            EM0EU040      12  2       COLHDG('Euro q.le merci  Apr')
     A            EM0SG040      12  2       COLHDG('Euro q.le std G  Apr')
     A            EM0SC040      12  2       COLHDG('Euro q.le std C  Apr')
     A            EM0QL050      12  2       COLHDG('Q.li ........... Mag')
     A            EM0EU050      12  2       COLHDG('Euro q.le merci  Mag')
     A            EM0SG050      12  2       COLHDG('Euro q.le std G  Mag')
     A            EM0SC050      12  2       COLHDG('Euro q.le std C  Mag')
     A            EM0QL060      12  2       COLHDG('Q.li ........... Giu')
     A            EM0EU060      12  2       COLHDG('Euro q.le merci  Giu')
     A            EM0SG060      12  2       COLHDG('Euro q.le std G  Giu')
     A            EM0SC060      12  2       COLHDG('Euro q.le std C  Giu')
     A            EM0QL070      12  2       COLHDG('Q.li ........... Lug')
     A            EM0EU070      12  2       COLHDG('Euro q.le merci  Lug')
     A            EM0SG070      12  2       COLHDG('Euro q.le std G  Lug')
     A            EM0SC070      12  2       COLHDG('Euro q.le std C  Lug')
     A            EM0QL080      12  2       COLHDG('Q.li ........... Ago')
     A            EM0EU080      12  2       COLHDG('Euro q.le merci  Ago')
     A            EM0SG080      12  2       COLHDG('Euro q.le std G  Ago')
     A            EM0SC080      12  2       COLHDG('Euro q.le std C  Ago')
     A            EM0QL090      12  2       COLHDG('Q.li ........... Set')
     A            EM0EU090      12  2       COLHDG('Euro q.le merci  Set')
     A            EM0SG090      12  2       COLHDG('Euro q.le std G  Set')
     A            EM0SC090      12  2       COLHDG('Euro q.le std C  Set')
     A            EM0QL100      12  2       COLHDG('Q.li ........... Ott')
     A            EM0EU100      12  2       COLHDG('Euro q.le merci  Ott')
     A            EM0SG100      12  2       COLHDG('Euro q.le std G  Ott')
     A            EM0SC100      12  2       COLHDG('Euro q.le std C  Ott')
     A            EM0QL110      12  2       COLHDG('Q.li ........... Nov')
     A            EM0EU110      12  2       COLHDG('Euro q.le merci  Nov')
     A            EM0SG110      12  2       COLHDG('Euro q.le std G  Nov')
     A            EM0SC110      12  2       COLHDG('Euro q.le std C  Nov')
     A            EM0QL120      12  2       COLHDG('Q.li ........... Dic')
     A            EM0EU120      12  2       COLHDG('Euro q.le merci  Dic')
     A            EM0SG120      12  2       COLHDG('Euro q.le std G  Dic')
     A            EM0SC120      12  2       COLHDG('Euro q.le std C  Dic')
     A            EM0QL130      12  2       COLHDG('Q.li ........... Tot')
     A            EM0EU130      12  2       COLHDG('Euro q.le merci  Tot')
     A            EM0SG130      12  2       COLHDG('Euro q.le std G  Tot')
     A            EM0SC130      12  2       COLHDG('Euro q.le std C  Tot')
     * ============================================================ *
     *  TABELLA       : ARX031F0                                  *
     *  DESCRIZIONE   : Doc. C.A. non presenti su DM_PROFILE      *
     *  PREFISSO      : AX0                                       *
     * ============================================================ *
     A            AX0AZIE0       2          COLHDG('01=Mg,02=In.,03=Cape')
     A            AX0DATA0      10          COLHDG('Data Documento .....')
     A            AX0NUME0      20          COLHDG('Num.Documento ......')
     A            AX0CLIE0       6          COLHDG('Cliente ............')
     A            AX0FILE0      50          COLHDG('Nome file Xml ......')
     * ============================================================ *
     *  TABELLA       : BOLLETF0                                  *
     *  DESCRIZIONE   : Testate Auto BL/FT per Regime Esonero     *
     *  PREFISSO      : ES0                                       *
     * ============================================================ *
     A            ES0STAT0       1A         COLHDG('Stato ..............')
     A            ES0IMUT0      10A         COLHDG('Immissione utente...')
     A            ES0IMDA0       8  0       COLHDG('Immissione data ....')
     A            ES0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            ES0IMPG0      10A         COLHDG('Immissione programma')
     A            ES0IMAZ0      10A         COLHDG('Immissione azione...')
     A            ES0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            ES0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            ES0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            ES0AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            ES0AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            ES0SOCI0       2A         COLHDG('Società ............')
      *
     A            ES0NORD0       9  0       COLHDG('Nr Ordine ..........')
     A            ES0DORD0       8  0       COLHDG('Dt Ordine ..........')
     A            ES0NBOL0       6  0       COLHDG('Nr Bolla ...........')
     A            ES0DBOL0       8  0       COLHDG('Dt Bolla ...........')
     A            ES0NFAT0       6  0       COLHDG('Nr Fattura .........')
     A            ES0DFAT0       8  0       COLHDG('Dt Fattura .........')
     A            ES0FASE0       2          COLHDG('BL / FT ............')
      *
     A            ES0CCED0       6          COLHDG('Codice Cedente .....')
     A            ES0CCES0       6          COLHDG('Codice Cessionario..')
     A            ES0CDES0       6          COLHDG('Codice Destinatario ')
     A            ES0CTRA0      50          COLHDG('Causale Trasporto ..')
     A            ES0ASPE0      50          COLHDG('Aspetto dei Beni ...')
     A            ES0NRCL0      10          COLHDG('Num.Colli Totali....')
     A            ES0PEKG0      12  2       COLHDG('Peso Kg   Totali....')
     A            ES0PORT0      50          COLHDG('Porto ..............')
     A            ES0VETT0     100          COLHDG('Vettore ............')
     A            ES0DTRI0       8  0       COLHDG('Data Ritiro ........')
     A            ES0ORRI0       6  0       COLHDG('Ora  Ritiro ........')
     A            ES0MEZZ0     100          COLHDG('Inizio trasporto ...')
     A            ES0NOTA0     100          COLHDG('Nota ...............')
     A            ES0CPAG0       3          COLHDG('Cod. Pagamento .....')
     A            ES0IM010      12  2       COLHDG('Imponibile 1 .......')
     A            ES0AL010       2  0       COLHDG('Aliquota   1 .......')
     A            ES0IV010      12  2       COLHDG('Iva        1 .......')
     A            ES0IM020      12  2       COLHDG('Imponibile 2 .......')
     A            ES0AL020       2  0       COLHDG('Aliquota   2 .......')
     A            ES0IV020      12  2       COLHDG('Iva        2 .......')
     A            ES0IM030      12  2       COLHDG('Imponibile 3 .......')
     A            ES0AL030       2  0       COLHDG('Aliquota   3 .......')
     A            ES0IV030      12  2       COLHDG('Iva        3 .......')
     A            ES0IMPT0      12  2       COLHDG('Importo Totale .....')
      *
     A            ES0FL010       2          COLHDG('Flag 01 ............')
     A            ES0FL020       2          COLHDG('Flag 02 ............')
     A            ES0FL030       2          COLHDG('Flag 03 ............')
     A            ES0FL040       2          COLHDG('Flag 04 ............')
     A            ES0FL050       2          COLHDG('Flag 05 ............')
     A            ES0FL060      10          COLHDG('Flag 06 ............')
     A            ES0FL070      10          COLHDG('Flag 07 ............')
     A            ES0FL080      10          COLHDG('Flag 08 ............')
     A            ES0FL090      10          COLHDG('Flag 09 ............')
     A            ES0FL100      10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : BOLLERF0                                  *
     *  DESCRIZIONE   : Righe   Auto BL/FT per Regime Esonero     *
     *  PREFISSO      : ES1                                       *
     * ============================================================ *
     A            ES1STAT0       1A         COLHDG('Stato ..............')
     A            ES1IMUT0      10A         COLHDG('Immissione utente...')
     A            ES1IMDA0       8  0       COLHDG('Immissione data ....')
     A            ES1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            ES1IMPG0      10A         COLHDG('Immissione programma')
     A            ES1IMAZ0      10A         COLHDG('Immissione azione...')
     A            ES1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            ES1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            ES1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            ES1AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            ES1AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            ES1SOCI0       2A         COLHDG('Società ............')
      *
     A            ES1NORD0       9  0       COLHDG('Nr Ordine ..........')
     A            ES1DORD0       8  0       COLHDG('Dt Ordine ..........')
     A            ES1NBOL0       6  0       COLHDG('Nr Bolla ...........')
     A            ES1DBOL0       8  0       COLHDG('Dt Bolla ...........')
     A            ES1NFAT0       6  0       COLHDG('Nr Fattura .........')
     A            ES1DFAT0       8  0       COLHDG('Dt Fattura .........')
      *
     A            ES1NRIG0       4  0       COLHDG('Nr Progrssivo riga .')
     A            ES1CODI0      15          COLHDG('Codice .............')
     A            ES1DESC0      50          COLHDG('Descr. Prodotto ....')
     A            ES1QUAN0      12  2       COLHDG('Quantità ...........')
     A            ES1PREZ0       9  4       COLHDG('Prezzo Unitario.....')
     A            ES1IMPR0      12  2       COLHDG('Importo Riga .......')
     A            ES1ALIQ0       2  0       COLHDG('Cod. Aliquota ......')
      *
     A            ES1FL010       2          COLHDG('Flag 01 ............')
     A            ES1FL020       2          COLHDG('Flag 02 ............')
     A            ES1FL030       2          COLHDG('Flag 03 ............')
     A            ES1FL040       2          COLHDG('Flag 04 ............')
     A            ES1FL050       2          COLHDG('Flag 05 ............')
     A            ES1FL060      10          COLHDG('Flag 06 ............')
     A            ES1FL070      10          COLHDG('Flag 07 ............')
     A            ES1FL080      10          COLHDG('Flag 08 ............')
     A            ES1FL090      10          COLHDG('Flag 09 ............')
     A            ES1FL100      10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : BOLLEXF0                                  *
     *  DESCRIZIONE   : Testate riepilogativa di Autofatture R.E. *
     *  PREFISSO      : ES0                                       *
     * ============================================================ *
     A            ES2STAT0       1A         COLHDG('Stato ..............')
     A            ES2IMUT0      10A         COLHDG('Immissione utente...')
     A            ES2IMDA0       8  0       COLHDG('Immissione data ....')
     A            ES2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            ES2IMPG0      10A         COLHDG('Immissione programma')
     A            ES2IMAZ0      10A         COLHDG('Immissione azione...')
     A            ES2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            ES2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            ES2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            ES2AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            ES2AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            ES2SOCI0       2A         COLHDG('Società ............')
      *
     A            ES2NFAT0       6  0       COLHDG('Nr Fattura .........')
     A            ES2DFAT0       8  0       COLHDG('Dt Fattura .........')
     A            ES2CCED0       6          COLHDG('Cedente ............')
     A            ES2CCES0       6          COLHDG('Cessionario ........')
     A            ES2CPAG0       3          COLHDG('Cod. Pagamento .....')
     A            ES2IM010      12  2       COLHDG('Imponibile 1 .......')
     A            ES2AL010       2  0       COLHDG('Aliquota   1 .......')
     A            ES2IV010      12  2       COLHDG('Iva        1 .......')
     A            ES2IM020      12  2       COLHDG('Imponibile 2 .......')
     A            ES2AL020       2  0       COLHDG('Aliquota   2 .......')
     A            ES2IV020      12  2       COLHDG('Iva        2 .......')
     A            ES2IM030      12  2       COLHDG('Imponibile 3 .......')
     A            ES2AL030       2  0       COLHDG('Aliquota   3 .......')
     A            ES2IV030      12  2       COLHDG('Iva        3 .......')
     A            ES2IMPT0      12  2       COLHDG('Importo Totale .....')
     A            ES2PEKG0      12  2       COLHDG('Peso Kg   Totali....')
     * ============================================================ *
     *  TABELLA       : RICELEF0                                  *
     *  DESCRIZIONE   : Ricetta elettronica                       *
     *  PREFISSO      : REL                                       *
     * ============================================================ *
     A            RELSTAT0       1A         COLHDG('Stato ..............')
     A            RELIMUT0      10A         COLHDG('Immissione utente...')
     A            RELIMDA0       8  0       COLHDG('Immissione data ....')
     A            RELIMOR0       6  0       COLHDG('Immissione ora .....')
     A            RELIMPG0      10A         COLHDG('Immissione programma')
     A            RELAGUT0      10A         COLHDG('Aggiornamento utente')
     A            RELAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            RELAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            RELAGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            RELNURI0      13A         COLHDG('Numero ricetta .....')
     A            RELNUPI0       4A         COLHDG('Numero pin .........')
     A            RELNORD0       9  0       COLHDG('Numero ordine assoc.')
     A            RELNRIO0       4  0       COLHDG('Numero riga ordine .')
     A            RELDFAT0       8  0       COLHDG('Data documento .....')
     A            RELNFAT0       6  0       COLHDG('Numero documento ...')
     A            RELTFAT0       3          COLHDG('Tipo documento .....')
      *
     A            RELFL010       2          COLHDG('Flag 01 ............')
     A            RELFL020       2          COLHDG('Flag 02 ............')
     A            RELFL030       2          COLHDG('Flag 03 ............')
     A            RELFL040       2          COLHDG('Flag 04 ............')
     A            RELFL050       2          COLHDG('Flag 05 ............')
     A            RELFL060      10          COLHDG('Flag 06 ............')
     A            RELFL070      10          COLHDG('Flag 07 ............')
     A            RELFL080      10          COLHDG('Flag 08 ............')
     A            RELFL090      10          COLHDG('Flag 09 ............')
     A            RELFL100      10          COLHDG('Flag 10 ............')
      *
     * ============================================================ *
     *  TABELLA       : INCVENF0                                  *
     *  DESCRIZIONE   : Incentivazione Vendite clienti            *
     *  PREFISSO      : IV0                                       *
     * ============================================================ *
     A            IV0CLIE0       6A         COLHDG('Cod. Cliente .......')
     A            IV0AGEN0       3A         COLHDG('Cod. Agente ........')
     A            IV0DIST0       3A         COLHDG('Cod. Distretto .....')
     A            IV0MARC0       2A         COLHDG('Marchio ............')
     A            IV0REGI0       3A         COLHDG('Regione ............')
     A            IV0INDI0     100A         COLHDG('Pec/mail ...........')
     A            IV0DTEL0       8  0       COLHDG('Data Elab.ne .......')
     A            IV0UTEN0      10          COLHDG('Utente Invio .......')
     A            IV0DTIN0       8  0       COLHDG('Data Invio .........')
     A            IV0ORIN0       6  0       COLHDG('Ora  Invio .........')
     A            IV0PROG0       9  0       COLHDG('Nr Progressivo .....')
     * ============================================================ *
     *  TABELLA       : ORDF43F0                                  *
     *  DESCRIZIONE   : File per Stampa Franchigie                *
     *  PREFISSO      : STF                                       *
     * ============================================================ *
     A            STFSTRI0     400A         COLHDG('Stringa da stampare.')
     A            STFPROD0      15A         COLHDG('Codice prodotto.....')
     A            STFCONT0       6  0       COLHDG('Contratto ..........')
     * ============================================================ *
     *  TABELLA       : LIVEVVF0                                  *
     *  DESCRIZIONE   : Listini Clienti Vietata la Vendita        *
     *  PREFISSO      : BH1                                       *
     * ============================================================ *
     A            BH1STAT0       1A         COLHDG('Stato ..............')
     A            BH1IMUT0      10A         COLHDG('Immissione utente...')
     A            BH1IMDA0       8  0       COLHDG('Immissione data ....')
     A            BH1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BH1IMPG0      10A         COLHDG('Immissione programma')
     A            BH1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BH1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BH1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BH1AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            BH1DAVA0       8  0       COLHDG('Data validità ......')
     A            BH1CLIE0       6          COLHDG('Codice cliente .....')
     A            BH1CODI0      15          COLHDG('Codice prodotto ....')
     A            BH1LIST0       3          COLHDG('Codice listino .....')
     A            BH1LINE0       3          COLHDG('Linea  prodotto ....')
     A            BH1TIPO0       3          COLHDG('Tipo   prodotto ....')
     A            BH1FASE0       3          COLHDG('Fase   prodotto ....')
     A            BH1STAP0       3          COLHDG('Stato  prodotto ....')
     A            BH1REVO0       2          COLHDG('SI=divieto revocato.')
      *
     A            BH1FL010       2          COLHDG('Flag 01 ............')
     A            BH1FL020       2          COLHDG('Flag 02 ............')
     A            BH1FL030       2          COLHDG('Flag 03 ............')
     A            BH1FL040       2          COLHDG('Flag 04 ............')
     A            BH1FL050       2          COLHDG('Flag 05 ............')
     A            BH1FL060      10          COLHDG('Flag 06 ............')
     A            BH1FL070      10          COLHDG('Flag 07 ............')
     A            BH1FL080      10          COLHDG('Flag 08 ............')
     A            BH1FL090      10          COLHDG('Flag 09 ............')
     A            BH1FL100      10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : FORPRDF0                                  *
     *  DESCRIZIONE   : Formula/Prodotto per mag. transitorio      *
     *  PREFISSO      : FP1                                       *
     * ============================================================ *
     A            FP1STAT0       1A         COLHDG('Stato ..............')
     A            FP1IMUT0      10A         COLHDG('Immissione utente...')
     A            FP1IMDA0       8  0       COLHDG('Immissione data ....')
     A            FP1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            FP1IMPG0      10A         COLHDG('Immissione programma')
     A            FP1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            FP1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            FP1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            FP1AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            FP1FORM0       6          COLHDG('Formula Daeti ......')
     A            FP1PROD0      15          COLHDG('Prodotto ...........')
      *
     A            FP1FL010       2          COLHDG('Flag 01 ............')
     A            FP1FL020       2          COLHDG('Flag 02 ............')
     A            FP1FL030       2          COLHDG('Flag 03 ............')
     A            FP1FL040       2          COLHDG('Flag 04 ............')
     A            FP1FL050       2          COLHDG('Flag 05 ............')
     A            FP1FL060      10          COLHDG('Flag 06 ............')
     A            FP1FL070      10          COLHDG('Flag 07 ............')
     A            FP1FL080      10          COLHDG('Flag 08 ............')
     A            FP1FL090      10          COLHDG('Flag 09 ............')
     A            FP1FL100      10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : FORDATF0                                  *
     *  DESCRIZIONE   : Legame formula-prodotto per data val.      *
     *  PREFISSO      : FD0                                       *
     * ============================================================ *
     A            FD0STAT0       1A         COLHDG('Stato ..............')
     A            FD0IMUT0      10A         COLHDG('Immissione utente...')
     A            FD0IMDA0       8  0       COLHDG('Immissione data ....')
     A            FD0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            FD0IMPG0      10A         COLHDG('Immissione programma')
     A            FD0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            FD0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            FD0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            FD0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            FD0FORM0      15          COLHDG('Formula Daeti1......')
     A            FD0PROD0      15          COLHDG('Prodotto ...........')
     A            FD0DATA0       8  0       COLHDG('Data validità ......')
     A            FD0PROG0       9  0       COLHDG('Nr Progr. Univoco ..')
      *
     A            FD0FL010       2          COLHDG('Flag 01 ............')
     A            FD0FL020       2          COLHDG('Flag 02 ............')
     A            FD0FL030       2          COLHDG('Flag 03 ............')
     A            FD0FL040       2          COLHDG('Flag 04 ............')
     A            FD0FL050       2          COLHDG('Flag 05 ............')
     A            FD0FL060      10          COLHDG('Formula Daeti2 .....')
     A            FD0FL070      10          COLHDG('Flag 07 ............')
     A            FD0FL080      10          COLHDG('Flag 08 ............')
     A            FD0FL090      10          COLHDG('Flag 09 ............')
     A            FD0FL100      10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : RETGIAF0                                  *
     *  DESCRIZIONE   : Rettifiche mag. per giacenze negative      *
     *  PREFISSO      : RG0                                       *
     * ============================================================ *
     A            RG0STAB0       2          COLHDG('Stabilimento .......')
     A            RG0ANNO0       4  0       COLHDG('Anno ...............')
     A            RG0TIPO0       2          COLHDG('Tipo Prodotto ......')
     A            RG0PROD0      15          COLHDG('Prodotto ...........')
     A            RG0QT010      12  2       COLHDG('Giacenza 01 ........')
     A            RG0QT020      12  2       COLHDG('Giacenza 02 ........')
     A            RG0QT030      12  2       COLHDG('Giacenza 03 ........')
     A            RG0QT040      12  2       COLHDG('Giacenza 04 ........')
     A            RG0QT050      12  2       COLHDG('Giacenza 05 ........')
     A            RG0QT060      12  2       COLHDG('Giacenza 06 ........')
     A            RG0QT070      12  2       COLHDG('Giacenza 07 ........')
     A            RG0QT080      12  2       COLHDG('Giacenza 08 ........')
     A            RG0QT090      12  2       COLHDG('Giacenza 09 ........')
     A            RG0QT100      12  2       COLHDG('Giacenza 10 ........')
     A            RG0QT110      12  2       COLHDG('Giacenza 11 ........')
     A            RG0QT120      12  2       COLHDG('Giacenza 12 ........')
     * ============================================================ *
     *  TABELLA       : CAUPROF0                                  *
     *  DESCRIZIONE   : Causali per mag. transitorio               *
     *  PREFISSO      : CP0                                       *
     * ============================================================ *
     A            CP0STAT0       1A         COLHDG('Stato ..............')
     A            CP0IMUT0      10A         COLHDG('Immissione utente...')
     A            CP0IMDA0       8  0       COLHDG('Immissione data ....')
     A            CP0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            CP0IMPG0      10A         COLHDG('Immissione programma')
     A            CP0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            CP0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CP0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CP0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            CP0CAUS0       2          COLHDG('Cod. causale prod. .')
     A            CP0DESC0      30          COLHDG('Des. causale prod. .')
     A            CP0CCAR0       2          COLHDG('Cau. Mag. Carico ...')
     A            CP0CSCA0       2          COLHDG('Cau. Mag. Scarico ..')
      *
     A            CP0FL010       2          COLHDG('Flag 01 ............')
     A            CP0FL020       2          COLHDG('Flag 02 ............')
     A            CP0FL030       2          COLHDG('Flag 03 ............')
     A            CP0FL040       2          COLHDG('Flag 04 ............')
     A            CP0FL050       2          COLHDG('Flag 05 ............')
     A            CP0FL060      10          COLHDG('Flag 06 ............')
     A            CP0FL070      10          COLHDG('Flag 07 ............')
     A            CP0FL080      10          COLHDG('Flag 08 ............')
     A            CP0FL090      10          COLHDG('Flag 09 ............')
     A            CP0FL100      10          COLHDG('Flag 10 ............')
     * ============================================================ *
     *  TABELLA       : ASSLOTF0                                  *
     *  DESCRIZIONE   : Memorizza Lotto as400 per nr ordine/prod.  *
     *  PREFISSO      : AS0                                       *
     * ============================================================ *
     A            AS0NORD0       9  0       COLHDG('Nr Ordine ..........')
     A            AS0NRIG0       4  0       COLHDG('Nr riga ordine .....')
     A            AS0PROD0      15          COLHDG('Cod.Prodotto .......')
     A            AS0NLOT0       9  0       COLHDG('Nr Lotto As400 .....')
      *
     * ============================================================ *
     *  TABELLA       : TARCISF0                                  *
     *  DESCRIZIONE   : Targhe Cisterne fornitori mp               *
     *  PREFISSO      : TC0                                       *
     * ============================================================ *
     A            TC0STAT0       1A         COLHDG('Stato ..............')
     A            TC0IMUT0      10A         COLHDG('Immissione utente...')
     A            TC0IMDA0       8  0       COLHDG('Immissione data ....')
     A            TC0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            TC0IMPG0      10A         COLHDG('Immissione programma')
     A            TC0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            TC0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            TC0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            TC0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            TC0TARG0      10          COLHDG('Targa ..............')
     A            TC0DATA0       8  0       COLHDG('Data revisione .....')
     A            TC0SCAD0       6  0       COLHDG('Scadenza AAAAMM ....')
     A            TC0BARC0       9  0       COLHDG('Nr Barcode .........')
      *
     A            TC0FL010       2          COLHDG('Flag 01 ............')
     A            TC0FL020       2          COLHDG('Flag 02 ............')
     A            TC0FL030       2          COLHDG('Flag 03 ............')
     A            TC0FL040       2          COLHDG('Flag 04 ............')
     A            TC0FL050       2          COLHDG('Flag 05 ............')
     A            TC0FL060      10          COLHDG('Flag 06 ............')
     A            TC0FL070      10          COLHDG('Flag 07 ............')
     A            TC0FL080      10          COLHDG('Flag 08 ............')
     A            TC0FL090      10          COLHDG('Flag 09 ............')
     A            TC0FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : INGPROF0                                     *
     *  DESCRIZIONE   : Ingresso prodotti in stab. con Cisterne Pneum.*
     *  PREFISSO      : TC1                                          *
     * =============================================================== *
     A            TC1STAT0       1A         COLHDG('Stato ..............')
     A            TC1IMUT0      10A         COLHDG('Immissione utente...')
     A            TC1IMDA0       8  0       COLHDG('Immissione data ....')
     A            TC1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            TC1IMPG0      10A         COLHDG('Immissione programma')
     A            TC1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            TC1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            TC1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            TC1AGPG0      10A         COLHDG('Aggiornamento progr.')
     *
     A            TC1STAB0       2          COLHDG('Stabilimento .......')
     A            TC1PROD0      15          COLHDG('Prodotto ...........')
      *
     A            TC1FL010      10          COLHDG('Flag 01 ............')
     A            TC1FL020      10          COLHDG('Flag 02 ............')
     A            TC1FL030      10          COLHDG('Flag 03 ............')
     A            TC1FL040      10          COLHDG('Flag 04 ............')
     A            TC1FL050      10          COLHDG('Flag 05 ............')
     A            TC1FL060      10          COLHDG('Flag 06 ............')
     A            TC1FL070      10          COLHDG('Flag 07 ............')
     A            TC1FL080      10          COLHDG('Flag 08 ............')
     A            TC1FL090      10          COLHDG('Flag 09 ............')
     A            TC1FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : INCAGAF0                                     *
     *  DESCRIZIONE   : Registrazione Incassi agenti - Allegati      *
     *  PREFISSO      : CNEA                                         *
     * =============================================================== *
     A            C2ESTAT0       1A         COLHDG('Stato ..............')
     A            C2EIMUT0      10A         COLHDG('Immissione utente...')
     A            C2EIMDA0       8  0       COLHDG('Immissione data ....')
     A            C2EIMOR0       6  0       COLHDG('Immissione ora .....')
     A            C2EIMPG0      10A         COLHDG('Immissione programma')
     A            C2EAGUT0      10A         COLHDG('Aggiornamento utente')
     A            C2EAGDA0       8  0       COLHDG('Aggiornamento data..')
     A            C2EAGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            C2EAGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            C2ENURA0       9  0       COLHDG('Num.registr.automat.')
     A            C2ENURI0       3  0       COLHDG('Numero riga ........')
     A            C2EALLE0     300A         COLHDG('Allegato ...........')
     A            C2ENOME0     100A         COLHDG('Nome del file.......')
      *
     A            C2EFL010       2A         COLHDG('Flag 01 ............')
     A            C2EFL020       2A         COLHDG('Flag 02 ............')
     A            C2EFL030       2A         COLHDG('Flag 03 ............')
     A            C2EFL040       2A         COLHDG('Flag 04 ............')
     A            C2EFL050       2A         COLHDG('Flag 05 ............')
     A            C2EFL060      10A         COLHDG('Flag 06 ............')
     A            C2EFL070      10A         COLHDG('Flag 07 ............')
     A            C2EFL080      10A         COLHDG('Flag 08 ............')
     A            C2EFL090      10A         COLHDG('Flag 09 ............')
     A            C2EFL100      10A         COLHDG('Flag 10 ............')
      *
     * =============================================================== *
     *  TABELLA       : VALRIMF0                                     *
     *  DESCRIZIONE   : Valorizza rimanenze di magazzino             *
     *  PREFISSO      : VR0                                          *
     * =============================================================== *
     A            VR0STAT0       1          COLHDG('Stato ..............')
     A            VR0ANNO0       4  0       COLHDG('Anno ...............')
     A            VR0MESE0       2  0       COLHDG('Mese ...............')
     A            VR0MAGA0       2A         COLHDG('Magazzino ..........')
     A            VR0TPRO0       2A         COLHDG('Tipo prodotto ......')
     A            VR0UNMI0       2A         COLHDG('Unità di Misura ....')
     A            VR0PROD0      15A         COLHDG('Cod. prodotto ......')
      *
     A            VR0QTAI0      12  2       COLHDG('Q.tà   Iniziale ....')
     A            VR0VALI0      12  2       COLHDG('Valore Iniziale ....')
     A            VR0QACQ0      12  2       COLHDG('Q.tà   Acquisti ....')
     A            VR0VACQ0      12  2       COLHDG('Valore Acquisti ....')
     A            VR0QMED0      12  2       COLHDG('Q.tà   Mediazione ..')
     A            VR0VMED0      12  2       COLHDG('Valore Mediazione ..')
     A            VR0QTRA0      12  2       COLHDG('Q.tà   Trasporto ...')
     A            VR0VTRA0      12  2       COLHDG('Valore Trasporto ...')
     A            VR0QTRU0      12  2       COLHDG('Q.tà   Trasf. uscita')
     A            VR0VTRU0      12  2       COLHDG('Valore Trasf. uscita')
     A            VR0QTRE0      12  2       COLHDG('Q.tà   Trasf.entrata')
     A            VR0VTRE0      12  2       COLHDG('Valore Trasf.entrata')
     A            VR0QVEN0      12  2       COLHDG('Q.tà   Vendita .....')
     A            VR0VVEN0      12  2       COLHDG('Valore Vendita .....')
     A            VR0QTAF0      12  2       COLHDG('Q.tà   Finale ......')
     A            VR0VALF0      12  2       COLHDG('Valore Finale ......')
     * =============================================================== *
     *  TABELLA       : CRMVITF0                                     *
     *  DESCRIZIONE   : Gestione visite clienti con tecnici          *
     *  PREFISSO      : TE2                                          *
     * =============================================================== *
     A            TE2STAT0       1A         COLHDG('Stato ..............')
     A            TE2IMUT0      10A         COLHDG('Immissione utente...')
     A            TE2IMDA0       8  0       COLHDG('Immissione data ....')
     A            TE2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            TE2IMPG0      10A         COLHDG('Immissione programma')
     A            TE2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            TE2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            TE2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            TE2AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            TE2AREA0       3A         COLHDG('Area Manager........')
     A            TE2TECN0       3A         COLHDG('Tecnico.............')
     A            TE2AGEN0       3A         COLHDG('Agente..............')
     A            TE2CLIE0       6A         COLHDG('Cliente.............')
     A            TE2DATA0       8  0       COLHDG('Data appuntamento...')
     A            TE2NUME0       3  0       COLHDG('Sequenza............')
     A            TE2ORAR0       4  0       COLHDG('Ora appuntamento....')
     A            TE2CAUS0       3A         COLHDG('Causale.............')
     A            TE2NOTE0     300A         COLHDG('Note ...............')
     A            TE2EMAI0       1A         COLHDG('eMail inviata ......')
     A            TE2CONF0       1A         COLHDG('Confermato da tecn..')
      *
     A            TE2FL010       2A         COLHDG('Flag 01 ............')
     A            TE2FL020       2A         COLHDG('Flag 02 ............')
     A            TE2FL030       2A         COLHDG('Flag 03 ............')
     A            TE2FL040       2A         COLHDG('Flag 04 ............')
     A            TE2FL050       2A         COLHDG('Flag 05 ............')
     A            TE2FL060      10A         COLHDG('Flag 06 ............')
     A            TE2FL070      10A         COLHDG('Flag 07 ............')
     A            TE2FL080      10A         COLHDG('Flag 08 ............')
     A            TE2FL090      10A         COLHDG('Flag 09 ............')
     A            TE2FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : CRMVIAF0                                     *
     *  DESCRIZIONE   : Gestione visite clienti con tecnici Allegati *
     *  PREFISSO      : TE3                                          *
     * =============================================================== *
     A            TE3STAT0       1A         COLHDG('Stato ..............')
     A            TE3IMUT0      10A         COLHDG('Immissione utente...')
     A            TE3IMDA0       8  0       COLHDG('Immissione data ....')
     A            TE3IMOR0       6  0       COLHDG('Immissione ora .....')
     A            TE3IMPG0      10A         COLHDG('Immissione programma')
     A            TE3AGUT0      10A         COLHDG('Aggiornamento utente')
     A            TE3AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            TE3AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            TE3AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            TE3ETIC0      10A         COLHDG('Etichetta ..........')
     A            TE3PROG0       3  0       COLHDG('Progressivo ........')
     A            TE3NAME0     200A         COLHDG('Nome file ..........')
     A            TE3PATH0     400A         COLHDG('Percorso ...........')
      *
     A            TE3FL010       2A         COLHDG('Flag 01 ............')
     A            TE3FL020       2A         COLHDG('Flag 02 ............')
     A            TE3FL030       2A         COLHDG('Flag 03 ............')
     A            TE3FL040       2A         COLHDG('Flag 04 ............')
     A            TE3FL050       2A         COLHDG('Flag 05 ............')
     A            TE3FL060      10A         COLHDG('Flag 06 ............')
     A            TE3FL070      10A         COLHDG('Flag 07 ............')
     A            TE3FL080      10A         COLHDG('Flag 08 ............')
     A            TE3FL090      10A         COLHDG('Flag 09 ............')
     A            TE3FL100      10A         COLHDG('Flag 10 ............')
      *
     * =============================================================== *
     *  TABELLA       : RESIMGF0                                     *
     *  DESCRIZIONE   : Nuova gestione resi                          *
     *  PREFISSO      : RS1                                          *
     * =============================================================== *
     A            RS1STAT0       1A         COLHDG('Stato ..............')
     A            RS1IMUT0      10A         COLHDG('Immissione utente...')
     A            RS1IMDA0       8  0       COLHDG('Immissione data ....')
     A            RS1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            RS1IMPG0      10A         COLHDG('Immissione programma')
     A            RS1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            RS1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            RS1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            RS1AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            RS1PROG0       9  0       COLHDG('Nr progressivo .....')
     A            RS1FASE0       2          COLHDG('01port/20magaz/30Acc')
     A            RS1NVIA0       9  0       COLHDG('Nr Viaggio .........')
     A            RS1DVIA0       8  0       COLHDG('Dt Viaggio .........')
     A            RS1CLIE0       6A         COLHDG('Cod.Cliente ........')
     A            RS1MEZZ0       4A         COLHDG('Mezzo ..............')
     A            RS1DBOL0       8  0       COLHDG('Dt Bolla ...........')
     A            RS1NBOL0       6  0       COLHDG('Nr Bolla ...........')
     A            RS1DFAT0       8  0       COLHDG('Dt Fattura .........')
     A            RS1NFAT0       6  0       COLHDG('Nr Fattura .........')
     A            RS1TDOC0       2          COLHDG('Tipo documento FT/BL')
     A            RS1CAUS0       2          COLHDG('Cod.Causale NC .....')
     A            RS1CAU20       3          COLHDG('Cod.Causale Report .')
     A            RS1DREP0       8  0       COLHDG('Dt Report reclami ..')
     A            RS1NREP0       9  0       COLHDG('Nr Report reclami ..')
     A            RS1DAUT0       8  0       COLHDG('Dt autorizz. ritiro ')
     A            RS1NAUT0       6  0       COLHDG('Nr autorizz. ritiro ')
     A            RS1PROD0      15          COLHDG('Cod. Prodotto ......')
     A            RS1QUAN0      18  0       COLHDG('Q.tà ...............')
     A            RS1LOTT0       9  0       COLHDG('Nr Lotto ...........')
     A            RS1PRO20      15          COLHDG('Cod. Prodotto accet.')
     A            RS1QUA20      18  0       COLHDG('Q.tà accettata .....')
     A            RS1LOT20       9  0       COLHDG('Nr Lotto acc .......')
     A            RS1PREZ0      18  4       COLHDG('Prezzo .............')
     A            RS1ALIQ0       2          COLHDG('Aliq. Iva ..........')
     A            RS1CDTO0       2          COLHDG('Valore Cdtoc .......')
     A            RS1MAGA0       2          COLHDG('Mag. arrivo ........')
     A            RS1NCON0       1          COLHDG('X=non conforme .....')
     A            RS1NOT10     100          COLHDG('Nota 1 .............')
     A            RS1NOT20     100          COLHDG('Nota 2 .............')
     A            RS1NRIG0       4  0       COLHDG('Nr Riga ............')
      *
     A            RS1FL010       2A         COLHDG('Flag 01 ............')
     A            RS1FL020       2A         COLHDG('Flag 02 ............')
     A            RS1FL030       2A         COLHDG('Flag 03 ............')
     A            RS1FL040       2A         COLHDG('Flag 04 ............')
     A            RS1FL050       2A         COLHDG('Flag 05 ............')
     A            RS1FL060      10A         COLHDG('Flag 06 ............')
     A            RS1FL070      10A         COLHDG('Flag 07 ............')
     A            RS1FL080      10A         COLHDG('Flag 08 ............')
     A            RS1FL090      10A         COLHDG('Flag 09 ............')
     A            RS1FL100      10A         COLHDG('Flag 10 ............')
      *
     * =============================================================== *
     *  TABELLA       : ANANOTF0                                     *
     *  DESCRIZIONE   : Anagr. Note da associare a Clienti ft consorz.*
     *  PREFISSO      : AN0                                          *
     * =============================================================== *
     A            AN0STAT0       1A         COLHDG('Stato ..............')
     A            AN0IMUT0      10A         COLHDG('Immissione utente...')
     A            AN0IMDA0       8  0       COLHDG('Immissione data ....')
     A            AN0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AN0IMPG0      10A         COLHDG('Immissione programma')
     A            AN0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            AN0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            AN0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            AN0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            AN0CODI0       2A         COLHDG('Cod. Nota ..........')
     A            AN0DESC0      50A         COLHDG('Des. Nota ..........')
      *
     A            AN0FL010       2A         COLHDG('Flag 01 ............')
     A            AN0FL020       2A         COLHDG('Flag 02 ............')
     A            AN0FL030       2A         COLHDG('Flag 03 ............')
     A            AN0FL040       2A         COLHDG('Flag 04 ............')
     A            AN0FL050       2A         COLHDG('Flag 05 ............')
     A            AN0FL060      10A         COLHDG('Flag 06 ............')
     A            AN0FL070      10A         COLHDG('Flag 07 ............')
     A            AN0FL080      10A         COLHDG('Flag 08 ............')
     A            AN0FL090      10A         COLHDG('Flag 09 ............')
     A            AN0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : NOTINTF0                                     *
     *  DESCRIZIONE   : Associazione Note a Int.Fatt.                 *
     *  PREFISSO      : AN1                                          *
     * =============================================================== *
     A            AN1STAT0       1A         COLHDG('Stato ..............')
     A            AN1IMUT0      10A         COLHDG('Immissione utente...')
     A            AN1IMDA0       8  0       COLHDG('Immissione data ....')
     A            AN1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AN1IMPG0      10A         COLHDG('Immissione programma')
     A            AN1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            AN1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            AN1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            AN1AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            AN1INTE0       6A         COLHDG('Cli. Int.Fattura ...')
     A            AN1CODI0       2A         COLHDG('Cod. Nota ..........')
      *
     A            AN1FL010       2A         COLHDG('Flag 01 ............')
     A            AN1FL020       2A         COLHDG('Flag 02 ............')
     A            AN1FL030       2A         COLHDG('Flag 03 ............')
     A            AN1FL040       2A         COLHDG('Flag 04 ............')
     A            AN1FL050       2A         COLHDG('Flag 05 ............')
     A            AN1FL060      10A         COLHDG('Flag 06 ............')
     A            AN1FL070      10A         COLHDG('Flag 07 ............')
     A            AN1FL080      10A         COLHDG('Flag 08 ............')
     A            AN1FL090      10A         COLHDG('Flag 09 ............')
     A            AN1FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : NOTCONF0                                     *
     *  DESCRIZIONE   : Associazione Note a Pto Cons. a Note          *
     *  PREFISSO      : AN1                                          *
     * =============================================================== *
     A            AN2STAT0       1A         COLHDG('Stato ..............')
     A            AN2IMUT0      10A         COLHDG('Immissione utente...')
     A            AN2IMDA0       8  0       COLHDG('Immissione data ....')
     A            AN2IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AN2IMPG0      10A         COLHDG('Immissione programma')
     A            AN2AGUT0      10A         COLHDG('Aggiornamento utente')
     A            AN2AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            AN2AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            AN2AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            AN2INTE0       6A         COLHDG('Cli. Int.Fattura ...')
     A            AN2CONS0       6A         COLHDG('Cli. P.to Consegna .')
     A            AN2CODI0       2A         COLHDG('Cod. Nota ..........')
      *
     A            AN2FL010       2A         COLHDG('Flag 01 ............')
     A            AN2FL020       2A         COLHDG('Flag 02 ............')
     A            AN2FL030       2A         COLHDG('Flag 03 ............')
     A            AN2FL040       2A         COLHDG('Flag 04 ............')
     A            AN2FL050       2A         COLHDG('Flag 05 ............')
     A            AN2FL060      10A         COLHDG('Flag 06 ............')
     A            AN2FL070      10A         COLHDG('Flag 07 ............')
     A            AN2FL080      10A         COLHDG('Flag 08 ............')
     A            AN2FL090      10A         COLHDG('Flag 09 ............')
     A            AN2FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : COSMATF0                                     *
     *  DESCRIZIONE   : Costo m.p. per Stab/AA/MM/Cdpar/Pzo           *
     *  PREFISSO      : AN1                                          *
     * =============================================================== *
     A            CM0STAT0       1A         COLHDG('Stato ..............')
     A            CM0IMUT0      10A         COLHDG('Immissione utente...')
     A            CM0IMDA0       8  0       COLHDG('Immissione data ....')
     A            CM0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            CM0IMPG0      10A         COLHDG('Immissione programma')
     A            CM0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            CM0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            CM0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            CM0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            CM0MAGA0       2A         COLHDG('Stabilimento .......')
     A            CM0ANNO0       4  0       COLHDG('Anno ...............')
     A            CM0MESE0       2  0       COLHDG('Mese ...............')
     A            CM0MATE0      15A         COLHDG('Cod. M.P. ..........')
     A            CM0PREZ0      12  4       COLHDG('Prezzo .............')
      *
     A            CM0FL010       2A         COLHDG('Flag 01 ............')
     A            CM0FL020       2A         COLHDG('Flag 02 ............')
     A            CM0FL030       2A         COLHDG('Flag 03 ............')
     A            CM0FL040       2A         COLHDG('Flag 04 ............')
     A            CM0FL050       2A         COLHDG('Flag 05 ............')
     A            CM0FL060      10A         COLHDG('Flag 06 ............')
     A            CM0FL070      10A         COLHDG('Flag 07 ............')
     A            CM0FL080      10A         COLHDG('Flag 08 ............')
     A            CM0FL090      10A         COLHDG('Flag 09 ............')
     A            CM0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : PROCOGF0                                     *
     *  DESCRIZIONE   : Analisi su produzione Cogeim                  *
     *  PREFISSO      : PG1                                          *
     * =============================================================== *
     A            PG1MAGA0       2A         COLHDG('Stabilimento .......')
     A            PG1PROD0      15A         COLHDG('Cod. Prodotto ......')
     A            PG1DESC0      30A         COLHDG('Des. Prodotto ......')
     A            PG1FORM0       6A         COLHDG('Formula ............')
     A            PG1FOMA0       2A         COLHDG('Formato ............')
     A            PG1BASE0       2A         COLHDG('Formato della Base..')
     A            PG1TOGM0       3A         COLHDG('OGM ................')
     A            PG1LINE0       2A         COLHDG('Linea prodotto .....')
     A            PG1QPRO0      14  2       COLHDG('Q.tà prodotta ......')
     A            PG1QCOT0      14  2       COLHDG('Q.tà Cotone conten..')
     A            PG1QFIO0      14  2       COLHDG('Q.tà Fioccati conten')
     A            PG1DAT10       8  0       COLHDG('Data Inizio periodo.')
     A            PG1DAT20       8  0       COLHDG('Data Fine   periodo.')
     * =============================================================== *
     *  TABELLA       : VENFATF0                                     *
     *  DESCRIZIONE   : Analisi fatturato per Prodotto                *
     *  PREFISSO      : PG2                                          *
     * =============================================================== *
     A            PG2MAGA0       2A         COLHDG('Stabilimento .......')
     A            PG2PROD0      15A         COLHDG('Cod. Prodotto ......')
     A            PG2DESC0      30A         COLHDG('Des. Prodotto ......')
     A            PG2FORM0       6A         COLHDG('Formula ............')
     A            PG2FOMA0       2A         COLHDG('Formato ............')
     A            PG2BASE0       2A         COLHDG('Formato della Base..')
     A            PG2TOGM0       3A         COLHDG('OGM ................')
     A            PG2LINE0       2A         COLHDG('Linea prodotto .....')
     A            PG2UNMI0       2A         COLHDG('Unità di misura ....')
     A            PG2QFAT0      14  2       COLHDG('Volumi Fatturato ...')
     A            PG2VFAT0      14  2       COLHDG('Valore Fatturato ...')
     A            PG2CFOL0      14  2       COLHDG('Costo Formula L ....')
     A            PG2CFOA0      14  2       COLHDG('Costo Formula A ....')
     A            PG2CFOC0      14  2       COLHDG('Costo Formula C ....')
     A            PG2CNTL0      14  2       COLHDG('Contribuzione L ....')
     A            PG2CNTA0      14  2       COLHDG('Contribuzione A ....')
     A            PG2CNTC0      14  2       COLHDG('Contribuzione C ....')
     A            PG2DAT10       8  0       COLHDG('Data Inizio periodo.')
     A            PG2DAT20       8  0       COLHDG('Data Fine   periodo.')
     * =============================================================== *
     *  TABELLA       : VENCLIF0                                     *
     *  DESCRIZIONE   : Analisi fatturato per Cliente/Prodotto        *
     *  PREFISSO      : PG3                                          *
     * =============================================================== *
     A            PG3MAGA0       2A         COLHDG('Stabilimento .......')
     A            PG3CLIE0       6A         COLHDG('Cod. Cliente .......')
     A            PG3RASC0      40A         COLHDG('Rag.Soc. Cliente ...')
     A            PG3PROD0      15A         COLHDG('Cod. Prodotto ......')
     A            PG3DESC0      30A         COLHDG('Des. Prodotto ......')
     A            PG3FORM0       6A         COLHDG('Formula ............')
     A            PG3FOMA0       2A         COLHDG('Formato ............')
     A            PG3BASE0       2A         COLHDG('Formato della Base..')
     A            PG3TOGM0       3A         COLHDG('OGM ................')
     A            PG3LINE0       2A         COLHDG('Linea prodotto .....')
     A            PG3UNMI0       2A         COLHDG('Unità di misura ....')
     A            PG3QFAT0      14  2       COLHDG('Volumi Fatturato ...')
     A            PG3VFAT0      14  2       COLHDG('Valore Fatturato ...')
     A            PG3CFOL0      14  2       COLHDG('Costo Formula L ....')
     A            PG3CFOA0      14  2       COLHDG('Costo Formula A ....')
     A            PG3CFOC0      14  2       COLHDG('Costo Formula C ....')
     A            PG3CNTL0      14  2       COLHDG('Contribuzione L ....')
     A            PG3CNTA0      14  2       COLHDG('Contribuzione A ....')
     A            PG3CNTC0      14  2       COLHDG('Contribuzione C ....')
     A            PG3DAT10       8  0       COLHDG('Data Inizio periodo.')
     A            PG3DAT20       8  0       COLHDG('Data Fine   periodo.')
     * =============================================================== *
     *  TABELLA       : ATTFATF0                                     *
     *  DESCRIZIONE   : Odini in portafoglio da segnalare con email   *
     *  PREFISSO      : AF0                                          *
     * =============================================================== *
     A            AF0STAT0       1A         COLHDG('Stato ..............')
     A            AF0IMUT0      10A         COLHDG('Immissione utente...')
     A            AF0IMDA0       8  0       COLHDG('Immissione data ....')
     A            AF0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AF0IMPG0      10A         COLHDG('Immissione programma')
     A            AF0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            AF0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            AF0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            AF0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            AF0CODI0       6A         COLHDG('Int.Fattura ........')
      *
     A            AF0FL010       2A         COLHDG('Flag 01 ............')
     A            AF0FL020       2A         COLHDG('Flag 02 ............')
     A            AF0FL030       2A         COLHDG('Flag 03 ............')
     A            AF0FL040       2A         COLHDG('Flag 04 ............')
     A            AF0FL050       2A         COLHDG('Flag 05 ............')
     A            AF0FL060      10A         COLHDG('Flag 06 ............')
     A            AF0FL070      10A         COLHDG('Flag 07 ............')
     A            AF0FL080      10A         COLHDG('Flag 08 ............')
     A            AF0FL090      10A         COLHDG('Flag 09 ............')
     A            AF0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : ORCL30F0                                     *
     *  DESCRIZIONE   : Primo inserimento ordine cliente              *
     *  PREFISSO      : O30                                          *
     * =============================================================== *
     A            O30STAT0       1A         COLHDG('Stato ..............')
     A            O30IMUT0      10A         COLHDG('Immissione utente...')
     A            O30IMDA0       8  0       COLHDG('Immissione data ....')
     A            O30IMOR0       6  0       COLHDG('Immissione ora .....')
     A            O30IMPG0      10A         COLHDG('Immissione programma')
      *
     A            O30DAOR0       8  0       COLHDG('Data Ordine ........')
     A            O30NUOR0       9  0       COLHDG('Numero Ordine ......')
      *
     A            O30FL010       2A         COLHDG('Flag 01 ............')
     A            O30FL020       2A         COLHDG('Flag 02 ............')
     A            O30FL030       2A         COLHDG('Flag 03 ............')
     A            O30FL040       2A         COLHDG('Flag 04 ............')
     A            O30FL050       2A         COLHDG('Flag 05 ............')
     A            O30FL060      10A         COLHDG('Flag 06 ............')
     A            O30FL070      10A         COLHDG('Flag 07 ............')
     A            O30FL080      10A         COLHDG('Flag 08 ............')
     A            O30FL090      10A         COLHDG('Flag 09 ............')
     A            O30FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : RACPREF0                                     *
     *  DESCRIZIONE   : Raccolta Premiata                             *
     *  PREFISSO      : RP0                                          *
     * =============================================================== *
     A            RP0STAT0       1A         COLHDG('Stato ..............')
     A            RP0IMUT0      10A         COLHDG('Immissione utente...')
     A            RP0IMDA0       8  0       COLHDG('Immissione data ....')
     A            RP0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            RP0IMPG0      10A         COLHDG('Immissione programma')
     A            RP0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            RP0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            RP0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            RP0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            RP0PROG0       9  0       COLHDG('Num. Progressivo ...')
     A            RP0MARC0       2          COLHDG('Marchio ............')
     A            RP0NOME0      50          COLHDG('Nome ...............')
     A            RP0COGN0      50          COLHDG('Cognome ............')
     A            RP0INDI0      50          COLHDG('Indirizzo ..........')
     A            RP0CAPP0       5          COLHDG('Cap ................')
     A            RP0CITT0      30          COLHDG('Città ..............')
     A            RP0PROV0       2          COLHDG('Provincia ..........')
     A            RP0TELE0      50          COLHDG('Telefono ...........')
     A            RP0MAIL0     100          COLHDG('eMail ..............')
     A            RP0NPUN0       4  0       COLHDG('Nr punti scheda ....')
     A            RP0CPRE0       6          COLHDG('Cod.premio .........')
     A            RP0NTAG0       4          COLHDG('Taglia .............')
     A            RP0CLIE0       6          COLHDG('Cod.Cli. Rivendita .')
     A            RP0ISPE0       3          COLHDG('Cod.Ispettore ......')
     A            RP0DINV0       8  0       COLHDG('Data Invio premio ..')
     A            RP0TINV0       1          COLHDG('1=Cliente,2=Rivend..')
     A            RP0NOTA0     100          COLHDG('Nota ...............')
      *
     A            RP0FL010       2A         COLHDG('Flag 01 ............')
     A            RP0FL020       2A         COLHDG('Flag 02 ............')
     A            RP0FL030       2A         COLHDG('Flag 03 ............')
     A            RP0FL040       2A         COLHDG('Flag 04 ............')
     A            RP0FL050       2A         COLHDG('Flag 05 ............')
     A            RP0FL060      10A         COLHDG('Flag 06 ............')
     A            RP0FL070      10A         COLHDG('Flag 07 ............')
     A            RP0FL080      10A         COLHDG('Flag 08 ............')
     A            RP0FL090      10A         COLHDG('Flag 09 ............')
     A            RP0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : RACANAF0                                     *
     *  DESCRIZIONE   : Anagr. Premi                                  *
     *  PREFISSO      : RP1                                          *
     * =============================================================== *
     A            RP1STAT0       1A         COLHDG('Stato ..............')
     A            RP1IMUT0      10A         COLHDG('Immissione utente...')
     A            RP1IMDA0       8  0       COLHDG('Immissione data ....')
     A            RP1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            RP1IMPG0      10A         COLHDG('Immissione programma')
     A            RP1AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            RP1AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            RP1AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            RP1AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            RP1CODI0       6          COLHDG('Cod.Premio .........')
     A            RP1DESC0      50          COLHDG('Des.Premio .........')
      *
     A            RP1FL010       2A         COLHDG('Flag 01 ............')
     A            RP1FL020       2A         COLHDG('Flag 02 ............')
     A            RP1FL030       2A         COLHDG('Flag 03 ............')
     A            RP1FL040       2A         COLHDG('Flag 04 ............')
     A            RP1FL050       2A         COLHDG('Flag 05 ............')
     A            RP1FL060      10A         COLHDG('Flag 06 ............')
     A            RP1FL070      10A         COLHDG('Flag 07 ............')
     A            RP1FL080      10A         COLHDG('Flag 08 ............')
     A            RP1FL090      10A         COLHDG('Flag 09 ............')
     A            RP1FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : GRUMATF0                                     *
     *  DESCRIZIONE   : Gruppo M.P. da gestire su costi "G"           *
     *  PREFISSO      : GM0                                          *
     * =============================================================== *
     A            GM0STAT0       1A         COLHDG('Stato ..............')
     A            GM0IMUT0      10A         COLHDG('Immissione utente...')
     A            GM0IMDA0       8  0       COLHDG('Immissione data ....')
     A            GM0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            GM0IMPG0      10A         COLHDG('Immissione programma')
     A            GM0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            GM0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            GM0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            GM0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            GM0CODI0      15          COLHDG('Cod.MP .............')
      *
     A            GM0FL010       2A         COLHDG('Flag 01 ............')
     A            GM0FL020       2A         COLHDG('Flag 02 ............')
     A            GM0FL030       2A         COLHDG('Flag 03 ............')
     A            GM0FL040       2A         COLHDG('Flag 04 ............')
     A            GM0FL050       2A         COLHDG('Flag 05 ............')
     A            GM0FL060      10A         COLHDG('Flag 06 ............')
     A            GM0FL070      10A         COLHDG('Flag 07 ............')
     A            GM0FL080      10A         COLHDG('Flag 08 ............')
     A            GM0FL090      10A         COLHDG('Flag 09 ............')
     A            GM0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : VALMAGF0                                     *
     *  DESCRIZIONE   : Valorizzazione rimanenze                      *
     *  PREFISSO      : VM0                                          *
     * =============================================================== *
     A            VM0STAT0       1A         COLHDG('Stato ..............')
     A            VM0IMUT0      10A         COLHDG('Immissione utente...')
     A            VM0IMDA0       8  0       COLHDG('Immissione data ....')
     A            VM0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            VM0IMPG0      10A         COLHDG('Immissione programma')
     A            VM0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            VM0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            VM0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            VM0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            VM0MAGA0       2          COLHDG('Stabilimento .......')
     A            VM0ANNO0       4  0       COLHDG('Anno ...............')
     A            VM0MESE0       2  0       COLHDG('Mese ...............')
     A            VM0CODI0      15          COLHDG('Codice articolo ....')
     A            VM0TIPO0       2          COLHDG('Tipo articolo ......')
     A            VM0QINI0      12  2       COLHDG('Q.tà iniziale ......')
     A            VM0VINI0      12  2       COLHDG('Val. iniziale ......')
     A            VM0QPER0      12  2       COLHDG('Q.tà periodo .......')
     A            VM0VPER0      12  2       COLHDG('Val. periodo .......')
     A            VM0QRIM0      12  2       COLHDG('Q.tà rimanenza .....')
     A            VM0VRIM0      12  2       COLHDG('Val. rimanenza .....')
      *
     A            VM0FL010       2A         COLHDG('Flag 01 ............')
     A            VM0FL020       2A         COLHDG('Flag 02 ............')
     A            VM0FL030       2A         COLHDG('Flag 03 ............')
     A            VM0FL040       2A         COLHDG('Flag 04 ............')
     A            VM0FL050       2A         COLHDG('Flag 05 ............')
     A            VM0FL060      10A         COLHDG('Flag 06 ............')
     A            VM0FL070      10A         COLHDG('Flag 07 ............')
     A            VM0FL080      10A         COLHDG('Flag 08 ............')
     A            VM0FL090      10A         COLHDG('Flag 09 ............')
     A            VM0FL100      10A         COLHDG('Flag 10 ............')
      *
     * =============================================================== *
     *  TABELLA       : NONPROF0                                     *
     *  DESCRIZIONE   : Formule che vendo ma non prodotte nel sito    *
     *  PREFISSO      : NP0                                          *
     * =============================================================== *
     A            NP0STAT0       1A         COLHDG('Stato ..............')
     A            NP0IMUT0      10A         COLHDG('Immissione utente...')
     A            NP0IMDA0       8  0       COLHDG('Immissione data ....')
     A            NP0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            NP0IMPG0      10A         COLHDG('Immissione programma')
     A            NP0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            NP0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            NP0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            NP0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            NP0PROD0      15          COLHDG('Prodotto ...........')
     A            NP0FORM0       6          COLHDG('Formula ............')
     A            NP0SASF0       1          COLHDG('I=Sa, R=Sfuso ......')
     A            NP0MAGP0       2          COLHDG('Stab. di produzione ')
     A            NP0MAGV0       2          COLHDG('Stab. di vendita ...')
     A            NP0VAL10       8  0       COLHDG('Validità da ........')
     A            NP0VAL20       8  0       COLHDG('Validità a .........')
     A            NP0COS10      12  4       COLHDG('Costo 1 ............')
     A            NP0COS20      12  4       COLHDG('Costo 2 ............')
     A            NP0COS30      12  4       COLHDG('Costo 3 ............')
      *
     A            NP0FL010       2A         COLHDG('Flag 01 ............')
     A            NP0FL020       2A         COLHDG('Flag 02 ............')
     A            NP0FL030       2A         COLHDG('Flag 03 ............')
     A            NP0FL040       2A         COLHDG('Flag 04 ............')
     A            NP0FL050       2A         COLHDG('Flag 05 ............')
     A            NP0FL060      10A         COLHDG('Flag 06 ............')
     A            NP0FL070      10A         COLHDG('Flag 07 ............')
     A            NP0FL080      10A         COLHDG('Flag 08 ............')
     A            NP0FL090      10A         COLHDG('Flag 09 ............')
     A            NP0FL100      10A         COLHDG('Flag 10 ............')
     * =============================================================== *
     *  TABELLA       : CEPRO7F0                                     *
     *  DESCRIZIONE   : Allegati ai progetti                          *
     *  PREFISSO      : NP0                                          *
     * =============================================================== *
     A            A7STAX0        1A         COLHDG('Stato ..............')
     A            A7IMUT0       10A         COLHDG('Immissione utente...')
     A            A7IMDA0        8  0       COLHDG('Immissione data ....')
     A            A7IMOR0        6  0       COLHDG('Immissione ora .....')
     A            A7IMPG0       10A         COLHDG('Immissione programma')
     A            A7AGUT0       10A         COLHDG('Aggiornam. utente...')
     A            A7AGDA0        8  0       COLHDG('Aggiorna,. data ....')
     A            A7AGOR0        6  0       COLHDG('Aggiornam. ora .....')
     A            A7AGPG0       10A         COLHDG('Aggiornam. programma')
      *
     A            A7TIPO0        1          COLHDG('Tipo record .....')
     A            A7PROG0       10          COLHDG('Cod.progetto.....')
     A            A7AZIO0        4S 0       COLHDG('Azione progetto .')
     A            A7RAPP0        9S 0       COLHDG('Nr. rapportino ..')
     A            A7SEQU0        4S 0       COLHDG('Sequenza link ...')
     A            A7LINK0      200          COLHDG('Link allegato ...')
      *
     A            A7FL010        2          COLHDG('Flag 01 .........')
     A            A7FL020        2          COLHDG('Flag 02 .........')
     A            A7FL030        2          COLHDG('Flag 03 .........')
     A            A7FL040        2          COLHDG('Flag 04 .........')
     A            A7FL050        2          COLHDG('Flag 05 .........')
     A            A7FL060       10          COLHDG('Flag 06 .........')
     A            A7FL070       10          COLHDG('Flag 07 .........')
     A            A7FL080       10          COLHDG('Flag 08 .........')
     A            A7FL090       10          COLHDG('Flag 09 .........')
     A            A7FL100       10          COLHDG('Flag 10 .........')
     ****************************************************************
     *  TABELLA       : MEDI00F0                                  *
     *  DESCRIZIONE   : ANAGR. MEDICAZIONI  PREFISSO :ME0         *
     ****************************************************************
     A            ME0STX0        1          COLHDG('Stato ...........')
     A            ME0USE0       10          COLHDG('Utente immissione')
     A            ME0DAE0        8  0       COLHDG('Data immissione .')
     A            ME0ORE0        6  0       COLHDG('Ora immissione...')
     A            ME0USA0       10          COLHDG('Utente aggiornam.')
     A            ME0DAA0        8  0       COLHDG('Data aggiornam...')
     A            ME0ORA0        6  0       COLHDG('Ora aggiornam....')
     A            ME0NRX0        9  0       COLHDG('Numero Azione ...')
     A            ME0CAZ0        4          COLHDG('Codice azione....')
     A            ME0PGM0       10          COLHDG('Programma immiss.')
     A            ME0PGA0       10          COLHDG('Programma modif..')
      *
     A            ME0MAG0        2          COLHDG('Cod.Magazzino....')
     A            ME0COD0       15          COLHDG('Cod.Medicazione..')
     A            ME0DES0       40          COLHDG('Des.Medicazione..')
     A            ME0DE10       40          COLHDG('Des1.Medicazione.')
     A            ME0DE20       40          COLHDG('Des2.Medicazione.')
     A            ME0DI10       50          COLHDG('Des.Impiego alte.')
     A            ME0DI20       50          COLHDG('Des.Impiego alte.')
     A            ME0DI30       50          COLHDG('Des.Impiego alte.')
     A            ME0DI40       50          COLHDG('Des.Impiego alte.')
     A            ME0DI50       50          COLHDG('Des.Impiego alte.')
     A            ME0IU10       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU20       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU30       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU40       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU50       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU60       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU70       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU80       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU90       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IU00       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IUA0       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IUB0       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IUC0       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IUD0       50          COLHDG('Istruz.Uso  alte.')
     A            ME0IUE0       50          COLHDG('Istruz.Uso  alte.')
     *
     A            ME0F010        2          COLHDG('Flag 01  ........')
     A            ME0F020        2          COLHDG('Flag 02  ........')
     A            ME0F030        2          COLHDG('Flag 03  ........')
     A            ME0F040        2          COLHDG('Flag 04  ........')
     A            ME0F050        2          COLHDG('Flag 05  ........')
     A            ME0F060        2          COLHDG('Flag 06  ........')
     A            ME0F070        2          COLHDG('Flag 07  ........')
     A            ME0F080       10          COLHDG('Flag 08  ........')
     A            ME0F090       10          COLHDG('Flag 09  ........')
     A            ME0F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : FORLOGF0                                  *
     *  DESCRIZIONE   : LOG FORNITORI PER QUALIF/DEQUALIF ISO9001 *
     ****************************************************************
     A            IS0STAT0       1A         COLHDG('Stato ..............')
     A            IS0IMUT0      10A         COLHDG('Immissione utente...')
     A            IS0IMDA0       8  0       COLHDG('Immissione data ....')
     A            IS0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            IS0IMPG0      10A         COLHDG('Immissione programma')
     A            IS0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            IS0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            IS0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            IS0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            IS0FORN0       6A         COLHDG('Cod.Fornitore ......')
     A            IS0DATA0       8  0       COLHDG('Data Operazione ....')
     A            IS0PROG0       9  0       COLHDG('Nr Progressivo .....')
     A            IS0QUDE0       1          COLHDG('Stato Qual/Dequal...')
     A            IS0UTEN0      10          COLHDG('Utente .............')
     A            IS0NOTA0      50          COLHDG('Nota ...............')
      *
     A            IS0FL010       2          COLHDG('Fille 01 ...........')
     A            IS0FL020       2          COLHDG('Fille 02 ...........')
     A            IS0FL030       2          COLHDG('Fille 03 ...........')
     A            IS0FL040       2          COLHDG('Fille 04 ...........')
     A            IS0FL050       2          COLHDG('Fille 05 ...........')
     A            IS0FL060      10          COLHDG('Fille 06 ...........')
     A            IS0FL070      10          COLHDG('Fille 07 ...........')
     A            IS0FL080      10          COLHDG('Fille 08 ...........')
     A            IS0FL090      10          COLHDG('Fille 09 ...........')
     A            IS0FL100      10          COLHDG('Fille 10 ...........')
      *
     ****************************************************************
     *  TABELLA       : CART92F0                                  *
     *  DESCRIZIONE   : PUBBLICAZIONE CARTELLINO PER WEB          *
     *  PREFISSO      : C92                                       *
     ****************************************************************
     A            C92STX0        1          COLHDG('Stato ...........')
     A            C92USE0       10          COLHDG('Utente immissione')
     A            C92DAE0        8  0       COLHDG('Data immissione .')
     A            C92ORE0        6  0       COLHDG('Ora immissione...')
     A            C92USA0       10          COLHDG('Utente aggiornam.')
     A            C92DAA0        8  0       COLHDG('Data aggiornam...')
     A            C92ORA0        6  0       COLHDG('Ora aggiornam....')
     A            C92NRX0        9  0       COLHDG('Numero Azione ...')
     A            C92CAZ0        4          COLHDG('Codice azione....')
     A            C92PGM0       10          COLHDG('Programma immiss.')
     A            C92PGA0       10          COLHDG('Programma modif..')
      *
     A            C92MAG0        2          COLHDG('Cod.Magazzino....')
     A            C92CPR0       15          COLHDG('Cod.Cartellino...')
     A            C92DPR0       30          COLHDG('Des.Cartellino...')
     A            C92ART0        6          COLHDG('Cod. Prodotto....')
     A            C92CME0        6          COLHDG('Cod. Medicazione.')
     A            C92MSC0        2          COLHDG('Mesi Scadenza....')
     A            C92LOG0        4          COLHDG('Cod.Logo.........')
     A            C92STS0        1          COLHDG('Status Cartellino')
     A            C92MED0        1          COLHDG('Prod.Medicato....')
     A            C92DDI0      300          COLHDG('Des.Dest.Impiego.')
     A            C92DTA0      600          COLHDG('Des.Ten.Analitici')
     A            C92DIN0     1000          COLHDG('Des.Ingredienti..')
     A            C92NOT0      200          COLHDG('Note.............')
     A            C92IXU0     1200          COLHDG('Istruz. per uso..')
     A            C92AUT0      200          COLHDG('Autorizzazione...')
     A            C92SOC0      200          COLHDG('Società e Indiri.')
     *
     A            C92PRO0       15          COLHDG('Cod.Prodotto.....')
     A            C92LOT0        9          COLHDG('Nr.Lotto.........')
     A            C92DTP0       10          COLHDG('Data Produzione..')
     A            C92DTS0       10          COLHDG('Data Scadenza....')
     A            C92NCP0        4  0       COLHDG('Nr.Copie Stampa..')
     A            C92EAN0       15          COLHDG('Cod. EAN.........')
      *
     A            C92DI01       40          COLHDG('Des.Integrazione.')
     A            C92UM01        4          COLHDG('Un.Misura........')
     A            C92VA01        8          COLHDG('Valore...........')
     A            C92FL01        1          COLHDG('Flag Layout .....')
     A            C92DI02       40          COLHDG('Des.Integrazione.')
     A            C92UM02        4          COLHDG('Un.Misura........')
     A            C92VA02        8          COLHDG('Valore...........')
     A            C92FL02        1          COLHDG('Flag Layout .....')
     A            C92DI03       40          COLHDG('Des.Integrazione.')
     A            C92UM03        4          COLHDG('Un.Misura........')
     A            C92VA03        8          COLHDG('Valore...........')
     A            C92FL03        1          COLHDG('Flag Layout .....')
     A            C92DI04       40          COLHDG('Des.Integrazione.')
     A            C92UM04        4          COLHDG('Un.Misura........')
     A            C92VA04        8          COLHDG('Valore...........')
     A            C92FL04        1          COLHDG('Flag Layout .....')
     A            C92DI05       40          COLHDG('Des.Integrazione.')
     A            C92UM05        4          COLHDG('Un.Misura........')
     A            C92VA05        8          COLHDG('Valore...........')
     A            C92FL05        1          COLHDG('Flag Layout .....')
     A            C92DI06       40          COLHDG('Des.Integrazione.')
     A            C92UM06        4          COLHDG('Un.Misura........')
     A            C92VA06        8          COLHDG('Valore...........')
     A            C92FL06        1          COLHDG('Flag Layout .....')
     A            C92DI07       40          COLHDG('Des.Integrazione.')
     A            C92UM07        4          COLHDG('Un.Misura........')
     A            C92VA07        8          COLHDG('Valore...........')
     A            C92FL07        1          COLHDG('Flag Layout .....')
     A            C92DI08       40          COLHDG('Des.Integrazione.')
     A            C92UM08        4          COLHDG('Un.Misura........')
     A            C92VA08        8          COLHDG('Valore...........')
     A            C92FL08        1          COLHDG('Flag Layout .....')
     A            C92DI09       40          COLHDG('Des.Integrazione.')
     A            C92UM09        4          COLHDG('Un.Misura........')
     A            C92VA09        8          COLHDG('Valore...........')
     A            C92FL09        1          COLHDG('Flag Layout .....')
     A            C92DI10       40          COLHDG('Des.Integrazione.')
     A            C92UM10        4          COLHDG('Un.Misura........')
     A            C92VA10        8          COLHDG('Valore...........')
     A            C92FL10        1          COLHDG('Flag Layout .....')
     A            C92DI11       40          COLHDG('Des.Integrazione.')
     A            C92UM11        4          COLHDG('Un.Misura........')
     A            C92VA11        8          COLHDG('Valore...........')
     A            C92FL11        1          COLHDG('Flag Layout .....')
     A            C92DI12       40          COLHDG('Des.Integrazione.')
     A            C92UM12        4          COLHDG('Un.Misura........')
     A            C92VA12        8          COLHDG('Valore...........')
     A            C92FL12        1          COLHDG('Flag Layout .....')
     A            C92DI13       40          COLHDG('Des.Integrazione.')
     A            C92UM13        4          COLHDG('Un.Misura........')
     A            C92VA13        8          COLHDG('Valore...........')
     A            C92FL13        1          COLHDG('Flag Layout .....')
     A            C92DI14       40          COLHDG('Des.Integrazione.')
     A            C92UM14        4          COLHDG('Un.Misura........')
     A            C92VA14        8          COLHDG('Valore...........')
     A            C92FL14        1          COLHDG('Flag Layout .....')
     A            C92DI15       40          COLHDG('Des.Integrazione.')
     A            C92UM15        4          COLHDG('Un.Misura........')
     A            C92VA15        8          COLHDG('Valore...........')
     A            C92FL15        1          COLHDG('Flag Layout .....')
     A            C92DI16       40          COLHDG('Des.Integrazione.')
     A            C92UM16        4          COLHDG('Un.Misura........')
     A            C92VA16        8          COLHDG('Valore...........')
     A            C92FL16        1          COLHDG('Flag Layout .....')
     A            C92DI17       40          COLHDG('Des.Integrazione.')
     A            C92UM17        4          COLHDG('Un.Misura........')
     A            C92VA17        8          COLHDG('Valore...........')
     A            C92FL17        1          COLHDG('Flag Layout .....')
     A            C92DI18       40          COLHDG('Des.Integrazione.')
     A            C92UM18        4          COLHDG('Un.Misura........')
     A            C92VA18        8          COLHDG('Valore...........')
     A            C92FL18        1          COLHDG('Flag Layout .....')
     A            C92DI19       40          COLHDG('Des.Integrazione.')
     A            C92UM19        4          COLHDG('Un.Misura........')
     A            C92VA19        8          COLHDG('Valore...........')
     A            C92FL19        1          COLHDG('Flag Layout .....')
     A            C92DI20       40          COLHDG('Des.Integrazione.')
     A            C92UM20        4          COLHDG('Un.Misura........')
     A            C92VA20        8          COLHDG('Valore...........')
     A            C92FL20        1          COLHDG('Flag Layout .....')
     A            C92DI21       40          COLHDG('Des.Integrazione.')
     A            C92UM21        4          COLHDG('Un.Misura........')
     A            C92VA21        8          COLHDG('Valore...........')
     A            C92FL21        1          COLHDG('Flag Layout .....')
     A            C92DI22       40          COLHDG('Des.Integrazione.')
     A            C92UM22        4          COLHDG('Un.Misura........')
     A            C92VA22        8          COLHDG('Valore...........')
     A            C92FL22        1          COLHDG('Flag Layout .....')
     A            C92DI23       40          COLHDG('Des.Integrazione.')
     A            C92UM23        4          COLHDG('Un.Misura........')
     A            C92VA23        8          COLHDG('Valore...........')
     A            C92FL23        1          COLHDG('Flag Layout .....')
     A            C92DI24       40          COLHDG('Des.Integrazione.')
     A            C92UM24        4          COLHDG('Un.Misura........')
     A            C92VA24        8          COLHDG('Valore...........')
     A            C92FL24        1          COLHDG('Flag Layout .....')
     A            C92DI25       40          COLHDG('Des.Integrazione.')
     A            C92UM25        4          COLHDG('Un.Misura........')
     A            C92VA25        8          COLHDG('Valore...........')
     A            C92FL25        1          COLHDG('Flag Layout .....')
     A            C92DI26       40          COLHDG('Des.Integrazione.')
     A            C92UM26        4          COLHDG('Un.Misura........')
     A            C92VA26        8          COLHDG('Valore...........')
     A            C92FL26        1          COLHDG('Flag Layout .....')
     A            C92DI27       40          COLHDG('Des.Integrazione.')
     A            C92UM27        4          COLHDG('Un.Misura........')
     A            C92VA27        8          COLHDG('Valore...........')
     A            C92FL27        1          COLHDG('Flag Layout .....')
     A            C92DI28       40          COLHDG('Des.Integrazione.')
     A            C92UM28        4          COLHDG('Un.Misura........')
     A            C92VA28        8          COLHDG('Valore...........')
     A            C92FL28        1          COLHDG('Flag Layout .....')
     A            C92DI29       40          COLHDG('Des.Integrazione.')
     A            C92UM29        4          COLHDG('Un.Misura........')
     A            C92VA29        8          COLHDG('Valore...........')
     A            C92FL29        1          COLHDG('Flag Layout .....')
     A            C92DI30       40          COLHDG('Des.Integrazione.')
     A            C92UM30        4          COLHDG('Un.Misura........')
     A            C92VA30        8          COLHDG('Valore...........')
     A            C92FL30        1          COLHDG('Flag Layout .....')
     A            C92DI31       40          COLHDG('Des.Integrazione.')
     A            C92UM31        4          COLHDG('Un.Misura........')
     A            C92VA31        8          COLHDG('Valore...........')
     A            C92FL31        1          COLHDG('Flag Layout .....')
     A            C92DI32       40          COLHDG('Des.Integrazione.')
     A            C92UM32        4          COLHDG('Un.Misura........')
     A            C92VA32        8          COLHDG('Valore...........')
     A            C92FL32        1          COLHDG('Flag Layout .....')
     A            C92DI33       40          COLHDG('Des.Integrazione.')
     A            C92UM33        4          COLHDG('Un.Misura........')
     A            C92VA33        8          COLHDG('Valore...........')
     A            C92FL33        1          COLHDG('Flag Layout .....')
     A            C92DI34       40          COLHDG('Des.Integrazione.')
     A            C92UM34        4          COLHDG('Un.Misura........')
     A            C92VA34        8          COLHDG('Valore...........')
     A            C92FL34        1          COLHDG('Flag Layout .....')
     A            C92DI35       40          COLHDG('Des.Integrazione.')
     A            C92UM35        4          COLHDG('Un.Misura........')
     A            C92VA35        8          COLHDG('Valore...........')
     A            C92FL35        1          COLHDG('Flag Layout .....')
     A            C92DI36       40          COLHDG('Des.Integrazione.')
     A            C92UM36        4          COLHDG('Un.Misura........')
     A            C92VA36        8          COLHDG('Valore...........')
     A            C92FL36        1          COLHDG('Flag Layout .....')
     A            C92DI37       40          COLHDG('Des.Integrazione.')
     A            C92UM37        4          COLHDG('Un.Misura........')
     A            C92VA37        8          COLHDG('Valore...........')
     A            C92FL37        1          COLHDG('Flag Layout .....')
     A            C92DI38       40          COLHDG('Des.Integrazione.')
     A            C92UM38        4          COLHDG('Un.Misura........')
     A            C92VA38        8          COLHDG('Valore...........')
     A            C92FL38        1          COLHDG('Flag Layout .....')
     A            C92DI39       40          COLHDG('Des.Integrazione.')
     A            C92UM39        4          COLHDG('Un.Misura........')
     A            C92VA39        8          COLHDG('Valore...........')
     A            C92FL39        1          COLHDG('Flag Layout .....')
     A            C92DI40       40          COLHDG('Des.Integrazione.')
     A            C92UM40        4          COLHDG('Un.Misura........')
     A            C92VA40        8          COLHDG('Valore...........')
     A            C92FL40        1          COLHDG('Flag Layout .....')
     A            C92DI41       40          COLHDG('Des.Integrazione.')
     A            C92UM41        4          COLHDG('Un.Misura........')
     A            C92VA41        8          COLHDG('Valore...........')
     A            C92FL41        1          COLHDG('Flag Layout .....')
     A            C92DI42       40          COLHDG('Des.Integrazione.')
     A            C92UM42        4          COLHDG('Un.Misura........')
     A            C92VA42        8          COLHDG('Valore...........')
     A            C92FL42        1          COLHDG('Flag Layout .....')
     A            C92DI43       40          COLHDG('Des.Integrazione.')
     A            C92UM43        4          COLHDG('Un.Misura........')
     A            C92VA43        8          COLHDG('Valore...........')
     A            C92FL43        1          COLHDG('Flag Layout .....')
     A            C92DI44       40          COLHDG('Des.Integrazione.')
     A            C92UM44        4          COLHDG('Un.Misura........')
     A            C92VA44        8          COLHDG('Valore...........')
     A            C92FL44        1          COLHDG('Flag Layout .....')
     A            C92DI45       40          COLHDG('Des.Integrazione.')
     A            C92UM45        4          COLHDG('Un.Misura........')
     A            C92VA45        8          COLHDG('Valore...........')
     A            C92FL45        1          COLHDG('Flag Layout .....')
     A            C92DI46       40          COLHDG('Des.Integrazione.')
     A            C92UM46        4          COLHDG('Un.Misura........')
     A            C92VA46        8          COLHDG('Valore...........')
     A            C92FL46        1          COLHDG('Flag Layout .....')
     A            C92DI47       40          COLHDG('Des.Integrazione.')
     A            C92UM47        4          COLHDG('Un.Misura........')
     A            C92VA47        8          COLHDG('Valore...........')
     A            C92FL47        1          COLHDG('Flag Layout .....')
     A            C92DI48       40          COLHDG('Des.Integrazione.')
     A            C92UM48        4          COLHDG('Un.Misura........')
     A            C92VA48        8          COLHDG('Valore...........')
     A            C92FL48        1          COLHDG('Flag Layout .....')
     A            C92DI49       40          COLHDG('Des.Integrazione.')
     A            C92UM49        4          COLHDG('Un.Misura........')
     A            C92VA49        8          COLHDG('Valore...........')
     A            C92FL49        1          COLHDG('Flag Layout .....')
     A            C92DI50       40          COLHDG('Des.Integrazione.')
     A            C92UM50        4          COLHDG('Un.Misura........')
     A            C92VA50        8          COLHDG('Valore...........')
     A            C92FL50        1          COLHDG('Flag Layout .....')
     A            C92DI51       40          COLHDG('Des.Integrazione.')
     A            C92UM51        4          COLHDG('Un.Misura........')
     A            C92VA51        8          COLHDG('Valore...........')
     A            C92FL51        1          COLHDG('Flag Layout .....')
     A            C92DI52       40          COLHDG('Des.Integrazione.')
     A            C92UM52        4          COLHDG('Un.Misura........')
     A            C92VA52        8          COLHDG('Valore...........')
     A            C92FL52        1          COLHDG('Flag Layout .....')
     A            C92DI53       40          COLHDG('Des.Integrazione.')
     A            C92UM53        4          COLHDG('Un.Misura........')
     A            C92VA53        8          COLHDG('Valore...........')
     A            C92FL53        1          COLHDG('Flag Layout .....')
     A            C92DI54       40          COLHDG('Des.Integrazione.')
     A            C92UM54        4          COLHDG('Un.Misura........')
     A            C92VA54        8          COLHDG('Valore...........')
     A            C92FL54        1          COLHDG('Flag Layout .....')
     A            C92DI55       40          COLHDG('Des.Integrazione.')
     A            C92UM55        4          COLHDG('Un.Misura........')
     A            C92VA55        8          COLHDG('Valore...........')
     A            C92FL55        1          COLHDG('Flag Layout .....')
     A            C92DI56       40          COLHDG('Des.Integrazione.')
     A            C92UM56        4          COLHDG('Un.Misura........')
     A            C92VA56        8          COLHDG('Valore...........')
     A            C92FL56        1          COLHDG('Flag Layout .....')
     A            C92DI57       40          COLHDG('Des.Integrazione.')
     A            C92UM57        4          COLHDG('Un.Misura........')
     A            C92VA57        8          COLHDG('Valore...........')
     A            C92FL57        1          COLHDG('Flag Layout .....')
     A            C92DI58       40          COLHDG('Des.Integrazione.')
     A            C92UM58        4          COLHDG('Un.Misura........')
     A            C92VA58        8          COLHDG('Valore...........')
     A            C92FL58        1          COLHDG('Flag Layout .....')
     A            C92DI59       40          COLHDG('Des.Integrazione.')
     A            C92UM59        4          COLHDG('Un.Misura........')
     A            C92VA59        8          COLHDG('Valore...........')
     A            C92FL59        1          COLHDG('Flag Layout .....')
     A            C92DI60       40          COLHDG('Des.Integrazione.')
     A            C92UM60        4          COLHDG('Un.Misura........')
     A            C92VA60        8          COLHDG('Valore...........')
     A            C92FL60        1          COLHDG('Flag Layout .....')
      *
     A            C92F010        2          COLHDG('Flag 01  ........')
     A            C92F020        2          COLHDG('Flag 02  ........')
     A            C92F030        2          COLHDG('Marchio  ........')
     A            C92F040        2          COLHDG('Nr Copie Cartel..')
     A            C92F050        2          COLHDG('C=Coccidiostatico')
     A            C92F060        2          COLHDG('Flag 06  ........')
     A            C92F070        2          COLHDG('Layout stampa ...')
     A            C92F080       10          COLHDG('Flag 08  ........')
     A            C92F090       10          COLHDG('Flag 09  ........')
     A            C92F100       10          COLHDG('Flag 10  ........')
     ****************************************************************
     *  TABELLA       : CARLOGF0                                  *
     *  DESCRIZIONE   : Mancati elementi non stp su Cartellini    *
     ****************************************************************
     A            LC0STAT0       1A         COLHDG('Stato ..............')
     A            LC0IMUT0      10A         COLHDG('Immissione utente...')
     A            LC0IMDA0       8  0       COLHDG('Immissione data ....')
     A            LC0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            LC0IMPG0      10A         COLHDG('Immissione programma')
     A            LC0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            LC0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            LC0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            LC0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            LC0DATA0       8  0       COLHDG('Data ...............')
     A            LC0ORAA0       6  0       COLHDG('Ora ................')
     A            LC0UTEN0      10          COLHDG('Utente .............')
     A            LC0MAGA0       2          COLHDG('Stab.to ............')
     A            LC0PROD0      15          COLHDG('Prodotto ...........')
     A            LC0DEPA0      30          COLHDG('Descr. Prodotto ....')
     A            LC0NREC0       6  0       COLHDG('Nr elemento ........')
     A            LC0DESC0      30          COLHDG('Descr. elemento ....')
     A            LC0UNMI0       2          COLHDG('Unità di Misura ....')
     A            LC0QUAN0      12  2       COLHDG('Q.tà ...............')
     A            LC0NOTA0      50          COLHDG('Nota ...............')
      *
     A            LC0FL010       2          COLHDG('Fille 01 ...........')
     A            LC0FL020       2          COLHDG('Fille 02 ...........')
     A            LC0FL030       2          COLHDG('Fille 03 ...........')
     A            LC0FL040       2          COLHDG('Fille 04 ...........')
     A            LC0FL050       2          COLHDG('Fille 05 ...........')
     A            LC0FL060      10          COLHDG('Fille 06 ...........')
     A            LC0FL070      10          COLHDG('Fille 07 ...........')
     A            LC0FL080      10          COLHDG('Fille 08 ...........')
     A            LC0FL090      10          COLHDG('Fille 09 ...........')
     A            LC0FL100      10          COLHDG('Fille 10 ...........')
     ****************************************************************
     *  TABELLA       : QUAMAXF0                                  *
     *  DESCRIZIONE   : Q.tà max vendibile per prodotto            *
     ****************************************************************
     A            QM0STAT0       1A         COLHDG('Stato ..............')
     A            QM0IMUT0      10A         COLHDG('Immissione utente...')
     A            QM0IMDA0       8  0       COLHDG('Immissione data ....')
     A            QM0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            QM0IMPG0      10A         COLHDG('Immissione programma')
     A            QM0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            QM0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            QM0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            QM0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            QM0DATA0       8  0       COLHDG('Data validità ......')
     A            QM0PROD0      15          COLHDG('Cod. Prodotto ......')
     A            QM0QUAN0      12  2       COLHDG('Q.tà max vendibile .')
     A            QM0PROG0       9  0       COLHDG('Progressivo ...... .')
      *
     A            QM0FL010       2          COLHDG('Fille 01 ...........')
     A            QM0FL020       2          COLHDG('Fille 02 ...........')
     A            QM0FL030       2          COLHDG('Fille 03 ...........')
     A            QM0FL040       2          COLHDG('Fille 04 ...........')
     A            QM0FL050       2          COLHDG('Fille 05 ...........')
     A            QM0FL060      10          COLHDG('Fille 06 ...........')
     A            QM0FL070      10          COLHDG('Fille 07 ...........')
     A            QM0FL080      10          COLHDG('Fille 08 ...........')
     A            QM0FL090      10          COLHDG('Fille 09 ...........')
     A            QM0FL100      10          COLHDG('Fille 10 ...........')
     ****************************************************************
     *  TABELLA       : PRORITF0                                  *
     *  DESCRIZIONE   : Clienti che ritirano prodotti particolari  *
     ****************************************************************
     A            PR0STAT0       1A         COLHDG('Stato ..............')
     A            PR0IMUT0      10A         COLHDG('Immissione utente...')
     A            PR0IMDA0       8  0       COLHDG('Immissione data ....')
     A            PR0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            PR0IMPG0      10A         COLHDG('Immissione programma')
     A            PR0AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            PR0AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            PR0AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            PR0AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            PR0DATA0       8  0       COLHDG('Data validità ......')
     A            PR0CLIE0       6          COLHDG('Cod. cliente .......')
     A            PR0PROD0      15          COLHDG('Cod. prodotto ......')
     A            PR0PROG0       9  0       COLHDG('Progressivo ........')
     A            PR0FLAG0       2          COLHDG('Stato SI/NO ........')
      *
     A            PR0FL010       2          COLHDG('Fille 01 ...........')
     A            PR0FL020       2          COLHDG('Fille 02 ...........')
     A            PR0FL030       2          COLHDG('Fille 03 ...........')
     A            PR0FL040       2          COLHDG('Fille 04 ...........')
     A            PR0FL050       2          COLHDG('Fille 05 ...........')
     A            PR0FL060      10          COLHDG('Fille 06 ...........')
     A            PR0FL070      10          COLHDG('Fille 07 ...........')
     A            PR0FL080      10          COLHDG('Fille 08 ...........')
     A            PR0FL090      10          COLHDG('Fille 09 ...........')
     A            PR0FL100      10          COLHDG('Fille 10 ...........')
     ****************************************************************
     *  TABELLA       : COSTMPF0                                  *
     *  DESCRIZIONE   : Costo m.p. MPR                             *
     ****************************************************************
     A            CM1STAT0       1A         COLHDG('Stato ..............')
     A            CM1IMUT0      10A         COLHDG('Immissione utente...')
     A            CM1IMDA0       8  0       COLHDG('Immissione data ....')
     A            CM1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            CM1IMPG0      10A         COLHDG('Immissione programma')
     A            CM1AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            CM1AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            CM1AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            CM1AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            CM1STAN0       1          COLHDG('Tipo standard ......')
     A            CM1DATA0       8  0       COLHDG('Data validità ......')
     A            CM1PROD0      15          COLHDG('Cod. M.P. ..........')
     A            CM1COST0      18  4       COLHDG('Costo e/ton. .......')
     A            CM1SEQU0       6  0       COLHDG('Nr sequenza ........')
      *
     A            CM1FL010       2          COLHDG('Fille 01 ...........')
     A            CM1FL020       2          COLHDG('Fille 02 ...........')
     A            CM1FL030       2          COLHDG('Fille 03 ...........')
     A            CM1FL040       2          COLHDG('Fille 04 ...........')
     A            CM1FL050       2          COLHDG('Fille 05 ...........')
     A            CM1FL060      10          COLHDG('Fille 06 ...........')
     A            CM1FL070      10          COLHDG('Fille 07 ...........')
     A            CM1FL080      10          COLHDG('Fille 08 ...........')
     A            CM1FL090      10          COLHDG('Fille 09 ...........')
     A            CM1FL100      10          COLHDG('Fille 10 ...........')
     ****************************************************************
     *  TABELLA       : ACCOQUF0                                  *
     *  DESCRIZIONE   : Accordo Quadro                             *
     ****************************************************************
     A            AQ1STAT0       1A         COLHDG('Stato ..............')
     A            AQ1IMUT0      10A         COLHDG('Immissione utente...')
     A            AQ1IMDA0       8  0       COLHDG('Immissione data ....')
     A            AQ1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            AQ1IMPG0      10A         COLHDG('Immissione programma')
     A            AQ1AGUT0      10A         COLHDG('Aggiornam. utente...')
     A            AQ1AGDA0       8  0       COLHDG('Aggiorna,. data ....')
     A            AQ1AGOR0       6  0       COLHDG('Aggiornam. ora .....')
     A            AQ1AGPG0      10A         COLHDG('Aggiornam. programma')
      *
     A            AQ1CLIE0       6          COLHDG('Cliente ............')
     A            AQ1AGEN0       3          COLHDG('Agente .............')
     A            AQ1ISPE0       3          COLHDG('Ispettore ..........')
     A            AQ1AREA0       3          COLHDG('Area ...............')
     A            AQ1NOME0      35          COLHDG('Nominativo cliente .')
     A            AQ1PECC0     100          COLHDG('Pec ................')
     A            AQ1MAIL0     100          COLHDG('eMail ..............')
     A            AQ1DTEM0       8  0       COLHDG('Data emissione doc..')
     A            AQ1NREM0       9  0       COLHDG('Num. emissione doc..')
     A            AQ1DTIN0       8  0       COLHDG('Data invio .........')
     A            AQ1ORIN0       6  0       COLHDG('Ora  invio .........')
     A            AQ1UTIN0      10          COLHDG('Utente invio .......')
      *
     A            AQ1UTPR0      10          COLHDG('Utente profilazione ')
     A            AQ1DTPR0       8  0       COLHDG('Data   profilazione ')
     A            AQ1ORPR0       6  0       COLHDG('Ora    profilazione ')
     A            AQ1BAR10      20          COLHDG('Nr Barcode ........ ')
     A            AQ1FILE0     100          COLHDG('Nome file da inviare')
      *
     A            AQ1PROG0       9  0       COLHDG('Nr progressivo univ.')
     A            AQ1TDOC0       3          COLHDG('Tipo Documento .....')
     A            AQ1ANNO0       4  0       COLHDG('Anno ...............')
     A            AQ1SEQU0       6  0       COLHDG('Nr Sequenza doc. ...')
      *
     A            AQ1FL010       2          COLHDG('Fille 01 ...........')
     A            AQ1FL020       2          COLHDG('Fille 02 ...........')
     A            AQ1FL030       2          COLHDG('Fille 03 ...........')
     A            AQ1FL040       2          COLHDG('Fille 04 ...........')
     A            AQ1FL050       2          COLHDG('Fille 05 ...........')
     A            AQ1FL060      10          COLHDG('Fille 06 ...........')
     A            AQ1FL070      10          COLHDG('Fille 07 ...........')
     A            AQ1FL080      10          COLHDG('Fille 08 ...........')
     A            AQ1FL090      10          COLHDG('Fille 09 ...........')
     A            AQ1FL100      10          COLHDG('Fille 10 ...........')
     * =============================================================== *
     *  ARCHIVIO      : LIVEZOF0                                     *
     *  DESCRIZIONE   : Aggregazione Isp/Zone per listino pet-food   *
     *  PREFISSO      : BD5                                          *
     * =============================================================== *
     A            BD5STAT0       1A         COLHDG('Stato ..............')
     A            BD5IMUT0      10A         COLHDG('Immissione utente...')
     A            BD5IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD5IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD5IMPG0      10A         COLHDG('Immissione programma')
     A            BD5IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD5AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD5AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD5AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD5AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD5AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD5SOCI0       2A         COLHDG('Società ............')
      *
     A            BD5ISPE0       3          COLHDG('Codice Ispettore ...')
     A            BD5ZONA0       3  0       COLHDG('Codice Zona.........')
     A            BD5DALI0       8  0       COLHDG('Data listino .......')
     A            BD5NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD5FL010       2          COLHDG('Flag 01 ............')
     A            BD5FL020       2          COLHDG('Flag 02 ............')
     A            BD5FL030       2          COLHDG('Flag 03 ............')
     A            BD5FL040       2          COLHDG('Flag 04 ............')
     A            BD5FL050       2          COLHDG('Flag 05 ............')
     A            BD5FL060      10          COLHDG('Altra chiave x petfo')
     A            BD5FL070      10          COLHDG('Flag 07 ............')
     A            BD5FL080      10          COLHDG('Flag 08 ............')
     A            BD5FL090      10          COLHDG('Flag 09 ............')
     A            BD5FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : LIVELIF0                                     *
     *  DESCRIZIONE   : Prezzi Listino per Zona prod. pet-food       *
     *  PREFISSO      : BD6                                          *
     * =============================================================== *
     A            BD6STAT0       1A         COLHDG('Stato ..............')
     A            BD6IMUT0      10A         COLHDG('Immissione utente...')
     A            BD6IMDA0       8  0       COLHDG('Immissione data ....')
     A            BD6IMOR0       6  0       COLHDG('Immissione ora .....')
     A            BD6IMPG0      10A         COLHDG('Immissione programma')
     A            BD6IMAZ0      10A         COLHDG('Immissione azione...')
     A            BD6AGUT0      10A         COLHDG('Aggiornamento utente')
     A            BD6AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            BD6AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            BD6AGPG0      10A         COLHDG('Aggiornamento progr.')
     A            BD6AGAZ0      10A         COLHDG('Aggiornamento azione')
     A            BD6SOCI0       2A         COLHDG('Società ............')
      *
     A            BD6PROD0      15          COLHDG('Codice Prodotto ....')
     A            BD6ZONA0       3  0       COLHDG('Codice Zona ........')
     A            BD6PREZ0      12  4       COLHDG('Prezzo Listino .....')
     A            BD6DALI0       8  0       COLHDG('Data listino .......')
     A            BD6NUME0       9  0       COLHDG('Numero interno .....')
      *
     A            BD6FL010       2          COLHDG('Flag 01 ............')
     A            BD6FL020       2          COLHDG('Flag 02 ............')
     A            BD6FL030       2          COLHDG('Flag 03 ............')
     A            BD6FL040       2          COLHDG('Flag 04 ............')
     A            BD6FL050       2          COLHDG('Flag 05 ............')
     A            BD6FL060      10          COLHDG('Flag 06 ............')
     A            BD6FL070      10          COLHDG('Flag 07 ............')
     A            BD6FL080      10          COLHDG('Flag 08 ............')
     A            BD6FL090      10          COLHDG('Flag 09 ............')
     A            BD6FL100      10          COLHDG('Flag 10 ............')
      * ================================================================ *
      *  ANAIMPF0. Anagrafico impianti                                   *
      *                                                                  *
      * ================================================================ *
     A            AHSTX0         1          COLHDG('Stato ...........')
     A            AHUSE0        10          COLHDG('Utente ..........')
      *
     A            AHSCX0         2S 0       COLHDG('ss.  variazione .')
     A            AHANX0         2S 0       COLHDG('aa.  variazione .')
     A            AHMSX0         2S 0       COLHDG('mm.  variazione .')
     A            AHGRX0         2S 0       COLHDG('gg.  variazione .')
     A            AHNRX0         9P 0       COLHDG('Numero Azione ...')
     A            AHORX0         6S 0       COLHDG('Ora Variazione...')
     A            AHPGM0        10          COLHDG('Programma .......')
      *
     A            AHMAG0         2          COLHDG('Codice magazzino.')
     A            AHIMP0         3          COLHDG('Codice impianto..')
     A            AHTIP0         2          COLHDG('Tipo impianto ...')
      *
      *                                     PR=Presse
      *                                     IN=Insaccatrici
      *                                     KU=Kubettatrici
      *                                     Mi=Miscelatore
      *                                     PR=Presse
      *                                     Mo=Molini
      *                                     MT=Maturaore (Melasso)
      *
     A            AHCOP0         1          COLHDG('Codifica preced..')
     A            AHDES0        40          COLHDG('Descrizione .....')
      *
     A            AHQ050        18P 4       COLHDG('Q.tà KG conf.005.')
     A            AHQ100        18P 4       COLHDG('Q.tà KG conf.010.')
     A            AHQ150        18P 4       COLHDG('Q.tà KG conf.015.')
     A            AHQ200        18P 4       COLHDG('Q.tà KG conf.020.')
     A            AHQ250        18P 4       COLHDG('Q.tà KG conf.025.')
     A            AHQ300        18P 4       COLHDG('Q.tà KG conf.030.')
     A            AHQ350        18P 4       COLHDG('Q.tà KG conf.035.')
     A            AHQ400        18P 4       COLHDG('Q.tà KG conf.040.')
     A            AHQ450        18P 4       COLHDG('Q.tà KG conf.045.')
     A            AHQ500        18P 4       COLHDG('Q.tà KG conf.050.')
     A            AHSEU0         4S 0       COLHDG('MM:SS tempo setup')
     A            AHIC10         4          COLHDG('Impianto COGEIM .')
     A            AHIC20         4          COLHDG('Impianto COGEIM .')
      *
     A            AHF010         2          COLHDG('Linea di produz..')
     A            AHF020         2          COLHDG('Flag 02 .........')
     A            AHF030         2          COLHDG('Flag 03 .........')
     A            AHF040         2          COLHDG('Flag 04 .........')
     A            AHF050         2          COLHDG('Flag 05 .........')
     A            AHF060         2          COLHDG('Flag 06 .........')
     A            AHF070         2          COLHDG('Flag 07 .........')
     A            AHF080         2          COLHDG('Flag 08 .........')
     A            AHF090         2          COLHDG('Flag 09 .........')
     A            AHF100         2          COLHDG('Flag 10 .........')
     * =============================================================== *
     *  ARCHIVIO      : SVETAZF0                                     *
     *  DESCRIZIONE   : Storico Vetture Aziendali                    *
     *  PREFISSO      : SV1                                          *
     * =============================================================== *
     A            SV1STAT0       1A         COLHDG('Stato ..............')
     A            SV1IMUT0      10A         COLHDG('Immissione utente...')
     A            SV1IMDA0       8  0       COLHDG('Immissione data ....')
     A            SV1IMOR0       6  0       COLHDG('Immissione ora .....')
     A            SV1IMPG0      10A         COLHDG('Immissione programma')
     A            SV1AGUT0      10A         COLHDG('Aggiornamento utente')
     A            SV1AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            SV1AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            SV1AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            SV1PROG0       9  0       COLHDG('Progressivo ........')
     A            SV1VETT0       4          COLHDG('Codice vettura .....')
     A            SV1DAPA0       8  0       COLHDG('Data Partenza ......')
     A            SV1ORPA0       4  0       COLHDG('Ora Partenza .......')
     A            SV1LUPA0      50          COLHDG('Luogo Partenza .....')
     A            SV1DARI0       8  0       COLHDG('Data Ritorno .......')
     A            SV1ORRI0       4  0       COLHDG('Ora Ritorno ........')
     A            SV1LURI0      50          COLHDG('Luogo Ritorno ......')
     A            SV1DAAS0       8  0       COLHDG('Data assegnazione ..')
     A            SV1ASSE0      50          COLHDG('Assegnatario .......')
     A            SV1NOTE0     300          COLHDG('Motivo .............')
      *
     A            SV1FL010       2          COLHDG('Flag 01 ............')
     A            SV1FL020       2          COLHDG('Flag 02 ............')
     A            SV1FL030       2          COLHDG('Flag 03 ............')
     A            SV1FL040       2          COLHDG('Flag 04 ............')
     A            SV1FL050       2          COLHDG('Flag 05 ............')
     A            SV1FL060      10          COLHDG('Flag 06 ............')
     A            SV1FL070      10          COLHDG('Flag 07 ............')
     A            SV1FL080      10          COLHDG('Flag 08 ............')
     A            SV1FL090      10          COLHDG('Flag 09 ............')
     A            SV1FL100      10          COLHDG('Flag 10 ............')
      *
     * =============================================================== *
     *  ARCHIVIO      : FISSTAF0                                     *
     *  DESCRIZIONE   : Stato fisico prodotti x nuovo listino/contrb.*
     *  PREFISSO      : FS0                                          *
     * =============================================================== *
     A            FS0STAT0       1A         COLHDG('Stato ..............')
     A            FS0IMUT0      10A         COLHDG('Immissione utente...')
     A            FS0IMDA0       8  0       COLHDG('Immissione data ....')
     A            FS0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            FS0IMPG0      10A         COLHDG('Immissione programma')
     A            FS0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            FS0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            FS0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            FS0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            FS0CODI0       4          COLHDG('Cod. Stato fisico ..')
     A            FS0DESC0      30          COLHDG('Des. Stato fisico ..')
      *
     A            FS0FL010       2          COLHDG('Flag 01 ............')
     A            FS0FL020       2          COLHDG('Flag 02 ............')
     A            FS0FL030       2          COLHDG('Flag 03 ............')
     A            FS0FL040       2          COLHDG('Flag 04 ............')
     A            FS0FL050       2          COLHDG('Flag 05 ............')
     A            FS0FL060      10          COLHDG('Flag 06 ............')
     A            FS0FL070      10          COLHDG('Flag 07 ............')
     A            FS0FL080      10          COLHDG('Flag 08 ............')
     A            FS0FL090      10          COLHDG('Flag 09 ............')
     A            FS0FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : PARLISF0                                     *
     *  DESCRIZIONE   : Parametri il nuovo calcolo Listino           *
     *  PREFISSO      : PL0                                          *
     * =============================================================== *
     A            PL0STAT0       1A         COLHDG('Stato ..............')
     A            PL0IMUT0      10A         COLHDG('Immissione utente...')
     A            PL0IMDA0       8  0       COLHDG('Immissione data ....')
     A            PL0IMOR0       6  0       COLHDG('Immissione ora .....')
     A            PL0IMPG0      10A         COLHDG('Immissione programma')
     A            PL0AGUT0      10A         COLHDG('Aggiornamento utente')
     A            PL0AGDA0       8  0       COLHDG('Aggiornamento data..')
     A            PL0AGOR0       6  0       COLHDG('Aggiornamento ora...')
     A            PL0AGPG0      10A         COLHDG('Aggiornamento progr.')
      *
     A            PL0STAB0       2          COLHDG('Stabilimento .......')
     A            PL0VALI0       8S 0       COLHDG('Data validità ......')
     A            PL0CIMB0      12S 4       COLHDG('Costo Imballo ......')
     A            PL0CLAV0      12S 4       COLHDG('Costo Lavorazione ..')
     A            PL0CFAC0      12S 4       COLHDG('Costo Facchinaggio .')
     A            PL0CTRA0      12S 4       COLHDG('Costo Trasporto ....')
     A            PL0CMAR0      12S 4       COLHDG('Costo Margine ......')
     A            PL0CPRO0      12S 4       COLHDG('Costo Provvigioni ..')
      *
     A            PL0CF000      12S 4       COLHDG('Costo Conf. 00 .....')
     A            PL0CF050      12S 4       COLHDG('Costo Conf. 05 .....')
     A            PL0CF100      12S 4       COLHDG('Costo Conf. 10 .....')
     A            PL0CF150      12S 4       COLHDG('Costo Conf. 15 .....')
     A            PL0CF200      12S 4       COLHDG('Costo Conf. 20 .....')
     A            PL0CF250      12S 4       COLHDG('Costo Conf. 25 .....')
     A            PL0CFAA0      12S 4       COLHDG('Costo Conf. aa .....')
     A            PL0CFBB0      12S 4       COLHDG('Costo Conf. bb .....')
     A            PL0CFCC0      12S 4       COLHDG('Costo Conf. cc .....')
     A            PL0CFDD0      12S 4       COLHDG('Costo Conf. dd .....')
      *
     A            PL0SFKU0      12S 4       COLHDG('Costo St.Fisico KU..')
     A            PL0SFKX0      12S 4       COLHDG('Costo St.Fisico KX..')
     A            PL0SFSB0      12S 4       COLHDG('Costo St.Fisico SB..')
     A            PL0SFSX0      12S 4       COLHDG('Costo St.Fisico SX..')
     A            PL0SFFA0      12S 4       COLHDG('Costo St.Fisico FA..')
     A            PL0SFFX0      12S 4       COLHDG('Costo St.Fisico FX..')
     A            PL0SFGR0      12S 4       COLHDG('Costo St.Fisico GR..')
     A            PL0SFFI0      12S 4       COLHDG('Costo St.Fisico FI..')
     A            PL0SFAA0      12S 4       COLHDG('Costo St.Fisico aa..')
     A            PL0SFBB0      12S 4       COLHDG('Costo St.Fisico bb..')
     A            PL0SFCC0      12S 4       COLHDG('Costo St.Fisico cc..')
     A            PL0SFDD0      12S 4       COLHDG('Costo St.Fisico dd..')
      *
     A            PL0FL010       2          COLHDG('Flag 01 ............')
     A            PL0FL020       2          COLHDG('Flag 02 ............')
     A            PL0FL030       2          COLHDG('Flag 03 ............')
     A            PL0FL040       2          COLHDG('Flag 04 ............')
     A            PL0FL050       2          COLHDG('Flag 05 ............')
     A            PL0FL060      10          COLHDG('Flag 06 ............')
     A            PL0FL070      10          COLHDG('Flag 07 ............')
     A            PL0FL080      10          COLHDG('Flag 08 ............')
     A            PL0FL090      10          COLHDG('Flag 09 ............')
     A            PL0FL100      10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : FATVITF0                                     *
     *  DESCRIZIONE   : Trasportatore / Nr viaggii                   *
     *  PREFISSO      : TR04                                         *
     * =============================================================== *
     A            TR04STAT0      1A         COLHDG('Stato ..............')
     A            TR04IMUT0     10A         COLHDG('Immissione utente...')
     A            TR04IMDA0      8  0       COLHDG('Immissione data ....')
     A            TR04IMOR0      6  0       COLHDG('Immissione ora .....')
     A            TR04IMPG0     10A         COLHDG('Immissione programma')
     A            TR04IMAZ0     10A         COLHDG('Immissione azione...')
     A            TR04AGUT0     10A         COLHDG('Aggiornamento utente')
     A            TR04AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            TR04AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            TR04AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            TR04AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            TR04SOCI0      2A         COLHDG('Società ............')
      *
     A            TR04MAGA0      2          COLHDG('Stabilimento .......')
     A            TR04FORN0      6          COLHDG('Fornitore trasport..')
     A            TR04NDOC0      9  0       COLHDG('Nr Documento fitt. .')
     A            TR04DDOC0      8  0       COLHDG('Dt Documento fitt. .')
     A            TR04DTIN0      8  0       COLHDG('Data Inizio periodo.')
     A            TR04DTFI0      8  0       COLHDG('Data Fine   periodo.')
     A            TR04IMPO0     12  2       COLHDG('Importo ............')
     A            TR04DINV0      8  0       COLHDG('Data invio mail ....')
     A            TR04OINV0      6  0       COLHDG('Ora  invio mail ....')
     A            TR04UINV0     10          COLHDG('Ute. invio mail.....')
      *
     A            TR04FL010      2          COLHDG('Flag 01 ............')
     A            TR04FL020      2          COLHDG('Flag 02 ............')
     A            TR04FL030      2          COLHDG('Flag 03 ............')
     A            TR04FL040      2          COLHDG('Flag 04 ............')
     A            TR04FL050      2          COLHDG('Flag 05 ............')
     A            TR04FL060     10          COLHDG('Flag 06 ............')
     A            TR04FL070     10          COLHDG('Flag 07 ............')
     A            TR04FL080     10          COLHDG('Flag 08 ............')
     A            TR04FL090     10          COLHDG('Flag 09 ............')
     A            TR04FL100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : TAMISEF0                                     *
     *  DESCRIZIONE   : Tariffe mise per gasolio                     *
     *  PREFISSO      : TM00                                         *
     * =============================================================== *
     A            TM00STAT0      1A         COLHDG('Stato ..............')
     A            TM00IMUT0     10A         COLHDG('Immissione utente...')
     A            TM00IMDA0      8  0       COLHDG('Immissione data ....')
     A            TM00IMOR0      6  0       COLHDG('Immissione ora .....')
     A            TM00IMPG0     10A         COLHDG('Immissione programma')
     A            TM00IMAZ0     10A         COLHDG('Immissione azione...')
     A            TM00AGUT0     10A         COLHDG('Aggiornamento utente')
     A            TM00AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            TM00AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            TM00AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            TM00AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            TM00SOCI0      2A         COLHDG('Società ............')
      *
     A            TM00VALI0      8  0       COLHDG('Data validità ......')
     A            TM00PRE10      9  4       COLHDG('Prezzo gasolio .....')
     A            TM00PRE20      9  4       COLHDG('Prezzo benzina .....')
     A            TM00PRE30      9  4       COLHDG('Prezzo .............')
      *
     A            TM00FL010      2          COLHDG('Flag 01 ............')
     A            TM00FL020      2          COLHDG('Flag 02 ............')
     A            TM00FL030      2          COLHDG('Flag 03 ............')
     A            TM00FL040      2          COLHDG('Flag 04 ............')
     A            TM00FL050      2          COLHDG('Flag 05 ............')
     A            TM00FL060     10          COLHDG('Flag 06 ............')
     A            TM00FL070     10          COLHDG('Flag 07 ............')
     A            TM00FL080     10          COLHDG('Flag 08 ............')
     A            TM00FL090     10          COLHDG('Flag 09 ............')
     A            TM00FL100     10          COLHDG('Flag 10 ............')
     * =============================================================== *
     *  ARCHIVIO      : RUBALTF0                                     *
     *  DESCRIZIONE   : Tariffe mise per gasolio                     *
     *  PREFISSO      : TM00                                         *
     * =============================================================== *
     A            RA00STAT0      1A         COLHDG('Stato ..............')
     A            RA00IMUT0     10A         COLHDG('Immissione utente...')
     A            RA00IMDA0      8  0       COLHDG('Immissione data ....')
     A            RA00IMOR0      6  0       COLHDG('Immissione ora .....')
     A            RA00IMPG0     10A         COLHDG('Immissione programma')
     A            RA00IMAZ0     10A         COLHDG('Immissione azione...')
     A            RA00AGUT0     10A         COLHDG('Aggiornamento utente')
     A            RA00AGDA0      8  0       COLHDG('Aggiornamento data..')
     A            RA00AGOR0      6  0       COLHDG('Aggiornamento ora...')
     A            RA00AGPG0     10A         COLHDG('Aggiornamento progr.')
     A            RA00AGAZ0     10A         COLHDG('Aggiornamento azione')
     A            RA00SOCI0      2A         COLHDG('Società ............')
     A            RA00TIPO0      1          COLHDG('Tipo Codice ........')
     A            RA00CODI0     10          COLHDG('Codice Utente ......')
     A            RA00INDI0    100          COLHDG('Indirizzo mail .....')
     A            RA00FL010      2          COLHDG('Flag 01 ............')
     A            RA00FL020      2          COLHDG('Flag 02 ............')
     A            RA00FL030     10          COLHDG('Flag 06 ............')
     A            RA00FL040     10          COLHDG('Flag 07 ............')
