     A** DIZVPM
     A**
     A** EDTCDE(Z) - SENZA ","   SENZA "+/-"
     A** EDTCDE(4) - CON ","   SENZA "+/-"
     A** EDTCDE(M) - CON ","   CON "+/-"   SENZA SALDO 0
     A** EDTCDE(L) - CON ","   CON "+/-"   CON SALDO 0
     A**
     A** DE - DESCRIZIONE
     A** DA - DATA
     A** NR - NUMERO
     A** QT - QUANTITA'
     A** FL - FLAG
     A** ST - STATO AVANZAMENTO
     A** RB - INIZIO NOME CAMPI PRESENTAZIONE RIC.BANCARIA ELETTRONICA
     A**
     A**
     A** N° prog.campo AZIONE/ANNULL UTILIZZATI:
     A** 001 002 003 004 005 006 007 008 009 010 011 012 013 014 015
     A** 016 017 018 019 020 021 022 023 024 025 026 027 028 029 030
     A** 031 032 033 034 035 036 037 038 039 040 041 042 043 044 045
     A** 046 047 048 049 050 051     052=STIVE00F  053=SCART00F
     A** 054=ANCER00F  055=CERCO00F  056=LOCDE00F  057=TRAEC00F
     A** 058=TBCAP00F  059=TBPAR00F  060=ANBAS00F  061=
     A** 062=SPECI00F  063=LOGPR00F  064=CAPMA00F
     A** 065=EVENT00F  066=RONDA00F  067=WCERCO0F  068=CAR1000F
     A** 069=VARPA00F  070=ANAPT00F  071=TBRCT00F  072=CARFO00F
     A** 073=MOVMA00F  074=CAPQU00F  075=CALSE00F  076=LOGVPM0F
     A** 077=DICCO00F  078=ORDSA00F  079=RCACQ00F  080=RCACQ01F
     A** 081=ORSTA00F  082=ANINT00F  083=EMAIL00F  084=RUBRI00F
     A** 085=MWMSE00F  086=VALCL00F  087=ORBOZ00F  088=CLIPO00F
     A** 089=CONTO00F  090=BUDGE00F  091=DEPOS00F  092=TBFER00F
     A** 093=CLIBU00F  094=FPROD00F  095=FPRO200F
     A** 096=PREVE00F P2 (NUOVI CAMPI MODIFICA MARZO 2009)
     A** 097=PROTO00F  098=BARRE00F  099=ARTDE00F  100=PALCL00F
     A** 101=CCACA00F  102=ARTFO00F  103=ANAPM00F  104=SARMAT0F
     A** 105=CONMA00F  106=VIAG200F  107=INVMA00F  108=CCSAC00F
     A** 109=SARQT00F  110=CONCL00F  111=WWWNST0F  112=WWWNSV0F
     A** 113=WWWNSD0F  114=WWWTVO0F  115=WWWTMO0F  116=WWWTMA0F
     A** 117=WWWDIP0F  118=WWWNSA0F  119=WWWNSS0F  120=WWWPRO0F
     A** 121=TBCDC00F  122=MOENT00F  123=MOEND00F  124=TBENE00F
     A** 125=SARPRO0F  126=CALAN00F  127=ORGSE00F  128=ORGME00F
     A** 129=CGVAGO0F  130=WWWNSC0F  131=TBSCO00F
     A** 132=INVEM00F IVM     133=WWWTCC0F WW33
     A** 134=WWWTPA0F WW34    135=INVEP00F IVP
     A** 136=INVOL00F IVO     137=UTEHD00F
     A** 138=PRIVA00F PRV     139=SARCO00F SAC
     A** 140=TBKEY00F         141=SABRI00F SA1
     A** 142=SABMO00F SA2     143=SABCO00F SA3
     A** 144=SARVT00F SVT     145=SARVR00F SVR
     A** 146=TBTAO00F TA      147=SARGRU0F SAR
     A** 148=CANTI00F CA      149=CONCA00F CO
     A** 150=INVPA00F IP      151=PRECA00F PCA
     A** 152=ANAP200F A2      153=RIGH300F R3
     A** 154=PANTO00F PANT    155=TPCOS00F TS
     A** 156=TCCON00F         157=TBSAC00F TBSAC
     A** 158=ANTAG00F ATG     159=SABLO00F SA4 (+ WSABLO0F)
     A** 160=MOVPE00F MVP     161=ANCEM00F ACM
     A** 162=BTANA00F BTA (B_TRADE)
     A** 163=BTORD00F BTO (B_TRADE)
     A** 164=BTGRU00F BTG (B_TRADE)
     A** 165=BTVAL00F BTV (B_TRADE)
     A** 166=ARTLU00F ALU (B_TRADE)
     A** 167=BTMOV00F BTM (B_TRADE)
     A** 168=CTORT00F COT (CARTA) TESTATE ORDINI
     A** 169=CTORR00F COR (CARTA) RIGHE ORDINI
     A** 170=PROIMP0F PRI PRODUZIONE SCATOLIFICIO PER IMP.STAMPA
     A** 171=PROIMP0T PRT PRODUZ.SCATOLIF. TOTALIZZATA PER IMP.STAMPA
     A** 172=SABINV0F/SABDDT0F/SABPIA0F  SA4 PALLET P.F. DA BARCODE
     A** 173=BTCON00F BTC (B_TRADE)
     A** 174=SALEN00F
     A** 175=TPONE00F 176=TPCAL00F 177=SARCA00F
     A** 178=CERAG00F 179=CERAU00F
     A** 180=WWWTIN0F
     A** 181=FOREX00F
     A** 182=SALPA00F
     A** 183=BUDVE00F
     A** 184=BUDPR00F
     A** 185=LOGCL00F
     A** 186=VIANO00F (NOTE FILE VIAGG00F)
     A** 187=SABBO00F
     A** 188=OFFER00F
     A** 189=TRAEP00F
     A** 190=AXENT00F 191=AXCAU00F 192=AXCON00F 193=ZXXMCO00F
     A** 191=SARVA00F
     A** 194=LISCA00F (PREZZI LISTINO SCATOLIFICI)
     A** 195=TBPA200F
     A** 196=BUOPA00F (BUONI RIENTRO PALLET SENZA DDT)
     A** 197=LIIND00F (LISTINO INDUSTRIA)
     A** 198=CONAP00F (CONTI PARTICOLARI)
     A** 199=ORFOR00F (RIGHE ORDINI FORNITORI VPM)
     A** 200=DISSI00F (DISPOSIZIONI SIMULATE X APPROVVIG. CARTE)
     A** 201=LINOT00F (NOTE X LISTINI INDUSTRIA/ORTOFRUTTA)
     A** 202=LIIND00S (STORICO LISTINI INDUSTRIA/ORTOFRUTTA)
     A** 203=WWWSACIF (DDT EMESSI A CLIENTE SACI)
     A** 204=CARPR00F (ANAGRAFICO CARTE PREVENTIVO A FORNITORE)
     A** 205=BTSKE00F (MOVIMENTAZIONI ARTICOLI CLIENTI B-TRADE)
     A** 206=LICFO00F (LISTINO PREZZI CARTE FORNITORE)
     A** 207=WWWARI0F (PRELIEVI ARISTON DA FATTURARE)
     A** 208=BTLOG00F (LOG VARIAZIONE PRELIEVO COMPONENTI B-TRADE)
     A** 209=BTPRO00F (MOVIMENTI PRODUZIONE P.F. B-TRADE)
     A** 210=PRINT00F (BOLLATO PERSONALE ESTERNO/INTERINALE)
     A** 211=BTSKT00F (SCHEDA TECNICA ARTICOLI P.F. B-TRADE)
     A** 212=LOGVA00F (LOG VARIAZIONE QTÀ ORDINI DI PRODUZIONE)
     A** 213=LOGUT00F (LOG ATTIVITA' UFF.TECNICO - ARTICOLI)
     A** 214=TBPSW00F (TABELLA COMPILATORI DDT)
     A** 215=BOLUT00F (LOG COMPILATORI DDT P.F.)
     A** 216=CALE00FF (CALENDARIO PRODUZIONE X SIMULAZIONI)
     A** 217=SDURC00F (SCADENZARIO DURC FORNITORI)
     A** 218=ANPAR00F (ARTICOLI PARTICOLARI - EMISSIONE DDT)
     A**
     A** Valori campo FLORCH:  blank - NORMALE ATTIVO
     A** (LAVOR)               0     - RICH. ANNULL. DA SPEDIZIONI
     A**                       1     - RICH. ANNULL. AUTOMATICO
     A**                       2     - RICH. ANNULL. MANUALE
     A**                       3     - RICH. ANNULL. TOTALE
     A**
     A** (RIGHE)               0     - ORDINE CHIUSO DA SPEDIZ.(PROC.MAG.)
     A**                       2     - ORDINE A RICHIESTA SALDATO
     A**                       3     - ORDINE ANNULLATO
     A**
     A** Valori campo STLAVO:  blank - record ancora su RIGHE
     A** (LAVOR)               0     - STAMPATO
     A**                       1     - ABBINATO
     A**                       2     - PRODOTTO CARTONE
     A**                       3     - INIZIATA LAVORAZIONE
     A**                       4     - A MAGAZZINO (prod. ultima macc.)
     A**                       5     - INIZIATA SPEDIZIONE
     A**                       6     -
     A**                       7     -
     A**                       8     -
     A**                       9     - ARCHIVIATO
     A** (RIGHE)
     A**                       9     - ARCHIVIATO
     A**
     A** Valori campo STORDI:  0 - REC.IMMESSO DA CONTROLL.(non attivo)
     A** (TESTA)               1 - REC.SENZA ERRORI (direttam.da vn01r)
     A**                       2 - FINITE FASI POST IMMISSIONE
     A**                           (da vn05r carico scheda)
     A**                       9 - ARCHIVIATO
     A**
     A** Valori campo CAUSKE:  C - CARICO da Esplosione VN05R
     A** (SCHED)               S - SCARICO da Stampa bolla BL04R
     A**                                   da Immiss.bolle manuali FT01R
     A**                       T - RESO da cliente
     A**                       R - TRASFERITO ad altro articolo/cliente
     A**                           (non influisce sul Saldo)
     A**                       P - VARIAZIONE IN + alla spedizione PR14R
     A**                       M - VARIAZIONE IN - alla spedizione PR14R
     A**
     A** Valori campo STABBI: ' '- ABBINAMENTO IN PORTAFOGLIO
     A** (TESPI)               1 - ABBINAMENTO IN SEQUENZA X INVIO
     A**                       2 - ABBINAMENTO IN LAVORAZIONE
     A**                       3 - ABBINAMENTO LAVORATO ARCHIV. SU RIGPS
     A**
     A** Valori campo FLRILE: ' '- PREZZO DA CALCOLARE (DOPO IMMISSIONE)
     A** (RIGHE)               Y - RICH.: ORD. CON Q.TA' 0, FLPRZC=R
     A**                           DEF.: CREATO DA TRASFERIM, SI SU PREZZI
     A**                           MA CON VALORI CALCOLATI SU ORD.A RICH.
     A**                       N - X DEFINITI CON Y DOPO ADD SU PREZZ00F
     A**                           X RICHIEST CON Y DOPO ADD SU PREZZ00F
     A**                       C - ORDINI CON ' ' DOPO ADD SU PREZZ00F
     A**                       T - X DEFINITI TRASFERITI CON PREZZO CREATO
     A**                           SU ORDINE A RICHIESTA
     A**                       R - X DEFINITI EVOLUZIONE DA T
     A**
     A** Valori campo FLPRZC: ' '- CREATO DA O/L CON CAUSALE "01"
     A** (PREZZ)               S - CREATO DA O/L CON CAUSALE "04"
     A**                       P - CREATO DA O/L CON CAUSALE "94"
     A**                       R - CREATO DA O/L A RICHIESTA CON Q.TA'=0
     A**                           (V.A. LO CALCOLERA' SU DEFINITI TRASF.)
     A**                       T - CREATO DA TRASF.DA RICH. CON Q.TA'>0
     A**                           (V.A. CALCOLATO SU RICHIESTA) CAUS.NO 04
     A**                       U - CREATO DA TRASF.DA RICH. CON Q.TA'>0
     A**                           (V.A. CALCOLATO SU RICHIESTA) CAUSALE 04
     A**
     A** Campo RASC2 (35) da Ancli (VECCHIO AS)
     A**       pos.  1 - 22 A DISPOSIZIONE
     A**        "   23 - 24 Q.TA' PER TIPO DI CERTIFICATO                 )
     A**        "   25 - 25 TIPO CERTIFICATO DI COLLAUDO (O,A,P)          )
     A**        "   26 - 35 RESPONSABILE DEL CLIENTE
     A**
     A**
     A          R FMTVPM                    TEXT('DIZIONARIO APPLICAZIONE VPM')
     A*
     A            AALVIN         5  2       TEXT('AGGIUNTIVO X PZ. INT. ALVEARE-
     A                                      ')
     A                                      COLHDG('AALV')
     A                                      EDTCDE(4)
     A            ABBIST         1          TEXT('STAMPA ABBINAMENTO')
     A                                      COLHDG('ST.' 'ABB')
     A                                      VALUES(' ' 'Y')
     A            ACORIN         5  2       TEXT('AGGIUNTIVO X PZ. INT. CORDONA-
     A                                      TURA')
     A                                      COLHDG('ACOR')
     A                                      EDTCDE(4)
     A            ALFIFS         5  0       TEXT('AGGIUNTIVO LIMITE FIANCATA')
     A                                      COLHDG('ALFI')
     A                                      EDTCDE(4)
     A            AFI1FS         5  2       TEXT('AGGIUNTIVO 1 X PZ. FIANCATA')
     A                                      COLHDG('AFI1')
     A                                      EDTCDE(4)
     A            AFI2FS         5  2       TEXT('AGGIUNTIVO 2 X PZ. FIANCATA')
     A                                      COLHDG('AFI2')
     A                                      EDTCDE(4)
     A            ALTABB         5  0       TEXT('ALTEZZA ABBINAMENTO')
     A                                      COLHDG('ALT.' 'ABB.')
     A                                      EDTCDE(4)
     A            ALVEAR         1          TEXT('TIPO INTERNO')
     A                                      COLHDG('TIPO' 'INT.')
     A**                                    VALUES('S' 'M' 'C' 'F' 'T')
     A            ALVSER         1  0       TEXT('SERIE ALVEARE')
     A                                      COLHDG('SERIE' 'ALV.')
     A            ALVSEQ         1  0       TEXT('SEQUENZA ALV.')
     A                                      COLHDG('SEQ.' 'ALV.')
     A            ALTEZZ         4  0       TEXT('ALTEZZA CARTA')
     A                                      COLHDG('ALTEZZA')
     A                                      EDTCDE(M)
     A            AMININ         5  2       TEXT('AGGIUNTIVO X PZ. INT. < MQ. 0-
     A                                      ,500')
     A                                      COLHDG('AMIN')
     A                                      EDTCDE(4)
     A            AMAXIN         5  2       TEXT('AGGIUNTIVO X PZ. INT. > MQ. 0-
     A                                      ,500')
     A                                      COLHDG('AMAX')
     A                                      EDTCDE(4)
     A            ANNABB         4  0       TEXT('ANNO ABBINAMENTO')
     A                                      COLHDG('ANNO' 'ABB.')
     A                                      EDTCDE(Z)
     A            ANNLAV         4  0       TEXT('ANNO ORDINE DI LAVORO')
     A                                      COLHDG('ANNO')
     A                                      EDTCDE(Z)
     A            AACER          4  0       TEXT('ANNO CERTIF.COLLAUDO')
     A                                      COLHDG('ANNO')
     A                                      EDTCDE(Z)
     A            NRCER          5  0       TEXT('N° CERTIF.COLLAUDO')
     A                                      COLHDG('N.CERT.')
     A                                      EDTCDE(Z)
     A            NRMICF         3  0       TEXT('N° MICROFERMI')
     A                                      COLHDG('N.MICR.')
     A                                      EDTCDE(Z)
     A            TEMICF         4  0       TEXT('SECONDI MICROFERMI')
     A                                      COLHDG('SEC.MIC.')
     A                                      EDTCDE(Z)
     A            NRFILE         2  0       TEXT('N° FILE USCITA CART')
     A                                      COLHDG('N.FILE')
     A                                      EDTCDE(Z)
     A            ANNSTA         4  0       TEXT('ANNO REALIZZ.STAMPI')
     A                                      COLHDG('ANNO')
     A                                      EDTCDE(Z)
     A            ANNGEN         4  0       TEXT('ANNO DI PROVENIENZA')
     A                                      COLHDG('ANNO' 'PROV')
     A                                      EDTCDE(Z)
     A            ANNCON         4  0       TEXT('ANNO DEL CONSUMO')
     A                                      COLHDG('ANNO')
     A                                      EDTCDE(Z)
     A            ANNFAT         4  0       TEXT('ANNO DEL FATTURATO')
     A                                      COLHDG('ANNO')
     A                                      EDTCDE(Z)
     A            ANNULL         1          TEXT('ATTIVITA''/ANNULLAMENTO')
     A                                      COLHDG('ATT' 'ANN')
     A                                      VALUES(' ' 'A')
     A            AVSSAM         7  0       TEXT('AVVIAMENTO LIT. X ORD. SENZA -
     A                                      STAMPO')
     A                                      COLHDG('AVSS')
     A                                      EDTCDE(Z)
     A            AV1CAM         7  0       TEXT('AVVIAMENTO LIT. X ORD. 1 COLO-
     A                                      RE')
     A                                      COLHDG('AV1C')
     A                                      EDTCDE(Z)
     A            AV2CAM         7  0       TEXT('AVVIAMENTO LIT. X ORD. 2 COLO-
     A                                      RI')
     A                                      COLHDG('AV2C')
     A                                      EDTCDE(Z)
     A            AVSSFU         7  0       TEXT('AVVIAMENTO LIT. X ORD. SENZA -
     A                                      STAMPO')
     A                                      COLHDG('AVSS')
     A                                      EDTCDE(Z)
     A            AV1CFU         7  0       TEXT('AVVIAMENTO LIT. X ORD. 1 COLO-
     A                                      RE')
     A                                      COLHDG('AV1C')
     A                                      EDTCDE(Z)
     A            AV2CFU         7  0       TEXT('AVVIAMENTO LIT. X ORD. 2 COLO-
     A                                      RI')
     A                                      COLHDG('AV2C')
     A                                      EDTCDE(Z)
     A            AGF1FU         5  0       TEXT('AGGIUNTIVO 1 X PZ. FUSTELLA')
     A                                      COLHDG('AGF1')
     A                                      EDTCDE(Z)
     A            AGF2FU         5  0       TEXT('AGGIUNTIVO 2 X PZ. FUSTELLA')
     A                                      COLHDG('AGF2')
     A                                      EDTCDE(Z)
     A            AGF3FU         5  0       TEXT('AGGIUNTIVO 3 X PZ. FUSTELLA')
     A                                      COLHDG('AGF3')
     A                                      EDTCDE(Z)
     A            AGF4FU         5  0       TEXT('AGGIUNTIVO 4 X PZ. FUSTELLA')
     A                                      COLHDG('AGF4')
     A                                      EDTCDE(Z)
     A            AGF5FU         5  0       TEXT('AGGIUNTIVO 5 X PZ. FUSTELLA')
     A                                      COLHDG('AGF5')
     A                                      EDTCDE(Z)
     A            AGF6FU         5  0       TEXT('AGGIUNTIVO 6 X PZ. FUSTELLA')
     A                                      COLHDG('AGF6')
     A                                      EDTCDE(Z)
     A            ANAP12        12          TEXT('STRINGA A DISPOSIZ.')
     A                                      COLHDG('STRINGA')
     A            LIST12        12          TEXT('STRINGA A DISPOSIZ.')
     A                                      COLHDG('STRINGA')
     A            CDMACC         2          TEXT('CODICE MACCHINA')
     A                                      COLHDG('COD' 'MACC')
     A            CUCIAM         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. CUCITO-
     A                                      ')
     A                                      COLHDG('CUCI')
     A                                      EDTCDE(4)
     A            ARSTA1         5  0       TEXT('1° ARCHIVIO STAMPA')
     A                                      COLHDG('1à' 'STAMPA')
     A                                      EDTCDE(Z)
     A            ARSTA2         5  0       TEXT('2° ARCHIVIO STAMPA')
     A                                      COLHDG('2à' 'STAMPA')
     A                                      EDTCDE(Z)
     A            ARSTA3         5  0       TEXT('3° ARCHIVIO STAMPA')
     A                                      COLHDG('3à' 'STAMPA')
     A                                      EDTCDE(Z)
     A            ARSTA4         5  0       TEXT('4° ARCHIVIO STAMPA')
     A                                      COLHDG('4à' 'STAMPA')
     A                                      EDTCDE(Z)
     A            ARFUS1         5  0       TEXT('1° ARCHIVIO FUSTELLE')
     A                                      COLHDG('1à' 'FUST.')
     A                                      EDTCDE(Z)
     A            ARFUS2         5  0       TEXT('2° ARCHIVIO FUSTELLE')
     A                                      COLHDG('2à' 'FUST.')
     A                                      EDTCDE(Z)
     A            AUTTRA        13          TEXT('AUTORAZZAZIONE TRASP. ')
     A                                      COLHDG('AUT')
     A            AZIONE    R               REFFLD(NRAZI DIZACGV3)
     A            BOBINI         5  0       TEXT('N° BOBINE GIAC.INIZIALE')
     A                                      COLHDG('BOB.' 'INIZ.')
     A                                      EDTCDE(L)
     A            BOBACQ         5  0       TEXT('N° BOBINE ACQUISTATE')
     A                                      COLHDG('BOB.' 'ACQ.')
     A                                      EDTCDE(4)
     A            BOBVEN         5  0       TEXT('N° BOBINE VENDUTE')
     A                                      COLHDG('BOB.' 'VEN.')
     A                                      EDTCDE(4)
     A            BOBDIF         5  0       TEXT('N° BOBINE DIFETTOSE')
     A                                      COLHDG('BOB.' 'DIF.')
     A                                      EDTCDE(4)
     A            BOBRES         5  0       TEXT('N° BOBINE RESE A FORN.')
     A                                      COLHDG('BOB.' 'RES.')
     A                                      EDTCDE(4)
     A            BOBFIN         5  0       TEXT('N° BOBINE GIAC.FINALE'  )
     A                                      COLHDG('BOB.' 'FINE')
     A                                      EDTCDE(L)
     A            CAESE     R               REFFLD(CAESE DIZACGV3)
     A            CASPET         2          TEXT('ASPETTO ESTERIORE BENI')
     A                                      COLHDG('ASP')
     A            CAPDES         9          TEXT('C.A.P. DESTINATARIO')
     A                                      COLHDG('C.A.P.')
     A            CARSCA         1          TEXT('CARICO/SCARICO')
     A                                      COLHDG('CAR' 'SCA')
     A            CAUORD         2          TEXT('CAUSALE GESTIONE ORD/PRO')
     A                                      COLHDG('CAUS')
     A            CAUPA1         1          TEXT('CAUSALE PALLET 1')
     A                                      COLHDG('CAU.' 'PAL1')
     A            CAUPA2         1          TEXT('CAUSALE PALLET 2')
     A                                      COLHDG('CAU.' 'PAL2')
     A            CAUPA3         1          TEXT('CAUSALE PALLET 3')
     A                                      COLHDG('CAU.' 'PAL3')
     A            CAUPA4         1          TEXT('CAUSALE PALLET 4')
     A                                      COLHDG('CAU.' 'PAL4')
     A            CAUPA5         1          TEXT('CAUSALE PALLET 5')
     A                                      COLHDG('CAU.' 'PAL5')
     A            CAUPA6         1          TEXT('CAUSALE PALLET 6')
     A                                      COLHDG('CAU.' 'PAL6')
     A            CAUPA7         1          TEXT('CAUSALE PALLET 7')
     A                                      COLHDG('CAU.' 'PAL7')
     A            CAUPA8         1          TEXT('CAUSALE PALLET 8')
     A                                      COLHDG('CAU.' 'PAL8')
     A            CAUPA9         1          TEXT('CAUSALE PALLET 9')
     A                                      COLHDG('CAU.' 'PAL9')
     A            CAUP10         1          TEXT('CAUSALE PALLET 10')
     A                                      COLHDG('CAU.' 'PAL10')
     A            CDFERM         3          TEXT('CODICE DEL FERMO')
     A                                      COLHDG('COD' 'FERMO')
     A            CDPRFE         2          TEXT('COD.PROGR. FERMO')
     A                                      COLHDG('PROG.' 'FERMO')
     A            CDPALL         3          TEXT('CODICE PALLET')
     A                                      COLHDG('COD.' 'PAL')
     A            CDCPAL         3          TEXT('CODICE COPRIPALLET')
     A                                      COLHDG('COD.' 'C.P.')
     A            CDPAL1         3          TEXT('CODICE PALLET 1')
     A                                      COLHDG('COD.' 'PAL1')
     A            CDPAL2         3          TEXT('CODICE PALLET 2')
     A                                      COLHDG('COD.' 'PAL2')
     A            CDPAL3         3          TEXT('CODICE PALLET 3')
     A                                      COLHDG('COD.' 'PAL3')
     A            CDPAL4         3          TEXT('CODICE PALLET 4')
     A                                      COLHDG('COD.' 'PAL4')
     A            CDPAL5         3          TEXT('CODICE PALLET 5')
     A                                      COLHDG('COD.' 'PAL5')
     A            CDPAL6         3          TEXT('CODICE PALLET 6')
     A                                      COLHDG('COD.' 'PAL6')
     A            CDPAL7         3          TEXT('CODICE PALLET 7')
     A                                      COLHDG('COD.' 'PAL7')
     A            CDPAL8         3          TEXT('CODICE PALLET 8')
     A                                      COLHDG('COD.' 'PAL8')
     A            CDPAL9         3          TEXT('CODICE PALLET 9')
     A                                      COLHDG('COD.' 'PAL9')
     A            CDPA10         3          TEXT('CODICE PALLET 10')
     A                                      COLHDG('COD.' 'PAL10')
     A            CUCIFU         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. CUCITO-
     A                                      ')
     A                                      COLHDG('CUCI')
     A                                      EDTCDE(4)
     A            CLIPRO         6          TEXT('COD.CLIENTE ANAPR00F')
     A                                      COLHDG('COD' 'ANAPRO')
     A            CALSVI         1          TEXT('CALCOLO SVILUPPO')
     A                                      COLHDG('CALC.' 'SVIL')
     A**                                    VALUES('Y' 'N' 'C')
     A            CAUPAL         1          TEXT('CAUSALE PALLET')
     A                                      COLHDG('CAU.' 'PALLET')
     A            CAUSKE         1          TEXT('CAUSALE SCHEDA')
     A                                      COLHDG('CAU' 'SKE')
     A**                                    VALUES('C' 'S' 'T' 'R' 'M' 'P')
     A            CCLDIV    R               REFFLD(CDCLI DIZACGV3)
     A                                      TEXT('CODICE CLIENTE DIVERSO')
     A                                      COLHDG('CLI' 'DIV')
     A            CLFDIV         1          TEXT('FLAG CLIENTE/FORNITORE DIVERS-
     A                                      O')
     A                                      COLHDG('CL/FO' 'DIV')
     A            CLISV1         5  2       TEXT('COPERTINA 1 LISTINO VECCHIO')
     A                                      COLHDG('C. 1' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV2         5  2       TEXT('COPERTINA 2 LISTINO VECCHIO')
     A                                      COLHDG('C. 2' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV3         5  2       TEXT('COPERTINA 3 LISTINO VECCHIO')
     A                                      COLHDG('C. 3' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV4         5  2       TEXT('COPERTINA 4 LISTINO VECCHIO')
     A                                      COLHDG('C. 4' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV5         5  2       TEXT('COPERTINA 5 LISTINO VECCHIO')
     A                                      COLHDG('C. 5' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV6         5  2       TEXT('COPERTINA 6 LISTINO VECCHIO')
     A                                      COLHDG('C. 6' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV7         5  2       TEXT('COPERTINA 7 LISTINO VECCHIO')
     A                                      COLHDG('C. 7' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV8         5  2       TEXT('COPERTINA 8 LISTINO VECCHIO')
     A                                      COLHDG('C. 8' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISV9         5  2       TEXT('COPERTINA 9 LISTINO VECCHIO')
     A                                      COLHDG('C. 9' 'L.V.')
     A                                      EDTCDE(4)
     A            CLISN1         5  2       TEXT('COPERTINA 1 LISTINO NUOVO')
     A                                      COLHDG('C. 1' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN2         5  2       TEXT('COPERTINA 2 LISTINO NUOVO')
     A                                      COLHDG('C. 2' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN3         5  2       TEXT('COPERTINA 3 LISTINO NUOVO')
     A                                      COLHDG('C. 3' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN4         5  2       TEXT('COPERTINA 4 LISTINO NUOVO')
     A                                      COLHDG('C. 4' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN5         5  2       TEXT('COPERTINA 5 LISTINO NUOVO')
     A                                      COLHDG('C. 5' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN6         5  2       TEXT('COPERTINA 6 LISTINO NUOVO')
     A                                      COLHDG('C. 6' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN7         5  2       TEXT('COPERTINA 7 LISTINO NUOVO')
     A                                      COLHDG('C. 7' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN8         5  2       TEXT('COPERTINA 8 LISTINO NUOVO')
     A                                      COLHDG('C. 8' 'L.N.')
     A                                      EDTCDE(4)
     A            CLISN9         5  2       TEXT('COPERTINA 9 LISTINO NUOVO')
     A                                      COLHDG('C. 9' 'L.N.')
     A                                      EDTCDE(4)
     A            COEPRO         3  2       TEXT('COEFF.ONDULAZ.EFFETT. ONDA')
     A                                      COLHDG('COEFF' 'EFF.')
     A                                      EDTCDE(4)
     A            COELIS         3  2       TEXT('COEFF.ONDULAZ.NOMINALE ONDA')
     A                                      COLHDG('COEFF' 'NOM.')
     A                                      EDTCDE(4)
     A            COEMOL         3  0       TEXT('COEFF.MOLTIPLICATIVO')
     A                                      COLHDG('COEF' 'MOLT')
     A            CODZON         2          TEXT('CODICE ZONA')
     A                                      COLHDG('COD.' 'ZONA')
     A            CODCOL         2          TEXT('CODICE COLORE')
     A                                      COLHDG('COD.' 'COL.')
     A            CODMAG         2          TEXT('CODICE MAG. RIGBO')
     A                                      COLHDG('COD.' 'MAG.')
     A            CODDIT         2          TEXT('CODICE DITTA')
     A                                      COLHDG('COD.' 'DITTA')
     A            CODATT         2          TEXT('CODICE ATTIVITA''')
     A                                      COLHDG('COD.' 'ATT.')
     A            COLCAM         1  0       TEXT('N° COLORI CAMICIA')
     A                                      COLHDG('N°COL.' 'CAMICIA')
     A            COLRIG         3          TEXT('COLORI MERCE RIGA BOLLA')
     A                                      COLHDG('COLORE' 'RIGA')
     A            COLACC         1          TEXT('COLONNA DI ACCUMULO')
     A                                      COLHDG('COL' 'ACC')
     A            CONTCC        12          TEXT('CONTROP. CATEG. CLI.')
     A                                      COLHDG('CONTROPARTITA' 'CATEG. CLI.-
     A                                      ')
     A            COSTBS        11  2       TEXT('COSTO EL.TAB.  ')
     A                                      COLHDG('PREZZO' 'COSTO')
     A                                      EDTCDE(4)
     A            CPORTO         1          TEXT('CODICE PORTO')
     A                                      COLHDG('PORTO')
     A**                                    VALUES('F' 'A')
     A            CRITOR         1          TEXT('RITORNO')
     A                                      COLHDG('RIT')
     A**                                    VALUES('N' 'V')
     A            CTCURA         1          TEXT('TRASPORTO A CURA')
     A                                      COLHDG('CURA')
     A**                                    VALUES('M' 'D' 'V' 'C')
     A            CTARCH         1          TEXT('CONTROLLO ARCHIVI')
     A                                      COLHDG('CTRL' 'ARCH')
     A**                                    VALUES(' ' 'Y')
     A            CTCONS         1          TEXT('TIPO ORDINE')
     A                                      COLHDG('TIPO' 'ORD.')
     A            CAPCL     R               REFFLD(CAPCL DIZACGV3)
     A            CBAAP     R               REFFLD(CBAAP DIZACGV3)
     A            CAGAP     R               REFFLD(CAGAP DIZACGV3)
     A            CDBAN          3
     A            CDAGZ          3
     A            CDAGE     R               REFFLD(CDAGE DIZACGV3)
     A            CDORD     R               REFFLD(CDORD DIZACGV3)
     A            CDMAG     R               REFFLD(CDMAG DIZACGV3)
     A            CCARTA         4          TEXT('CODICE CARTA')
     A                                      COLHDG('COD.' 'CARTA')
     A            CDCLI     R               REFFLD(CDCLI DIZACGV3)
     A            CDFOR     R               REFFLD(CDFOR DIZACGV3)
     A            CLASME         2  0       TEXT('CLASSIFICAZIONE MEZZO')
     A                                      COLHDG('CLASS. MEZZO')
     A                                      EDTCDE(Z)
     A            CLIFOR         1          TEXT('FLAG CLIENTE/FORNITORE')
     A                                      COLHDG('CLI' 'FOR')
     A            CODFAT         2          TEXT('CODICE X INTESTAZ. FATT.')
     A                                      COLHDG('IN.FAT.')
     A            CODLIN         2          TEXT('CODICE LINEA TRASPORTO')
     A                                      COLHDG('LINEA')
     A            CODART        15          TEXT('CODICE ARTICOLO MAGAZZINO')
     A                                      COLHDG('CODICE' 'ARTICOLO')
     A            CODPRO         3  0       TEXT('CODICE PRODOTTO')
     A                                      COLHDG('COD' 'PROD')
     A                                      EDTCDE(Z)
     A            CODRAG         2          TEXT('CODICE RAGGRUPPAMENTO FISCALE-
     A                                      ')
     A                                      COLHDG('RAGGR.')
     A            CODTRA         6          TEXT('CODICE TRASPORTATORE')
     A                                      COLHDG('COD.' 'TRASP.')
     A            CODMEZ         2          TEXT('CODICE MEZZO')
     A                                      COLHDG('COD.' 'MEZZO')
     A            CODTAB         4          TEXT('CODICE CHIAVE TABELLE PRODUZI-
     A                                      NE')
     A                                      COLHDG('CHIAVE' 'TABELLA')
     A            CODTBS         4          TEXT('CODICE CHIAVE TABELLE PRODUZI-
     A                                      NE')
     A                                      COLHDG('CHIAVE' 'TABELLA')
     A            COPAG     R               REFFLD(COPAG DIZACGV3)
     A            CONMER        12          TEXT('CONTROPARTITA MERCE')
     A                                      COLHDG('CONTROPARTITA' 'MERCE')
     A            CTARGA         8          TEXT('TARGA')
     A                                      COLHDG('TARGA')
     A            COLOR1         3          TEXT('1à STAMPA')
     A                                      COLHDG('STA' '1')
     A            COLOR2         3          TEXT('2à STAMPA')
     A                                      COLHDG('STA' '2')
     A            COLOR3         3          TEXT('3à STAMPA')
     A                                      COLHDG('STA' '3')
     A            COLOR4         3          TEXT('4à STAMPA')
     A                                      COLHDG('STA' '4')
     A            COLO11         2          TEXT('1à SCELTA 1° COL.')
     A                                      COLHDG('COL' '11')
     A            COLO12         2          TEXT('1à SCELTA 2° COL.')
     A                                      COLHDG('COL' '12')
     A            COLO13         2          TEXT('1à SCELTA 4° COL.')
     A                                      COLHDG('COL' '14')
     A            COLO14         2          TEXT('1à SCELTA 3° COL.')
     A                                      COLHDG('COL' '13')
     A            COLO21         2          TEXT('2à SCELTA 1° COL.')
     A                                      COLHDG('COL' '21')
     A            COLO22         2          TEXT('2à SCELTA 2° COL.')
     A                                      COLHDG('COL' '22')
     A            COLO23         2          TEXT('2à SCELTA 3° COL.')
     A                                      COLHDG('COL' '23')
     A            COLO24         2          TEXT('2à SCELTA 4° COL.')
     A                                      COLHDG('COL' '24')
     A            COLO31         2          TEXT('3à SCELTA 1° COL.')
     A                                      COLHDG('COL' '31')
     A            COLO32         2          TEXT('3à SCELTA 2° COL.')
     A                                      COLHDG('COL' '32')
     A            COLO33         2          TEXT('3à SCELTA 3° COL.')
     A                                      COLHDG('COL' '33')
     A            COLO34         2          TEXT('3à SCELTA 4° COL.')
     A                                      COLHDG('COL' '34')
     A            COLO41         2          TEXT('4à SCELTA 1° COL.')
     A                                      COLHDG('COL' '41')
     A            COLO42         2          TEXT('4à SCELTA 2° COL.')
     A                                      COLHDG('COL' '42')
     A            COLO43         2          TEXT('4à SCELTA 3° COL.')
     A                                      COLHDG('COL' '43')
     A            COLO44         2          TEXT('4à SCELTA 4° COL.')
     A                                      COLHDG('COL' '44')
     A            CORA11         5  0       TEXT('1à DIMENSIONE CORDONATURA 1')
     A                                      COLHDG('1à' 'CORD.1')
     A                                      EDTCDE(Z)
     A            CORA12         5  0       TEXT('1à DIMENSIONE CORDONATURA 2')
     A                                      COLHDG('1à' 'CORD.2')
     A                                      EDTCDE(Z)
     A            CORA13         5  0       TEXT('1à DIMENSIONE CORDONATURA 3')
     A                                      COLHDG('1à' 'CORD.3')
     A                                      EDTCDE(Z)
     A            CORA14         5  0       TEXT('1à DIMENSIONE CORDONATURA 4')
     A                                      COLHDG('1à' 'CORD.4')
     A                                      EDTCDE(Z)
     A            CORA15         5  0       TEXT('1à DIMENSIONE CORDONATURA 5')
     A                                      COLHDG('1à' 'CORD.5')
     A                                      EDTCDE(Z)
     A            CORA21         5  0       TEXT('2à DIMENSIONE CORDONATURA 1')
     A                                      COLHDG('2à' 'CORD.1')
     A                                      EDTCDE(Z)
     A            CORA22         5  0       TEXT('2à DIMENSIONE CORDONATURA 2')
     A                                      COLHDG('2à' 'CORD.2')
     A                                      EDTCDE(Z)
     A            CORA23         5  0       TEXT('2à DIMENSIONE CORDONATURA 3')
     A                                      COLHDG('2à' 'CORD.3')
     A                                      EDTCDE(Z)
     A            CORA24         5  0       TEXT('2à DIMENSIONE CORDONATURA 4')
     A                                      COLHDG('2à' 'CORD.4')
     A                                      EDTCDE(Z)
     A            CORA25         5  0       TEXT('2à DIMENSIONE CORDONATURA 5')
     A                                      COLHDG('2à' 'CORD.5')
     A                                      EDTCDE(Z)
     A** FILE DICCO00F
     A            COPROT         5  0       TEXT('N° PROTOCOLLO')
     A            CONRDI        10          TEXT('NUMERO DICHIARAZIONE')
     A            CODADI         8  0       TEXT('DATA DICHIARAZIONE')
     A            CODAIN         8  0       TEXT('DATA INIZIO EFFICACIA')
     A            CODAFI         8  0       TEXT('DATA FINE EFFICACIA')
     A            COIMKG        10  0       TEXT('MAX KG ESENZIONE')
     A            COFAKG        10  0       TEXT('TOT KG FATTUR.IN ESENZ')
     A            COFEES         1          TEXT('FLAG MAX. ESENZIONE')
     A            COESEC         5  2       TEXT('% ESENZIONE CONAI')
     A**
     A            BOLPTE         7  0       TEXT('PESO TEORICO BOLLA')
     A                                      COLHDG('PESO' 'TEORICO')
     A            BOLPEF         7  0       TEXT('PESO EFFETTIVO BOLLA')
     A                                      COLHDG('PESO' 'EFFETT.')
     A            BOLORA         6  0       TEXT('ORA STAMPA BOLLA')
     A                                      COLHDG('ORA' 'BOLLA')
     A            DACALE         8  0       TEXT('DATA CALENDARIO')
     A                                      COLHDG('DATA' 'CALEN')
     A                                      EDTCDE(Z)
     A            DACONS         8  0       TEXT('DATA DI CONSEGNA')
     A                                      COLHDG('DATA' 'CONS')
     A                                      EDTCDE(Z)
     A            DACONO         8  0       TEXT('DATA CONSEGNA ORIGINE')
     A                                      COLHDG('DATA' 'ORIG')
     A            DACONF         8  0       TEXT('DATA CONFERMA')
     A                                      COLHDG('DATA' 'CONF.')
     A                                      EDTCDE(Z)
     A            DADICH         8  0       TEXT('DATA DICHIARAZIONE ESENZIONE -
     A                                      IVA')
     A                                      COLHDG('D.ESENZ' 'IVA')
     A                                      EDTCDE(Z)
     A            DADICI         8  0       TEXT('DATA INIZIO DICHIARAZIONE ESE-
     A                                      NZIONE IVA')
     A                                      COLHDG('INIZIO' 'ESENZ.')
     A                                      EDTCDE(Z)
     A            DADICF         8  0       TEXT('DATA FINE DICHIARAZIONE ESENZ-
     A                                      IONE IVA')
     A                                      COLHDG('FINE' 'ESENZ.')
     A                                      EDTCDE(Z)
     A            DAFATT         8  0       TEXT('DATA FATTURA/NOTA')
     A                                      COLHDG('DATA' 'FAT/NOT')
     A                                      EDTCDE(Z)
     A            DAINIP         8  0       TEXT('DATA INIZIO LAVORAZ.PRESUNTA')
     A                                      COLHDG('DATA' 'IN.LAV.')
     A                                      EDTCDE(Z)
     A            DAFINP         8  0       TEXT('DATA FINE LAVORAZ.PRESUNTA')
     A                                      COLHDG('DATA' 'FIN.LAV')
     A                                      EDTCDE(Z)
     A            DAULTL         8  0       TEXT('DATA ULT.LAVORAZ.')
     A                                      COLHDG('DATA' 'ULT.LAV.')
     A                                      EDTCDE(Z)
     A            DAULAV         8  0       TEXT('DATA ULT.LAVORAZ.')
     A                                      COLHDG('DATA' 'ULT.LAV.')
     A                                      EDTCDE(Z)
     A            DALIMR         8  0       TEXT('DATA LIMITE RITIRO')
     A                                      COLHDG('DATA' 'LIM.RIT.')
     A                                      EDTCDE(Z)
     A            DAORDI         8  0       TEXT('DATA IMMISSIONE ORDINE')
     A                                      COLHDG('DATA' 'IMM.ORD.')
     A                                      EDTCDE(Z)
     A            DAPATR         8  0       TEXT('DATA PATRONO')
     A                                      COLHDG('DATA' 'PATRONO')
     A                                      EDTCDE(Z)
     A            DAFIDO         8  0       TEXT('DATA FIDO')
     A                                      COLHDG('DATA' 'FIDO')
     A                                      EDTCDE(Z)
     A            DAPAG1         8  0       TEXT('DATA 1° PAGAMENTO')
     A                                      COLHDG('DATA 1°' 'PAGAM')
     A                                      EDTCDE(Z)
     A            DAPAG2         8  0       TEXT('DATA 2° PAGAMENTO')
     A                                      COLHDG('DATA 2°' 'PAGAM')
     A                                      EDTCDE(Z)
     A            DAPAG3         8  0       TEXT('DATA 3° PAGAMENTO')
     A                                      COLHDG('DATA 3°' 'PAGAM')
     A                                      EDTCDE(Z)
     A            DAPERI         8  0       TEXT('DATA INIZIO PERIODO CONSU')
     A                                      COLHDG('D.INIZ' 'PER.')
     A                                      EDTCDE(Z)
     A            DAPERF         8  0       TEXT('DATA FINE PERIODO CONSU')
     A                                      COLHDG('D.FINE' 'PER.')
     A                                      EDTCDE(Z)
     A            DAPIAN         8  0       TEXT('DATA INIZIO PIANIFICAZ.')
     A                                      COLHDG('D.INIZ' 'PIAN.')
     A                                      EDTCDE(Z)
     A            DABOLL         8  0       TEXT('DATA BOLLA')
     A                                      COLHDG('DATA' 'BOLLA')
     A                                      EDTCDE(Z)
     A            DAINVE         8  0       TEXT('DATA INVENTARIO')
     A                                      COLHDG('DATA' 'INV.')
     A                                      EDTCDE(Z)
     A            DAARRI         8  0       TEXT('DATA ARRIVO TRASP')
     A                                      COLHDG('DATA' 'ARRIVO TRASP')
     A                                      EDTCDE(Z)
     A            DARIFN         8  0       TEXT('DATA RIFERIMENTO PER NOTA')
     A                                      COLHDG('D.RIF.' 'X NOTA')
     A                                      EDTCDE(Z)
     A            DASCAU         8  0       TEXT('DATA SCAD.AUTORIZZ.MEZZO')
     A                                      COLHDG('SCAD.' 'AUT.MEZZO')
     A                                      EDTCDE(Z)
     A            DAULOR         8  0       TEXT('DATA ULTIMO ORDINE')
     A                                      COLHDG('D.ULT' 'ORD.')
     A                                      EDTCDE(Z)
     A            DAVIAG         8  0       TEXT('DATA VIAGGIO')
     A                                      COLHDG('DATA' 'VIAGGIO')
     A                                      EDTCDE(Z)
     A            DEASPE        20          TEXT('DESCRIZIONE ASPETTO ESTERIORE-
     A                                       DEI BENI')
     A                                      COLHDG('ASPETTO DEI BENI')
     A            DEAUTO        20          TEXT('DESCRIZIONE AUTOMEZZO')
     A                                      COLHDG('DESCRIZ.AUTOMEZZO')
     A            DECAUP        40          TEXT('DESCRIZIONE CAUSALE PALLET')
     A                                      COLHDG('DESCR. CAUS. PALLET')
     A            DECAUS        25          TEXT('DESCRIZIONE CAUSALE PRODUZION-
     A                                      E')
     A                                      COLHDG('CAUSALE')
     A            DECOLO        15          TEXT('DESCRIZIONE COLORE')
     A                                      COLHDG('COLORE')
     A            DEGRUM        20          TEXT('DESCRIZIONE GRUPPO MERCEOLOGI-
     A                                      CO')
     A                                      COLHDG('GRUPPO' 'MERCEOLOGICO')
     A            DEPORT        40          TEXT('DESCRIZIONE PORTO')
     A                                      COLHDG('PORTO')
     A            DEMOVI        20          TEXT('DESCRIZIONE TIPO MOVIMENTO')
     A                                      COLHDG('TIPO MOVIMENTO')
     A            DECART        25          TEXT('DESCRIZIONE CARTA')
     A                                      COLHDG('DESCR. CARTA')
     A            DEINTE        20          TEXT('DESCRIZIONE INTERNO')
     A                                      COLHDG('DESCRIZ. INTERNO')
     A            DELINE        20          TEXT('DESCRIZIONE LINEA TRASPORTO')
     A                                      COLHDG('LINEA TRASPORTO')
     A            DEMACC        20          TEXT('DESCRIZIONE MACCHINA')
     A                                      COLHDG('MACCHINA')
     A            DEMODE        20          TEXT('DESCRIZIONE MODELLO')
     A                                      COLHDG('MODELLO')
     A            DERIGA        35          TEXT('DESCRIZIONE PER IMMISSIONE MA-
     A                                      NUALE')
     A                                      COLHDG('DESCRIZIONE X' 'IMM.MANUALE-
     A                                      ')
     A            DECLI1        79          TEXT('DESCRIZIONE CLIDE00F')
     A                                      COLHDG('DES.CLIDE')
     A            DECLI2        79          TEXT('DESCRIZIONE CLIDE00F')
     A                                      COLHDG('DES.CLIDE')
     A            DECLI3        79          TEXT('DESCRIZIONE CLIDE00F')
     A                                      COLHDG('DES.CLIDE')
     A            DESTIN         2          TEXT('CODICE DESTINAZIONE')
     A                                      COLHDG('COD.' 'DEST')
     A            DESTBS        20          TEXT('CAMPO DATI TABELLE')
     A                                      COLHDG('DESCRIZIONE TABELLA')
     A            DETABE       100          TEXT('CAMPO DATI TABELLE')
     A                                      COLHDG('DESCRIZIONE TABELLA')
     A            DETCAR        20          TEXT('DESCRIZIONE TIPO CARTA')
     A                                      COLHDG('DESCRIZIONE' 'TIPO CARTA')
     A            DETIPO        35          TEXT('DESCRIZIONE TIPO PRODOTTO')
     A                                      COLHDG('DESCR.TIPO PROD.')
     A            DEONDA        25          TEXT('DESCRIZIONE ONDA')
     A                                      COLHDG('DESCR.ONDA')
     A            DETMER        20          TEXT('DESCRIZIONE TIPO MERCE')
     A                                      COLHDG('TIPO MERCE')
     A            DETRAS        13          TEXT('DESCRIZIONE TRASPORTATORE')
     A                                      COLHDG('TRASPORTATORE')
     A            DIMEN1         5  0       TEXT('1à DIMENSIONE SCATOLA')
     A                                      COLHDG('1à' 'DIM.')
     A                                      EDTCDE(Z)
     A            DIMEN2         5  0       TEXT('2à DIMENSIONE SCATOLA')
     A                                      COLHDG('2à' 'DIM.')
     A                                      EDTCDE(Z)
     A            DIMEN3         5  0       TEXT('3à DIMENSIONE SCATOLA')
     A                                      COLHDG('3à' 'DIM.')
     A                                      EDTCDE(Z)
     A            DIMFA1         5  0       TEXT('1à DIMENSIONE DA FATTURARE')
     A                                      COLHDG('1à DIM' 'DA FATT')
     A                                      EDTCDE(Z)
     A            DIMFA2         5  0       TEXT('2à DIMENSIONE DA FATTURARE')
     A                                      COLHDG('2à DIM' 'DA FATT')
     A                                      EDTCDE(Z)
     A            DIMFA3         5  0       TEXT('3à DIMENSIONE DA FATTURARE')
     A                                      COLHDG('3à DIM' 'DA FATT')
     A                                      EDTCDE(Z)
     A            DAANNU         8  0       TEXT('DATA ANNULLAMENTO')
     A                                      COLHDG('DATA' 'ANN')
     A            DACOC     R               REFFLD(DACOC2000 DIZACGV3)
     A            DALISV         8  0       TEXT('DATA LISTINO VECCHIO')
     A                                      COLHDG('D.LIST' 'VECCHIO')
     A                                      EDTCDE(Z)
     A            DALISN         8  0       TEXT('DATA LISTINO NUOVO')
     A                                      COLHDG('D.LIST' 'NUOVO')
     A                                      EDTCDE(Z)
     A            DALIST         8  0       TEXT('DATA LISTINO')
     A                                      COLHDG('DATA' 'LISTINO')
     A                                      EDTCDE(Z)
     A            DEANAD        76          TEXT('DESCRIZIONE SUPPLEMENTARE')
     A                                      COLHDG('DESCRIZIONE' 'SUPPLEM.')
     A            DECATC        20          TEXT('DESCRIZIONE CAT.CONT.CL.')
     A                                      COLHDG('CAT.CONT.CL.')
     A            DETINT         7          TEXT('DESCRIZIONE TIPO INTERNO')
     A                                      COLHDG('TIPO' 'INTERNO')
     A            DAPROD         8  0       TEXT('DATA PRODUZIONE')
     A                                      COLHDG('DATA' 'PROD')
     A                                      EDTCDE(Z)
     A            DAPRO          8  0       TEXT('DATA PROD.CERT.')
     A                                      COLHDG('DATA' 'PROD')
     A                                      EDTCDE(Z)
     A            DACER          8  0       TEXT('DATA CREAZ.CERT.')
     A                                      COLHDG('DATA' 'CERT')
     A                                      EDTCDE(Z)
     A            DAULUT         8  0       TEXT('DATA ULTIMO UTILIZZO')
     A                                      COLHDG('D.ULT.' 'UTILIZ')
     A                                      EDTCDE(Z)
     A            DESCO1        11          TEXT('DESCR. 1 SCATOLE CONSERVIERI')
     A                                      COLHDG('DES.1 SCAT' 'CONSERVIERI')
     A            DESCO2        11          TEXT('DESCR. 2 SCATOLE CONSERVIERI')
     A                                      COLHDG('DES.2 SCAT' 'CONSERVIERI')
     A            DESCO3        11          TEXT('DESCR. 3 SCATOLE CONSERVIERI')
     A                                      COLHDG('DES.3 SCAT' 'CONSERVIERI')
     A            DESCO4        11          TEXT('DESCR. 4 SCATOLE CONSERVIERI')
     A                                      COLHDG('DES.4 SCAT' 'CONSERVIERI')
     A            DEERRO        35          TEXT('DESCRIZIONE ERRORE')
     A                                      COLHDG('DESCRIZIONE' 'ERRORE')
     A            DECERT        25          TEXT('DESCRIZ.TIPI CERT.')
     A                                      COLHDG('DESCR.TIPI' 'CERT.QUAL.')
     A            DESTAM        25          TEXT('DESCRIZIONE TIPO STAMPO')
     A                                      COLHDG('DESCR.TIPO STAMPA')
     A            ENCC           3  2       TEXT('ENTE NAZ.LE CELLULOSA E CARTA-
     A                                      ')
     A                                      COLHDG('ENCC')
     A                                      EDTCDE(4)
     A            ESECON         5  2       TEXT('NON USATO EX % ESENZ.CONAI')
     A            ESPCAM        11  0       TEXT('ESPOSIZIONE CAMBIARIA')
     A                                      COLHDG('ESP.CAMB.')
                                            EDTCDE(4)
     A            ESPTOT        11  0       TEXT('ESPOSIZIONE TOTALE')
     A                                      COLHDG('ESP.TOTALE')
                                            EDTCDE(4)
     A            EMIFAT         1          TEXT('EMISSIONE FATTURA O NOTA')
     A                                      COLHDG('EMISS.' 'FAT./NOTA')
     A**                                    VALUES('0' '1' '2')
     A            FATT01        11  0       TEXT('FATTURATO MESE 01')
     A                                      COLHDG('FATT.MESE 01')
                                            EDTCDE(4)
     A            FATT02        11  0       TEXT('FATTURATO MESE 02')
     A                                      COLHDG('FATT.MESE 02')
                                            EDTCDE(4)
     A            FATT03        11  0       TEXT('FATTURATO MESE 03')
     A                                      COLHDG('FATT.MESE 03')
                                            EDTCDE(4)
     A            FATT04        11  0       TEXT('FATTURATO MESE 04')
     A                                      COLHDG('FATT.MESE 04')
                                            EDTCDE(4)
     A            FATT05        11  0       TEXT('FATTURATO MESE 05')
     A                                      COLHDG('FATT.MESE 05')
                                            EDTCDE(4)
     A            FATT06        11  0       TEXT('FATTURATO MESE 06')
     A                                      COLHDG('FATT.MESE 06')
                                            EDTCDE(4)
     A            FATT07        11  0       TEXT('FATTURATO MESE 07')
     A                                      COLHDG('FATT.MESE 07')
                                            EDTCDE(4)
     A            FATT08        11  0       TEXT('FATTURATO MESE 08')
     A                                      COLHDG('FATT.MESE 08')
                                            EDTCDE(4)
     A            FATT09        11  0       TEXT('FATTURATO MESE 09')
     A                                      COLHDG('FATT.MESE 09')
     A                                      EDTCDE(4)
     A            FATT10        11  0       TEXT('FATTURATO MESE 10')
     A                                      COLHDG('FATT.MESE 10')
     A                                      EDTCDE(4)
     A            FATT11        11  0       TEXT('FATTURATO MESE 11')
     A                                      COLHDG('FATT.MESE 11')
     A                                      EDTCDE(4)
     A            FATT12        11  0       TEXT('FATTURATO MESE 12')
     A                                      COLHDG('FATT.MESE 12')
     A                                      EDTCDE(4)
     A            FLAVA1         1          TEXT('FLAG AVANZAMENTO 1°')
     A                                      COLHDG('FLAG' 'AV.1°')
     A            FLAVA2         1          TEXT('FLAG AVANZAMENTO 2°')
     A                                      COLHDG('FLAG' 'AV.2°')
     A            FLBOLL         1          TEXT('FLAG EMISSIONE BOLLA')
     A                                      COLHDG('FLAG' 'BOLLA')
     A**                                    VALUES(' ' '0' '1')
     A            FLCLAV         1          TEXT('FLAG CONTO LAVORAZIONE')
     A                                      COLHDG('FLAG' 'C/LAV')
     A**                                    VALUES(' ' '0' '1')
     A            FLESEN         1          TEXT('FLAG MAX. ESENZIONE')
     A                                      COLHDG('FLAG' 'ESENZ')
     A**                                    VALUES(' ' '1')
     A            FLIMMB         1          TEXT('FLAG IMMISSIONE BOLLA MANUALE-
     A                                      ')
     A                                      COLHDG('IMM' 'MAN')
     A            FLFINL         1          TEXT('FLAG FINE LAVORAZIONE')
     A                                      COLHDG('FINE' 'LAV.')
     A            FLFIN1         1          TEXT('FLAG FINE LAV. MACCH1')
     A                                      COLHDG('F.LAV' '1°M.')
     A            FLFIN2         1          TEXT('FLAG FINE LAV. MACCH2')
     A                                      COLHDG('F.LAV' '2°M.')
     A            FLFIN3         1          TEXT('FLAG FINE LAV. MACCH3')
     A                                      COLHDG('F.LAV' '3°M.')
     A            FLINTE         1          TEXT('FLAG INTERNI')
     A                                      COLHDG('FLAG' 'INT.')
     A**                                    VALUES(' ' '1')
     A            FLDEST         1          TEXT('FLAG FATT/RIC')
     A                                      COLHDG('FLAG' 'F/R ')
     A            FLOKPG         1          TEXT('FLAG SI CARTA A PERUGIA')
     A                                      COLHDG('FLAG' 'PG')
     A            FLOKMI         1          TEXT('FLAG SI CARTA A MILANO')
     A                                      COLHDG('FLAG' 'MI')
     A            FLOKNA         1          TEXT('FLAG SI CARTA A NAPOLI')
     A                                      COLHDG('FLAG' 'NA')
     A            FLOKBA         1          TEXT('FLAG SI CARTA A BARI')
     A                                      COLHDG('FLAG' 'BA')
     A            FLARPG         1          TEXT('FLAG ARTICOLO DI PERUGIA')
     A                                      COLHDG('ART.' 'PG')
     A**                                    VALUES(' ' '1')
     A            FLARNA         1          TEXT('FLAG ARTICOLO FSC')
     A                                      COLHDG('ART.' 'FSC')
     A**                                    VALUES(' ' '1')
     A            FLARMI         1          TEXT('FLAG ARTICOLO DI MILANO')
     A                                      COLHDG('ART.' 'MI')
     A**                                    VALUES(' ' '1')
     A            FLCLPG         1          TEXT('FLAG CLIENTE DI PERUGIA')
     A                                      COLHDG('CLI.' 'PG')
     A**                                    VALUES(' ' '1')
     A            FLCLNA         1          TEXT('FLAG CLIENTE DI NAPOLI')
     A                                      COLHDG('CLI.' 'NA')
     A**                                    VALUES(' ' '1')
     A            FLCLMI         1          TEXT('FLAG CLIENTE DI MILANO')
     A                                      COLHDG('CLI.' 'MI')
     A**                                    VALUES(' ' '1')
     A            FLMOAG         1          TEXT('FLAG MOVIM. AGENTI')
     A                                      COLHDG('FLAG' 'M/AGE')
     A**                                    VALUES(' ' '1' '2')
     A            FLPRZ1         1          TEXT('FLAG CALCOLO PREZZO')
     A                                      COLHDG('FLAG' 'PREZZO')
     A**                                    VALUES(' ' '0' '1')
     A            FLPRZC         1          TEXT('FLAG CTR PREZZI')
     A                                      COLHDG('ST' 'PREZ')
     A            FLOMAG         1          TEXT('FLAG OMAGGIO')
     A                                      COLHDG('FLAG' 'OMAGGIO')
     A**                                    VALUES(' ' '0' '1')
     A            FLORAB         1          TEXT('FLAG ORDINE/ABB. 1°,2°,3°')
     A                                      COLHDG('FLAG' '1°2°3°')
     A                                      VALUES('1' '2' '3')
     A            FLMACC         1          TEXT('FLAG MACCHINA CARTONE')
     A                                      COLHDG('MACCH' 'CART.')
     A                                      VALUES('1' '2')
     A            FLABCO         1          TEXT('FLAG ABBINAMENTO COMPLETATO')
     A                                      COLHDG('ABB.' 'COMPL')
     A**                                    VALUES(' ' 'C')
     A            FLACSA         1          TEXT('FLAG SPEDIZ.IN ACCONTO/SALDO')
     A                                      COLHDG('ACC./' 'SALDO')
     A**                                    VALUES(' ' 'A' 'S')
     A            FLCONS         1          TEXT('FLAG TIPO ORDINE')
     A                                      COLHDG('FLAG' 'T.ORD.')
     A**                                    VALUES(' ' '0' '1' '2')
     A            FLSPAL         1          TEXT('FLAG SOMMA QTA'' PALLET')
     A                                      COLHDG('FL TOT' 'PALLET')
     A**                                    VALUES(' ' '0' '1')
     A            FLUTAR         1          TEXT('FLAG UTILIZZO ARCHIVI')
     A                                      COLHDG('UT.' 'ARCH')
     A**                                    VALUES(' ' '0' '1')
     A            FLMC12         1          TEXT('FLAG 1°/2° LAVORAZIONE')
     A                                      COLHDG('1/2' 'LAV')
     A**                                    VALUES('1' '2')
     A            FLDLAV         1          TEXT('FLAG DOPPIA LAVORAZ.')
     A                                      COLHDG('DOP' 'LAV')
     A            FLSTCO         1          TEXT('FLAG STAMPA CONFERMA')
     A                                      COLHDG('ST.' 'CONF')
     A                                      VALUES(' ' 'Y')
     A            FLSCFU         1          TEXT('FLAG SCAT.FUSTELLATA')
     A                                      COLHDG('SC.' 'FUST')
     A            FLSMAG         1          TEXT('FLAG SEGNALAZIONE MAGAZZ.')
     A                                      COLHDG('FL.' 'MAG')
     A                                      VALUES(' ' 'Y')
     A            FLPCON         1          TEXT('FLAG PRODUZ./CONS')
     A                                      COLHDG('PROD' 'CONS')
     A**                                    VALUES(' ' 'P')
     A            FLSTDE         1          TEXT('FLAG STAMPA DEFINITIVA')
     A                                      COLHDG('ST.' 'DEF.')
     A**                                    VALUES(' ' 'Y')
     A            FLSTRP         1          TEXT('FLAG SCATOLA CON STRIP')
     A                                      COLHDG('STRIP')
     A            STREEP         4          TEXT('TIPO STEEP')
     A                                      COLHDG('STRIP')
     A            FLINCO         1          TEXT('INCOLLAGGIO ESTERNO/INTERNO')
     A                                      COLHDG('INC.' 'E/I')
     A            FLPREM         1          TEXT('PREMONTAGGIO DIRITTO/ROVESC.')
     A                                      COLHDG('PRE.' 'D/R')
     A            FLFORT         1          TEXT('FORMATO TASSATIVO NO RIMPIC')
     A                                      COLHDG('FOR.' 'TAS.')
     A            FLSPET         1          TEXT('SPECIFICA TASSATIVA')
     A                                      COLHDG('SPE.' 'TAS.')
     A            FLQTAT         1          TEXT('QTA TASSATIVA')
     A                                      COLHDG('QTA.' 'TAS.')
     A            FLCASC         1          TEXT('FLAG CARTONE/SCATOLE')
     A                                      COLHDG('CART' 'SCAT')
     A                                      VALUES('C' 'S')
     A            FLTIPN         1          TEXT('TIPO NOTA RESI/ABBUON/DIF.PR')
     A                                      COLHDG('TIPO' 'NOTA')
     A            FLTPCA         1          TEXT('FLAG TIPO CARTA')
     A                                      COLHDG('TP.' 'CARTA')
     A**                                    VALUES('C' 'I')
     A            FLVIAG         1          TEXT('FLAG CALCOLO VIAGGIO')
     A                                      COLHDG('FLAG' 'VIAGGI')
     A**                                    VALUES(' ' '0' '1')
     A            FLCONF         1          TEXT('FLAG STAMPA CONFERMA')
     A                                      COLHDG('ST.' 'CONF.')
     A**                                    VALUES('Y' 'N')
     A            FLPREZ         1          TEXT('FLAG CONTROLLO PREZZO')
     A                                      COLHDG('FLAG.' 'PRZ.')
     A**                                    VALUES(' ' 'Y' 'N' 'T')
     A            FLPREI         1          TEXT('PREZZO CON INTERNI')
     A                                      COLHDG('PREZ.' '+ INT')
     A**                                    VALUES(' ' 'Y')
     A            FLPRSC         1          TEXT('FLAG SCATOLA/CARTONE')
     A                                      COLHDG('0=S' '1=C')
     A**                                    VALUES('0' '1')
     A            FLPRZM         1          TEXT('FLAG PREZZO INVIATO')
     A                                      COLHDG('PRZ' 'INV')
     A            FLCOTR         1          TEXT('FLAG CONFERMA TRASFERITA')
     A                                      COLHDG('CONF.' 'TRASF')
     A**                                    VALUES(' ' 'Y')
     A            FLSKED         1          TEXT('FLAG DATI SU SCHEDA')
     A                                      COLHDG('DATI' 'SKE.')
     A**                                    VALUES(' ' 'Y')
     A            FLORCH         1          TEXT('FLAG ORDINE CHIUSO')
     A                                      COLHDG('ORD' 'CHI')
     A            FLDERI         1          TEXT('FLAG DEFINITO/RICHIESTA')
     A                                      COLHDG('DEF.' 'RICH')
     A            FLSTOR         1          TEXT('FLAG SITUAZIONE STORICA')
     A                                      COLHDG('FLAG' 'STOR')
     A            FLSTA1         1          TEXT('FLAG 1 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTA2         1          TEXT('FLAG 2 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTA3         1          TEXT('FLAG 3 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTA4         1          TEXT('FLAG 4 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTA5         1          TEXT('FLAG 5 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTA6         1          TEXT('FLAG 6 SEGNALAZIONE ARCHIVIO')
     A                                      COLHDG('SEGN.' 'ARCH1')
     A            FLSTAM         1          TEXT('FLAG LAVORI STAMPI ESEGUITI')
     A                                      COLHDG('STAMPI' 'OK')
     A            FLANAD         1          TEXT('FLAG ANADES')
     A                                      COLHDG('FLAG' 'ANADES')
     A**                                    VALUES(' ' '1')
     A            FLREGI         1          TEXT('FLAG TIPO REGISTRAZ')
     A                                      COLHDG('TIPO' 'REG.')
     A            FLORDL         1          TEXT('FLAG ORDINE DI LAVORAZIONE')
     A                                      COLHDG('FLAG' 'ORD.LAV.')
     A**                                    VALUES('Y' 'N' 'L')
     A            FLLAVO         1          TEXT('FLAG LAVORAZIONE')
     A                                      COLHDG('FLAG.' 'LAV.NE')
     A            FLLAVC         1          TEXT('FLAG LAVORAZIONE CARTONE')
     A                                      COLHDG('LAV.' 'CARTONE')
     A            STLAVC         1          TEXT('STATO LAVORAZIONE CARTONE')
     A                                      COLHDG('ST.LAV.' 'CARTONE')
     A            CDFORC         6          TEXT('COD.FORN.CARTONE')
     A                                      COLHDG('FORN.' 'CARTONE')
     A            FLLAVS         1          TEXT('FLAG LAVORAZIONE SEMILAV')
     A                                      COLHDG('LAV.' 'SEMIL.')
     A            STLAVS         1          TEXT('STATO LAVORAZIONE SEMILAV')
     A                                      COLHDG('ST.LAV.' 'SEMIL.')
     A            CDFORS         6          TEXT('COD.FORN.SEMILAV')
     A                                      COLHDG('FORN.' 'SEMIL.')
     A            FLLAVF         1          TEXT('FLAG LAVORAZIONE P.FINITO')
     A                                      COLHDG('LAV.' 'P.F.')
     A            STLAVF         1          TEXT('STATO LAVORAZIONE P.FINITO')
     A                                      COLHDG('ST.LAV.' 'P.F.')
     A            CDFORF         6          TEXT('COD.FORN.P.FINITO')
     A                                      COLHDG('FORN.' 'P.F.')
     A            FLPCTO         1          TEXT('ORDINE TRASF.SU PC_TOPP')
     A                                      COLHDG('FL' 'PCTOPP')
     A            FLCOLE         1          TEXT('FLAG COMPLETAMENTO LAV.NE EST-
     A                                      ERNA')
     A                                      COLHDG('COMPL.' 'LAVEST')
     A**                                    VALUES(' ' 'Y')
     A            FLCOLO         1          TEXT('FLAG COLONNA DI STAMPA')
     A                                      COLHDG('COLONNA' 'STAMPA')
     A            FLRILE         1          TEXT('FLAG CONTROLLO CALCOLO PREZZO-
     A                                      ')
     A                                      COLHDG('CTR' 'PREZ')
     A**                                    VALUES(' ' 'Y' 'N' 'C' 'T' 'R')
     A            FLSVIL         1          TEXT('FLAG SVILUPPO AUTOMATICO')
     A                                      COLHDG('SVIL.' 'AUT.')
     A**                                    VALUES('Y' 'N')
     A            FLTEFI         1          TEXT('FLAG SVIL. TESTATA/FIANCATA')
     A                                      COLHDG('SVIL.' 'T/F')
     A            FLFIAB         1          TEXT('FLAG FINE ABBINAMENTO')
     A                                      COLHDG('FINE' 'ABB.')
     A**                                    VALUES('E' '*' 'S' 'T')
     A            FLFIPR         1          TEXT('FLAG FINE PRODUZIONE')
     A                                      COLHDG('FINE' 'PROD')
     A**                                    VALUES(' ' 'Y')
     A            FLCTOL         1          TEXT('FLAG CONTO LAVORAZ.')
     A                                      COLHDG('C/TO' 'LAV.')
     A**                                    VALUES(' ' 'Y')
     A            FLXMAG         1          TEXT('FLAG RECORD X MAGAZZINO')
     A                                      COLHDG('FLAG' 'X MAG')
     A            FUSINC         1          TEXT('FUSTELLATO INCOLLATO')
     A                                      COLHDG('FUST' 'INC.')
     A**                                    VALUES('Y' 'N')
     A            FLIMPU         1          TEXT('FLAG IMPUTAZIONE')
     A                                      COLHDG('FLAG' 'IMPUT.')
     A**                                    VALUES(' ' '1')
     A            GRAMMA         1          TEXT('GRAMMATURA CARTA')
     A                                      COLHDG('GRAMM')
     A            GRAMID         3  0       TEXT('DG. AMIDO ONDA X MQ')
     A                                      COLHDG('DG.' 'AMIDO')
     A            GRDES1         3  0       TEXT('DESCRIZIONE GRAMMATURA 1')
     A                                      COLHDG('DESC' 'GR 1')
     A                                      EDTCDE(Z)
     A            GRDES2         3  0       TEXT('DESCRIZIONE GRAMMATURA 2')
     A                                      COLHDG('DESC' 'GR 2')
     A                                      EDTCDE(Z)
     A            GRDES3         3  0       TEXT('DESCRIZIONE GRAMMATURA 3')
     A                                      COLHDG('DESC' 'GR 3')
     A                                      EDTCDE(Z)
     A            GRDES4         3  0       TEXT('DESCRIZIONE GRAMMATURA 4')
     A                                      COLHDG('DESC' 'GR 4')
     A                                      EDTCDE(Z)
     A            GRDES5         3  0       TEXT('DESCRIZIONE GRAMMATURA 5')
     A                                      COLHDG('DESC' 'GR 5')
     A                                      EDTCDE(Z)
     A            GRDES6         3  0       TEXT('DESCRIZIONE GRAMMATURA 6')
     A                                      COLHDG('DESC' 'GR 6')
     A                                      EDTCDE(Z)
     A            GRDES7         3  0       TEXT('DESCRIZIONE GRAMMATURA 7')
     A                                      COLHDG('DESC' 'GR 7')
     A                                      EDTCDE(Z)
     A            GRDES8         3  0       TEXT('DESCRIZIONE GRAMMATURA 8')
     A                                      COLHDG('DESC' 'GR 8')
     A                                      EDTCDE(Z)
     A            GRDES9         3  0       TEXT('DESCRIZIONE GRAMMATURA 9')
     A                                      COLHDG('DESC' 'GR 9')
     A                                      EDTCDE(Z)
     A            GREFF1         3  0       TEXT('GRAMMATURA 1 EFFETTIVA')
     A                                      COLHDG('GR.1' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF2         3  0       TEXT('GRAMMATURA 2 EFFETTIVA')
     A                                      COLHDG('GR.2' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF3         3  0       TEXT('GRAMMATURA 3 EFFETTIVA')
     A                                      COLHDG('GR.3' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF4         3  0       TEXT('GRAMMATURA 4 EFFETTIVA')
     A                                      COLHDG('GR.4' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF5         3  0       TEXT('GRAMMATURA 5 EFFETTIVA')
     A                                      COLHDG('GR.5' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF6         3  0       TEXT('GRAMMATURA 6 EFFETTIVA')
     A                                      COLHDG('GR.6' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF7         3  0       TEXT('GRAMMATURA 7 EFFETTIVA')
     A                                      COLHDG('GR.7' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF8         3  0       TEXT('GRAMMATURA 8 EFFETTIVA')
     A                                      COLHDG('GR.8' 'EFF.')
     A                                      EDTCDE(Z)
     A            GREFF9         3  0       TEXT('GRAMMATURA 9 EFFETTIVA')
     A                                      COLHDG('GR.9' 'EFF.')
     A                                      EDTCDE(Z)
     A            GRUACC         2          TEXT('GRUPPO DI ACCUMULO')
     A                                      COLHDG('GRUPPO' 'ACCUM.')
     A            GRUMER         2          TEXT('GRUPPO MERCEOLOGICO SCATOLA')
     A                                      COLHDG('GRU.' 'MERC')
     A            GRUTI1         3  0       TEXT('GRAMMATURA 1 UTILIZZATA')
     A                                      COLHDG('GR' '1')
     A                                      EDTCDE(Z)
     A            GRUTI2         3  0       TEXT('GRAMMATURA 2 UTILIZZATA')
     A                                      COLHDG('GR' '2')
     A                                      EDTCDE(Z)
     A            GRUTI3         3  0       TEXT('GRAMMATURA 3 UTILIZZATA')
     A                                      COLHDG('GR' '3')
     A                                      EDTCDE(Z)
     A            GRUTI4         3  0       TEXT('GRAMMATURA 4 UTILIZZATA')
     A                                      COLHDG('GR' '4')
     A                                      EDTCDE(Z)
     A            GRUTI5         3  0       TEXT('GRAMMATURA 5 UTILIZZATA')
     A                                      COLHDG('GR' '5')
     A                                      EDTCDE(Z)
     A            GRUTI6         3  0       TEXT('GRAMMATURA 6 UTILIZZATA')
     A                                      COLHDG('GR' '6')
     A                                      EDTCDE(Z)
     A            GRUTI7         3  0       TEXT('GRAMMATURA 7 UTILIZZATA')
     A                                      COLHDG('GR' '7')
     A                                      EDTCDE(Z)
     A            GRUTI8         3  0       TEXT('GRAMMATURA 8 UTILIZZATA')
     A                                      COLHDG('GR' '8')
     A                                      EDTCDE(Z)
     A            GRUTI9         3  0       TEXT('GRAMMATURA 9 UTILIZZATA')
     A                                      COLHDG('GR' '9')
     A                                      EDTCDE(Z)
     A            HINIZL         4  0       TEXT('ORA INIZIO CAMBIO ORDINE')
     A                                      COLHDG('INIZ' 'CAMB')
     A                                      EDTCDE(Z)
     A            HINIZA         4  0       TEXT('ORA INIZIO ATTREZZAGGIO')
     A                                      COLHDG('INIZ' 'ATTR')
     A                                      EDTCDE(Z)
     A            HDALLE         4  0       TEXT('ORA INIZIO LAVORAZIONE')
     A                                      COLHDG('INIZ' 'LAV.')
     A                                      EDTCDE(Z)
     A            HFINEL         4  0       TEXT('ORA FINE LAVORAZIONE')
     A                                      COLHDG('FINE' 'LAV.')
     A                                      EDTCDE(Z)
     A            HDALLF         4  0       TEXT('ORA INIZIO FERMO')
     A                                      COLHDG('INIZ' 'FERMO')
     A                                      EDTCDE(Z)
     A            HFINEF         4  0       TEXT('ORA FINE FERMO')
     A                                      COLHDG('FINE' 'FERMO')
     A                                      EDTCDE(Z)
     A            IMPAB1         7  0       TEXT('PESO CARTA 1 IMPEGNO ABBINAME-
     A                                      NTO')
     A                                      COLHDG('PESO 1' 'IMP ABB')
     A                                      EDTCDE(4)
     A            IMPAB2         7  0       TEXT('PESO CARTA 2 IMPEGNO ABBINAME-
     A                                      NTO')
     A                                      COLHDG('PESO 2' 'IMP ABB')
     A                                      EDTCDE(4)
     A            IMPAB3         7  0       TEXT('PESO CARTA 3 IMPEGNO ABBINAME-
     A                                      NTO')
     A                                      COLHDG('PESO 3' 'IMP ABB')
     A                                      EDTCDE(4)
     A            IMPAB4         7  0       TEXT('PESO CARTA 4 IMPEGNO ABBINAME-
     A                                      NTO')
     A                                      COLHDG('PESO 4' 'IMP ABB')
     A                                      EDTCDE(4)
     A            IMPAB5         7  0       TEXT('PESO CARTA 5 IMPEGNO ABBINAME-
     A                                      NTO')
     A                                      COLHDG('PESO 5' 'IMP ABB')
     A                                      EDTCDE(4)
     A            IMPBOL         7  0       TEXT('IMPORTO BOLLA')
     A                                      COLHDG('IMP.' 'BOLLA')
     A                                      EDTCDE(Z)
     A            IMPEST        10  2       TEXT('IMPORTO TOT. ESENZIONE')
     A                                      COLHDG('IMP.' 'ESENZ.')
     A                                      EDTCDE(Z)
     A            IMPESF        10  2       TEXT('IMPORTO ESENZ. FATTURATO')
     A                                      COLHDG('IMP.ES.FT.')
     A                                      EDTCDE(Z)
     A            IMPONF    R               REFFLD(IMPON DIZACGV3)
     A            IMPROV        10  0       TEXT('IMPORTO PROVVIGIONE')
     A                                      COLHDG('IMP.PROVV.')
     A                                      EDTCDE(Z)
     A            IMPVIA         7  0       TEXT('IMPORTO VIAGGIO')
     A                                      COLHDG('IMP.' 'VIAGGIO')
     A                                      EDTCDE(Z)
     A            INDDES        35          TEXT('INDIRIZZO DESTINATARIO')
     A                                      COLHDG('INDIRIZZO')
     A            INFSUP        40          TEXT('INFORMAZIONI SUPPLEMENTARI')
     A                                      COLHDG('INFOR' 'SUPPL')
     A            INCOAM         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. INCOLL-
     A                                      ATO')
     A                                      COLHDG('INCOAM')
     A                                      EDTCDE(4)
     A            PERVUO         5  2       TEXT('% VUOTO SU FUSTELLATI')
     A                                      COLHDG('% VUOTO')
     A            INCOFU         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. INCOLL-
     A                                      ATO')
     A                                      COLHDG('INCOAM')
     A                                      EDTCDE(4)
     A            INDINT         1S 0       TEXT('PROGRESSIVO COD. ARTICOLO')
     A                                      COLHDG('PROG' 'ART')
     A                                      EDTCDE(Z)
     A            INDVET        20          TEXT('INDIRIZZO VETTORE')
     A                                      COLHDG('INDIRIZZO VETTORE')
     A            INDCL     R               REFFLD(INDCL DIZACGV3)
     A            IVAPRO         2  0       TEXT('ALIQUOTA IVA PRODOTTO')
     A                                      COLHDG('%' 'IVA')
     A                                      EDTCDE(Z)
     A            KGINIZ         9  0       TEXT('KG GIACENZA INIZIALE CARTE')
     A                                      COLHDG('GIAC.' 'INIZ.')
     A                                      EDTCDE(4)
     A            KGORDI         9  0       TEXT('KG ORDINATI')
     A                                      COLHDG('KG.' 'ORD.')
     A                                      EDTCDE(4)
     A            KGORNO         9  0       TEXT('KG ORDINATI NOMIN.')
     A                                      COLHDG('KG.ORD.' 'NOMIN.')
     A                                      EDTCDE(4)
     A            KGABBI         9  0       TEXT('KG ABBINATI')
     A                                      COLHDG('KG.' 'ABB.')
     A                                      EDTCDE(4)
     A            KGABNO         9  0       TEXT('KG ABBINATI NOMIN.')
     A                                      COLHDG('KG.ABB.' 'NOMIN.')
     A                                      EDTCDE(4)
     A            KGACQU         9  0       TEXT('KG ACQUISTATI')
     A                                      COLHDG('KG.' 'ACQ.')
     A                                      EDTCDE(4)
     A            KGVEND         9  0       TEXT('KG VENDUTI')
     A                                      COLHDG('KG.' 'VEN.')
     A                                      EDTCDE(4)
     A            KGDIFE         9  0       TEXT('KG DIFETTOSI')
     A                                      COLHDG('KG.' 'DIF.')
     A                                      EDTCDE(4)
     A            KGRESI         9  0       TEXT('KG RESI')
     A                                      COLHDG('KG.' 'RESI')
     A                                      EDTCDE(4)
     A            KGFINE         9  0       TEXT('KG GIACENZA FINALE CARTE')
     A                                      COLHDG('GIAC.' 'FINALE')
     A                                      EDTCDE(4)
     A            KMLINE         5  0       TEXT('CHILOMETRI PERCORRENZA LINEA')
     A                                      COLHDG('KM' 'LINEA')
     A                                      EDTCDE(Z)
     A            KMTRA          5  0       TEXT('KM TRASPORTO')
     A                                      COLHDG('KM.TRASP.')
     A            LGTFIA         5  0       TEXT('LUNGHEZZA FIANCATA')
     A                                      COLHDG('LGT' 'FIA')
     A                                      EDTCDE(Z)
     A            LIINF1         5  0       TEXT('LIMITE INFERIORE 1à DIMENSION-
     A                                      E')
     A                                      COLHDG('1à DIM.' 'INFER.')
     A                                      EDTCDE(Z)
     A            LISUP1         5  0       TEXT('LIMITE SUPERIORE 1à DIMENSION-
     A                                      E')
     A                                      COLHDG('1à DIM.' 'SUPER.')
     A                                      EDTCDE(Z)
     A            LIINF2         5  0       TEXT('LIMITE INFERIORE 2à DIMENSION-
     A                                      E')
     A                                      COLHDG('2à DIM.' 'INFER.')
     A                                      EDTCDE(Z)
     A            LIREAL         3  0       TEXT('LIRE AGGIUNTIVE DI TRASFORMAZ-
     A                                      IONE ONDA ALTA')
     A                                      COLHDG('LIT.TRASF.' 'ONDA ALTA')
     A                                      EDTCDE(Z)
     A            LIREBA         3  0       TEXT('LIRE AGGIUNTIVE DI TRASFORMAZ-
     A                                      IONE ONDA BASSA')
     A                                      COLHDG('LIT.TRASF.' 'ONDA BASSA')
     A                                      EDTCDE(Z)
     A            LIRETR         3  0       TEXT('LIRE AGGIUNTIVE DI TRASFORMAZ-
     A                                      IONE ONDA TRIPLA')
     A                                      COLHDG('LIT.TRASF.' 'ONDA TRIPLA')
     A                                      EDTCDE(Z)
     A            LISUP2         5  0       TEXT('LIMITE SUPERIORE 2à DIMENSION-
     A                                      E')
     ù                                      COLHDG('2à DIM.' 'SUPER.')
     A                                      EDTCDE(Z)
     A            LIINFT         5  0       TEXT('LIMITE INFERIORE TESTATA')
     A                                      COLHDG('TESTATA' 'MINIMA')
     A                                      EDTCDE(Z)
     A            LMQ1AM         5  0       TEXT('LIMITE QUADRATURA 1')
     A                                      COLHDG('LIM 1' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ2AM         5  0       TEXT('LIMITE QUADRATURA 2')
     A                                      COLHDG('LIM 2' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ3AM         5  0       TEXT('LIMITE QUADRATURA 3')
     A                                      COLHDG('LIM 3' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ4AM         5  0       TEXT('LIMITE QUADRATURA 4')
     A                                      COLHDG('LIM 4' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ5AM         5  0       TEXT('LIMITE QUADRATURA 5')
     A                                      COLHDG('LIM 5' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ6AM         5  0       TEXT('LIMITE QUADRATURA 6')
     A                                      COLHDG('LIM 7' 'QUADR')
     A                                      EDTCDE(Z)
     A            LMQ7AM         5  0       TEXT('LIMITE QUADRATURA 7')
     A                                      COLHDG('LIM 7' 'QUADR')
     A                                      EDTCDE(Z)
     A            LRQ1AM         5  2       TEXT('LIRE QUADRATURA 1')
     A                                      COLHDG('LIR 1' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ2AM         5  2       TEXT('LIRE QUADRATURA 2')
     A                                      COLHDG('LIR 2' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ3AM         5  2       TEXT('LIRE QUADRATURA 3')
     A                                      COLHDG('LIR 3' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ4AM         5  2       TEXT('LIRE QUADRATURA 4')
     A                                      COLHDG('LIR 4' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ5AM         5  2       TEXT('LIRE QUADRATURA 5')
     A                                      COLHDG('LIR 5' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ6AM         5  2       TEXT('LIRE QUADRATURA 6')
     A                                      COLHDG('LIR 6' 'QUADR')
     A                                      EDTCDE(4)
     A            LRQ7AM         5  2       TEXT('LIRE QUADRATURA 7')
     A                                      COLHDG('LIR 7' 'QUADR')
     A                                      EDTCDE(4)
     A            LOCDES        25          TEXT('LOCALITA'' DESTINATARIO')
     A                                      COLHDG('LOCALITA''')
     A            COMDES        25          TEXT('COMUNE DESTINATARIO')
     A                                      COLHDG('COMUNE')
     A            LOCVET        20          TEXT('LOCALITA'' VETTORE')
     A                                      COLHDG('LOCALITA'' VETTORE')
     A            LOCCL     R               REFFLD(LOCCL DIZACGV3)
     A            MACCH1         2          TEXT('1à MACCHINA')
     A                                      COLHDG('1à' 'MACC')
     A            MACCH2         2          TEXT('2à MACCHINA')
     A                                      COLHDG('2à' 'MACC')
     A            MACCH3         2          TEXT('3à MACCHINA')
     A                                      COLHDG('3à' 'MACC')
     A            MACCH4         2          TEXT('4à MACCHINA')
     A                                      COLHDG('4à' 'MACC')
     A            MACCH5         2          TEXT('5à MACCHINA')
     A                                      COLHDG('5à' 'MACC')
     A            MALT21         2          TEXT('1° MAC.ALT.MACCH2')
     A                                      COLHDG('M.A.' '21')
     A            MALT22         2          TEXT('2° MAC.ALT.MACCH2')
     A                                      COLHDG('M.A.' '22')
     A            MALT31         2          TEXT('1° MAC.ALT.MACCH3')
     A                                      COLHDG('M.A.' '31')
     A            MALT32         2          TEXT('2° MAC.ALT.MACCH3')
     A                                      COLHDG('M.A.' '32')
     A            MALT41         2          TEXT('1° MAC.ALT.MACCH4')
     A                                      COLHDG('M.A.' '41')
     A            MALT42         2          TEXT('2° MAC.ALT.MACCH4')
     A                                      COLHDG('M.A.' '42')
     A            MINCAM         3  0       TEXT('MINUTI PER CAMBIO ORDINE')
     A                                      COLHDG('MINUTI' 'CAMBIO')
     A                                      EDTCDE(Z)
     A            MINAVV         3  0       TEXT('MINUTI AVVIAMENTO ORDINE')
     A                                      COLHDG('MINUTI' 'AVVIAM.')
     A                                      EDTCDE(Z)
     A            MINCCO         3  0       TEXT('MINUTI PER CAMBIO COLORE')
     A                                      COLHDG('MINUTI' 'C.COLORE')
     A                                      EDTCDE(Z)
     A            MINCA2         3  0       TEXT('MIN.CAMBIO ORDINE')
     A                                      COLHDG('MIN.' 'CAM.')
     A                                      EDTCDE(Z)
     A            MINCA3         3  0       TEXT('MIN.CAMBIO ORDINE')
     A                                      COLHDG('MIN.' 'CAM.')
     A                                      EDTCDE(Z)
     A            MINCA4         3  0       TEXT('MIN.CAMBIO ORDINE')
     A                                      COLHDG('MIN.' 'CAM.')
     A                                      EDTCDE(Z)
     A            MINCC2         3  0       TEXT('MIN.CAMBIO SCELTA')
     A                                      COLHDG('MIN.' 'SCE.')
     A                                      EDTCDE(Z)
     A            MINCC3         3  0       TEXT('MIN.CAMBIO SCELTA')
     A                                      COLHDG('MIN.' 'SCE.')
     A                                      EDTCDE(Z)
     A            MINCC4         3  0       TEXT('MIN.CAMBIO SCELTA')
     A                                      COLHDG('MIN.' 'SCE.')
     A                                      EDTCDE(Z)
     A            MINTEO         5  0       TEXT('MINUTI TEORICI LAV.ORDINE')
     A                                      COLHDG('MINUTI' 'TEORICI')
     A                                      EDTCDE(Z)
     A            MINEFF         5  0       TEXT('MINUTI EFFETT. LAV.ORDINE')
     A                                      COLHDG('MINUTI' 'EFFETT.')
     A                                      EDTCDE(Z)
     A            MOVMAG         2          TEXT('MOVIMENTO MAGAZZINO')
     A                                      COLHDG('MOV.' 'MAG.')
     A            MODPRO         2          TEXT('MODELLO PRODOTTO')
     A                                      COLHDG('MOD' 'PRO')
     A            MMDI1A         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       1à DIM ONDA ALTA')
     A                                      COLHDG('MM.1à DIM' 'ONDA ALTA')
     A                                      EDTCDE(Z)
     A            MMDI1B         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       1à DIM ONDA BASSA')
     A                                      COLHDG('MM.1à DIM' 'ONDA BASSA')
     A                                      EDTCDE(Z)
     A            MMDI1T         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       1à DIM ONDA TRIPLA')
     A                                      COLHDG('MM.1à DIM' 'ONDA TRIPLA')
     A                                      EDTCDE(Z)
     A            MMDI1E         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       1à DIM ONDA MICRO')
     A                                      COLHDG('MM.1à DIM' 'ONDA MICRO')
     A                                      EDTCDE(Z)
     A            MMDI1M         3  0       TEXT('MM.AGG. X SVIL.COMM.LE 1°DIM.-
     A                                       ONDA MICROTR.')
     A                                      COLHDG('MM.1à DIM' 'ONDA "BE"')
     A                                      EDTCDE(Z)
     A            MMDI1O         3  0       TEXT('MM.AGG. X SVIL.COMMLE 1° DIM.-
     A                                       ONDA BA')
     A                                      COLHDG('MM.1à DIM' 'ONDA "BA"')
     A                                      EDTCDE(Z)
     A            MMDI2A         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       2à DIM ONDA ALTA')
     A                                      COLHDG('MM.2à DIM' 'ONDA ALTA')
     A                                      EDTCDE(Z)
     A            MMDI2B         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       2à DIM ONDA BASSA')
     A                                      COLHDG('MM.2à DIM' 'ONDA BASSA')
     A                                      EDTCDE(Z)
     A            MMDI2T         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       2à DIM ONDA TRIPLA')
     A                                      COLHDG('MM.2à DIM' 'ONDA TRIPLA')
     A                                      EDTCDE(Z)
     A            MMDI2E         3  0       TEXT('MM. AGGIUNTIVI X SVIL.COMM.LE-
     A                                       2à DIM ONDA MICRO')
     A                                      COLHDG('MM.2à DIM' 'ONDA MICRO')
     A                                      EDTCDE(Z)
     A            MMDI2M         3  0       TEXT('MM.AGG. X SVIL.COMM.LE 2° DIM-
     A                                       ONDA EB')
     A                                      COLHDG('MM.2à DIM' 'ONDA "BE"')
     A                                      EDTCDE(Z)
     A            MMDI2O         3  0       TEXT('MM.AGG.X SVIL.COMM.LE 2° DIM-
     A                                       ONDA BA')
     A                                      COLHDG('MM.2à DIM' 'ONDA "BA"')
     A                                      EDTCDE(Z)
     A            MQPROD         7  4       TEXT('QUADRATURA SCATOLA')
     A                                      COLHDG('MQ.SCATOLA')
     A                                      EDTCDE(4)
     A            MQFA01        11  0       TEXT('MQ.MESE 01')
     A                                      COLHDG('MQ.MESE 01')
                                            EDTCDE(4)
     A            MQFA02        11  0       TEXT('MQ.MESE 02')
     A                                      COLHDG('MQ.MESE 02')
                                            EDTCDE(4)
     A            MQFA03        11  0       TEXT('MQ. MESE 03')
     A                                      COLHDG('MQ. MESE 03')
                                            EDTCDE(4)
     A            MQFA04        11  0       TEXT('MQ.MESE 04')
     A                                      COLHDG('MQ.MESE 04')
                                            EDTCDE(4)
     A            MQFA05        11  0       TEXT('MQ.MESE 05')
     A                                      COLHDG('MQ.MESE 05')
                                            EDTCDE(4)
     A            MQFA06        11  0       TEXT('MQ.MESE 06')
     A                                      COLHDG('MQ.MESE 06')
                                            EDTCDE(4)
     A            MQFA07        11  0       TEXT('MQ.MESE 07')
     A                                      COLHDG('MQ.MESE 07')
                                            EDTCDE(4)
     A            MQFA08        11  0       TEXT('MQ.MESE 08')
     A                                      COLHDG('MQ.MESE 08')
                                            EDTCDE(4)
     A            MQFA09        11  0       TEXT('FATTURATO MESE 09')
     A                                      COLHDG('MQ.MESE 09')
                                            EDTCDE(4)
     A            MQFA10        11  0       TEXT('MQ.MESE 10')
     A                                      COLHDG('MQ.MESE 10')
                                            EDTCDE(4)
     A            MQFA11        11  0       TEXT('MQ.MESE 11')
     A                                      COLHDG('MQ.MESE 11')
                                            EDTCDE(4)
     A            MQFA12        11  0       TEXT('MQ.MESE 12')
     A                                      COLHDG('MQ.MESE 12')
                                            EDTCDE(4)
     A            MTLABB         7  0       TEXT('METRI LINEARI ABBINAMENTO')
     A                                      COLHDG('MT LIN' 'ABBIN')
     A                                      EDTCDE(4)
     A            MTLPRO         7  0       TEXT('METRI LINEARI PRODOTTI')
     A                                      COLHDG('MT.LIN.' 'PROD.')
     A                                      EDTCDE(4)
     A            MTLTOT         7  0       TEXT('METRI LINEARI TOTALI')
     A                                      COLHDG('MT.LIN.' 'TOT.')
     A                                      EDTCDE(4)
     A            MTLBUS         7  0       TEXT('PEZZI SCARTO ONDUL.')
     A                                      COLHDG('SCARTO' 'ONDUL.')
     A                                      EDTCDE(4)
     A            MTLTOS         7  0       TEXT('MTL TOTALI SERALI')
     A                                      COLHDG('MTL.T' 'SERALI')
     A                                      EDTCDE(4)
     A            MTLUNG         5  2       TEXT('MTL LUNGH.MEZZO TRASP.')
     A                                      COLHDG('LUNGH.' 'MEZZO')
     A                                      EDTCDE(4)
     A            MTLARG         5  2       TEXT('MTL LARGH.MEZZO TRASP.')
     A                                      COLHDG('LARG.' 'MEZZO')
     A                                      EDTCDE(4)
     A            MTALTE         5  2       TEXT('MTL ALTEZ.MEZZO TRASP.')
     A                                      COLHDG('ALTEZ.' 'MEZZO')
     A                                      EDTCDE(4)
     A            NATURA         2          TEXT('NATURA ARTICOLO')
     A                                      COLHDG('NATURA')
     A            NAZEST         1          TEXT('CARTA NAZIONALE/ESTERA')
     A                                      COLHDG('NAZ' 'EST')
     A            NRALBO        20          TEXT('N° ALBO TRASPORTATORI ')
     A                                      COLHDG('ALBO')
     A            NRABBI         5  0       TEXT('NUMERO ABBINAMENTO')
     A                                      COLHDG('NR.' 'ABB.')
     A                                      EDTCDE(Z)
     A            NRBOBI         5  0       TEXT('NUMERO BOBINE')
     A                                      COLHDG('NR.' 'BOB.')
     A                                      EDTCDE(4)
     A            NRBOLL         6  0       TEXT('NUMERO BOLLA')
     A                                      COLHDG('NR.' 'BOLLA')
     A                                      EDTCDE(Z)
     A            NRCACO         1  0       TEXT('N° CAMBI COLORE')
     A                                      COLHDG('CAM' 'COL')
     A                                      EDTCDE(Z)
     A            NRDIPE         2  0       TEXT('N° DIP. ALLA MACCH.')
     A                                      COLHDG('NR.' 'DIP.')
     A                                      EDTCDE(Z)
     A            NUMDIP         5  2       TEXT('N° DIP. ALLA MACCH.')
     A                                      COLHDG('NR.' 'DIP.')
     A                                      EDTCDE(Z)
     A            NUMSTA         5  0       TEXT('N° REALIZZ.STAMPO')
     A                                      COLHDG('NR.' 'STA.')
     A                                      EDTCDE(Z)
     A            NRLOTT         2  0       TEXT('N° LOTTO DI LAVOR.')
     A                                      COLHDG('NR.' 'LOTTO')
     A                                      EDTCDE(Z)
     A            NRDICH        10          TEXT('NUMERO DICHIARAZIONE ESENZION-
     A                                      E IVA')
     A                                      COLHDG('N.ESENZ' 'IVA')
     A            NRCONF         6  0       TEXT('NUMERO CONFERMA ORDINE')
     A                                      COLHDG('N.CONF')
     A                                      EDTCDE(Z)
     A            NRFATT         7          TEXT('NUMERO FATTURA/NOTA')
     A                                      COLHDG('NR.' 'FAT/NOT')
     A            NRORDE        11  0       TEXT('NUMERO ORDINE LAV.NE ESTERNA')
     A                                      COLHDG('NR.ORD.' 'LAV.EST.')
     A                                      EDTCDE(Z)
     A            NRPABB         1  0       TEXT('NUMERO PROGRESIVO ABBINAMENTO-
     A                                      ')
     A                                      COLHDG('PROG' 'ABB.')
     A                                      EDTCDE(Z)
     A            NRPOSC         2  0       TEXT('NUMERO POSIZIONE CONFERMA')
     A                                      COLHDG('NR.POS' 'CONF.')
     A                                      EDTCDE(Z)
     A            NRRIGA         2  0       TEXT('NUMERO PROGRESSIVO RIGA BOLLA-
     A                                      ')
     A                                      COLHDG('RIGA' 'BOLLA')
     A                                      EDTCDE(Z)
     A            NRRIGO         2  0       TEXT('NUMERO RIGA ORDINE')
     A                                      COLHDG('RIGA' 'ORD.')
     A                                      EDTCDE(Z)
     A            NRRIFN         5  0       TEXT('NUMERO RIFERIMENTO PER NOTA')
     A                                      COLHDG('NR.RIF' 'X NOTA')
     A                                      EDTCDE(Z)
     A            NRSTAM         5  0       TEXT('NUMERO STAMPO')
     A                                      COLHDG('N.STAMPO')
     A                                      EDTCDE(Z)
     A            NOTPRO        34          TEXT('NOTE PRODUZIO')
     A                                      COLHDG('NOTE' 'PRODUZIO')
     A            NOTCE1        70          TEXT('NOTE CERTIF.')
     A                                      COLHDG('NOTE' 'CERTIF.')
     A            NOTCE2        70          TEXT('NOTE CERTIF.')
     A                                      COLHDG('NOTE' 'CERTIF.')
     A            NRTAGL         7  0       TEXT('NUMERO DEI TAGLI')
     A                                      COLHDG('NR.' 'TAGLI')
     A                                      EDTCDE(4)
     A            NRTRIM         1  0       TEXT('NUMERO TRIMESTRE')
     A                                      COLHDG('NR.' 'TRIM.')
     A                                      EDTCDE(Z)
     A            NRVIAG         5  0       TEXT('NUMERO VIAGGIO')
     A                                      COLHDG('NR.' 'VIAGGIO')
     A                                      EDTCDE(Z)
     A            NRSEQ          3  0       TEXT('N° SEQ.STAMPA CARTA LISTINO')
     A                                      COLHDG('SEQ' 'LIST.')
     A            NUMCOL         1  0       TEXT('NUMERO COLORI')
     A                                      COLHDG('NR.' 'COL')
     A                                      EDTCDE(Z)
     A            ORDLAV         5  0       TEXT('NUMERO ORDINE DI LAVORO')
     A                                      COLHDG('N.ORD' 'LAV.')
     A                                      EDTCDE(Z)
     A            ORDGEN         5  0       TEXT('ORDINE DI PROVENIENZA')
     A                                      COLHDG('N.ORD' 'PROV.')
     A                                      EDTCDE(Z)
     A            OLIVT1         5  2       TEXT('ONDULATO 1 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 1' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB1         5  2       TEXT('ONDULATO 1 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 1' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA1         5  2       TEXT('ONDULATO 1 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 1' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE1         5  2       TEXT('ONDULATO 1 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 1' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT1         5  2       TEXT('ONDULATO 1 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 1' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB1         5  2       TEXT('ONDULATO 1 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 1' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA1         5  2       TEXT('ONDULATO 1 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 1' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE1         5  2       TEXT('ONDULATO 1 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 1' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT2         5  2       TEXT('ONDULATO 2 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 2' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB2         5  2       TEXT('ONDULATO 2 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 2' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA2         5  2       TEXT('ONDULATO 2 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 2' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE2         5  2       TEXT('ONDULATO 2 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 2' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT2         5  2       TEXT('ONDULATO 2 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 2' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB2         5  2       TEXT('ONDULATO 2 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 2' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA2         5  2       TEXT('ONDULATO 2 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 2' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE2         5  2       TEXT('ONDULATO 2 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 2' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT3         5  2       TEXT('ONDULATO 3 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 3' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB3         5  2       TEXT('ONDULATO 3 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 3' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA3         5  2       TEXT('ONDULATO 3 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 3' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE3         5  2       TEXT('ONDULATO 3 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 3' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT3         5  2       TEXT('ONDULATO 3 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 3' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB3         5  2       TEXT('ONDULATO 3 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 3' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA3         5  2       TEXT('ONDULATO 3 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 3' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE3         5  2       TEXT('ONDULATO 3 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 3' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT4         5  2       TEXT('ONDULATO 4 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 4' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB4         5  2       TEXT('ONDULATO 4 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 4' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA4         5  2       TEXT('ONDULATO 4 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 4' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE4         5  2       TEXT('ONDULATO 4 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 4' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT4         5  2       TEXT('ONDULATO 4 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 4' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB4         5  2       TEXT('ONDULATO 4 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 4' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA4         5  2       TEXT('ONDULATO 4 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 4' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE4         5  2       TEXT('ONDULATO 4 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 4' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT5         5  2       TEXT('ONDULATO 5 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 5' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB5         5  2       TEXT('ONDULATO 5 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 5' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA5         5  2       TEXT('ONDULATO 5 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 5' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE5         5  2       TEXT('ONDULATO 5 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 5' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT5         5  2       TEXT('ONDULATO 5 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 5' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB5         5  2       TEXT('ONDULATO 5 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 5' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA5         5  2       TEXT('ONDULATO 5 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 5' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE5         5  2       TEXT('ONDULATO 5 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 5' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT6         5  2       TEXT('ONDULATO 6 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 6' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB6         5  2       TEXT('ONDULATO 6 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 6' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA6         5  2       TEXT('ONDULATO 6 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 6' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE6         5  2       TEXT('ONDULATO 6 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 6' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT6         5  2       TEXT('ONDULATO 6 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 6' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB6         5  2       TEXT('ONDULATO 6 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 6' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA6         5  2       TEXT('ONDULATO 6 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 6' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE6         5  2       TEXT('ONDULATO 6 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 6' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT7         5  2       TEXT('ONDULATO 7 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 7' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB7         5  2       TEXT('ONDULATO 7 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 7' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA7         5  2       TEXT('ONDULATO 7 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 7' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE7         5  2       TEXT('ONDULATO 7 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 7' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT7         5  2       TEXT('ONDULATO 7 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 7' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB7         5  2       TEXT('ONDULATO 7 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 7' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA7         5  2       TEXT('ONDULATO 7 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 7' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE7         5  2       TEXT('ONDULATO 7 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 7' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT8         5  2       TEXT('ONDULATO 8 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 8' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB8         5  2       TEXT('ONDULATO 8 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 8' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA8         5  2       TEXT('ONDULATO 8 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 8' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE8         5  2       TEXT('ONDULATO 8 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 8' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT8         5  2       TEXT('ONDULATO 8 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 8' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB8         5  2       TEXT('ONDULATO 8 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 8' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA8         5  2       TEXT('ONDULATO 8 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 8' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE8         5  2       TEXT('ONDULATO 8 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 8' 'L.N.M.')
     A                                      EDTCDE(4)
     A            OLIVT9         5  2       TEXT('ONDULATO 9 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 9' 'L.V.T.')
     A                                      EDTCDE(4)
     A            OLIVB9         5  2       TEXT('ONDULATO 9 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 9' 'L.V.B.')
     A                                      EDTCDE(4)
     A            OLIVA9         5  2       TEXT('ONDULATO 9 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 9' 'L.V.A.')
     A                                      EDTCDE(4)
     A            OLIVE9         5  2       TEXT('ONDULATO 9 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 9' 'L.V.M.')
     A                                      EDTCDE(4)
     A            OLINT9         5  2       TEXT('ONDULATO 9 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 9' 'L.N.T.')
     A                                      EDTCDE(4)
     A            OLINB9         5  2       TEXT('ONDULATO 9 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 9' 'L.N.B.')
     A                                      EDTCDE(4)
     A            OLINA9         5  2       TEXT('ONDULATO 9 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 9' 'L.N.A.')
     A                                      EDTCDE(4)
     A            OLINE9         5  2       TEXT('ONDULATO 1 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 1' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT1         7  4       TEXT('ONDULATO 1 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 1' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB1         7  4       TEXT('ONDULATO 1 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 1' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA1         7  4       TEXT('ONDULATO 1 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 1' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE1         7  4       TEXT('ONDULATO 1 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 1' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT1         7  4       TEXT('ONDULATO 1 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 1' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB1         7  4       TEXT('ONDULATO 1 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 1' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA1         7  4       TEXT('ONDULATO 1 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 1' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE1         7  4       TEXT('ONDULATO 1 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 1' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT2         7  4       TEXT('ONDULATO 2 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 2' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB2         7  4       TEXT('ONDULATO 2 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 2' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA2         7  4       TEXT('ONDULATO 2 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 2' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE2         7  4       TEXT('ONDULATO 2 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 2' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT2         7  4       TEXT('ONDULATO 2 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 2' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB2         7  4       TEXT('ONDULATO 2 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 2' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA2         7  4       TEXT('ONDULATO 2 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 2' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE2         7  4       TEXT('ONDULATO 2 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 2' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT3         7  4       TEXT('ONDULATO 3 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 3' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB3         7  4       TEXT('ONDULATO 3 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 3' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA3         7  4       TEXT('ONDULATO 3 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 3' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE3         7  4       TEXT('ONDULATO 3 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 3' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT3         7  4       TEXT('ONDULATO 3 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 3' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB3         7  4       TEXT('ONDULATO 3 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 3' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA3         7  4       TEXT('ONDULATO 3 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 3' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE3         7  4       TEXT('ONDULATO 3 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 3' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT4         7  4       TEXT('ONDULATO 4 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 4' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB4         7  4       TEXT('ONDULATO 4 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 4' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA4         7  4       TEXT('ONDULATO 4 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 4' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE4         7  4       TEXT('ONDULATO 4 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 4' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT4         7  4       TEXT('ONDULATO 4 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 4' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB4         7  4       TEXT('ONDULATO 4 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 4' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA4         7  4       TEXT('ONDULATO 4 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 4' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE4         7  4       TEXT('ONDULATO 4 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 4' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT5         7  4       TEXT('ONDULATO 5 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 5' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB5         7  4       TEXT('ONDULATO 5 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 5' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA5         7  4       TEXT('ONDULATO 5 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 5' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE5         7  4       TEXT('ONDULATO 5 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 5' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT5         7  4       TEXT('ONDULATO 5 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 5' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB5         7  4       TEXT('ONDULATO 5 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 5' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA5         7  4       TEXT('ONDULATO 5 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 5' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE5         7  4       TEXT('ONDULATO 5 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 5' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT6         7  4       TEXT('ONDULATO 6 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 6' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB6         7  4       TEXT('ONDULATO 6 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 6' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA6         7  4       TEXT('ONDULATO 6 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 6' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE6         7  4       TEXT('ONDULATO 6 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 6' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT6         7  4       TEXT('ONDULATO 6 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 6' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB6         7  4       TEXT('ONDULATO 6 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 6' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA6         7  4       TEXT('ONDULATO 6 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 6' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE6         7  4       TEXT('ONDULATO 6 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 6' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT7         7  4       TEXT('ONDULATO 7 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 7' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB7         7  4       TEXT('ONDULATO 7 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 7' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA7         7  4       TEXT('ONDULATO 7 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 7' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE7         7  4       TEXT('ONDULATO 7 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 7' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT7         7  4       TEXT('ONDULATO 7 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 7' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB7         7  4       TEXT('ONDULATO 7 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 7' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA7         7  4       TEXT('ONDULATO 7 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 7' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE7         7  4       TEXT('ONDULATO 7 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 7' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT8         7  4       TEXT('ONDULATO 8 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 8' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB8         7  4       TEXT('ONDULATO 8 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 8' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA8         7  4       TEXT('ONDULATO 8 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 8' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE8         7  4       TEXT('ONDULATO 8 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 8' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT8         7  4       TEXT('ONDULATO 8 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 8' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB8         7  4       TEXT('ONDULATO 8 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 8' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA8         7  4       TEXT('ONDULATO 8 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 8' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE8         7  4       TEXT('ONDULATO 8 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 8' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ELIVT9         7  4       TEXT('ONDULATO 9 LISTINO VECCHIO TE-
     A                                      SO')
     A                                      COLHDG('OND 9' 'L.V.T.')
     A                                      EDTCDE(4)
     A            ELIVB9         7  4       TEXT('ONDULATO 9 LISTINO VECCHIO BA-
     A                                      SSA')
     A                                      COLHDG('OND 9' 'L.V.B.')
     A                                      EDTCDE(4)
     A            ELIVA9         7  4       TEXT('ONDULATO 9 LISTINO VECCHIO AL-
     A                                      TA')
     A                                      COLHDG('OND 9' 'L.V.A.')
     A                                      EDTCDE(4)
     A            ELIVE9         7  4       TEXT('ONDULATO 9 LISTINO VECCHIO MI-
     A                                      CRO')
     A                                      COLHDG('OND 9' 'L.V.M.')
     A                                      EDTCDE(4)
     A            ELINT9         7  4       TEXT('ONDULATO 9 LISTINO NUOVO TESO-
     A                                      ')
     A                                      COLHDG('OND 9' 'L.N.T.')
     A                                      EDTCDE(4)
     A            ELINB9         7  4       TEXT('ONDULATO 9 LISTINO NUOVO BASS-
     A                                      A')
     A                                      COLHDG('OND 9' 'L.N.B.')
     A                                      EDTCDE(4)
     A            ELINA9         7  4       TEXT('ONDULATO 9 LISTINO NUOVO ALTA-
     A                                      ')
     A                                      COLHDG('OND 9' 'L.N.A.')
     A                                      EDTCDE(4)
     A            ELINE9         7  4       TEXT('ONDULATO 1 LISTINO NUOVO MICR-
     A                                      O')
     A                                      COLHDG('OND 1' 'L.N.M.')
     A                                      EDTCDE(4)
     A            ORAINI         4  0       TEXT('ORA INIZIO LAVORO GIORNO')
     A                                      COLHDG('INIZ' 'LAV.')
     A                                      EDTCDE(Z)
     A            ORINIP         4  0       TEXT('ORA INIZIO LAVORAZ.PRESUNTA')
     A                                      COLHDG('INIZ.LAV' 'PRESUNTA')
     A                                      EDTCDE(Z)
     A            ORFINP         4  0       TEXT('ORA FINE LAVORAZ.PRESUNTA')
     A                                      COLHDG('FINE LAV.' 'PRESUNTA')
     A                                      EDTCDE(Z)
     A            OREGIO         2  0       TEXT('ORE LAVORO GIORNO')
     A                                      COLHDG('ORE' 'GIO')
     A                                      EDTCDE(Z)
     A            OREGI1         2  0       TEXT('ORE LAVORO GIORNO')
     A                                      COLHDG('ORE' 'GIO')
     A                                      EDTCDE(Z)
     A            OREGI2         2  0       TEXT('ORE LAVORO GIORNO')
     A                                      COLHDG('ORE' 'GIO')
     A                                      EDTCDE(Z)
     A            ORDES1        11  0       TEXT('ORDINE ESTRATTO 1')
     A                                      COLHDG('ORD.' 'EST1')
     A                                      EDTCDE(Z)
     A            ORDES2        11  0       TEXT('ORDINE ESTRATTO 2')
     A                                      COLHDG('ORD.' 'EST2')
     A                                      EDTCDE(Z)
     A            ORDES3        11  0       TEXT('ORDINE ESTRATTO 3')
     A                                      COLHDG('ORD.' 'EST3')
     A                                      EDTCDE(Z)
     A            ORDES4        11  0       TEXT('ORDINE ESTRATTO 4')
     A                                      COLHDG('ORD.' 'EST4')
     A                                      EDTCDE(Z)
     A            ORDES5        11  0       TEXT('ORDINE ESTRATTO 5')
     A                                      COLHDG('ORD.' 'EST5')
     A                                      EDTCDE(Z)
     A            ORDES6        11  0       TEXT('ORDINE ESTRATTO 6')
     A                                      COLHDG('ORD.' 'EST6')
     A                                      EDTCDE(Z)
     A            ORDES7        11  0       TEXT('ORDINE ESTRATTO 7')
     A                                      COLHDG('ORD.' 'EST7')
     A                                      EDTCDE(Z)
     A            ORDES8        11  0       TEXT('ORDINE ESTRATTO 8')
     A                                      COLHDG('ORD.' 'EST8')
     A                                      EDTCDE(Z)
     A            OREPGM         5  2       TEXT('ORE IMPEGNO PROG.')
     A                                      COLHDG('ORE' 'IMP.PROG')
     A                                      EDTCDE(Z)
     A            OREPG2         5  2       TEXT('ORE IMPEGNO PROG.')
     A                                      COLHDG('ORE' 'IMP.PROG')
     A                                      EDTCDE(Z)
     A            ORETOT         5  2       TEXT('ORE IMPEGNO TOT.')
     A                                      COLHDG('ORE' 'IMP.TOT')
     A                                      EDTCDE(Z)
     A            QTAPGM         9  0       TEXT('QTA IMPEGNO PROG.')
     A                                      COLHDG('QTA' 'IMP.PROG')
     A                                      EDTCDE(Z)
     A            ORETO2         5  2       TEXT('ORE IMPEGNO TOT.')
     A                                      COLHDG('ORE' 'IMP.TOT')
     A                                      EDTCDE(Z)
     A            QTAPG2         9  0       TEXT('QTA IMPEGNO PROG.')
     A                                      COLHDG('QTA' 'IMP.PROG')
     A                                      EDTCDE(Z)
     A            QTACER         3  0       TEXT('QTA TIPO CER.COL.')
     A                                      COLHDG('QTA TIP' 'CER.COL')
     A                                      EDTCDE(Z)
     A            QTAPLC         7  0       TEXT('QTA CONTEGGIO PLC')
     A                                      COLHDG('QTA' 'PLC')
     A                                      EDTCDE(Z)
     A            QTATOT         9  0       TEXT('QTA IMPEGNO TOT.')
     A                                      COLHDG('QTA' 'IMP.TOT')
     A                                      EDTCDE(Z)
     A            QTATO2         9  0       TEXT('QTA IMPEGNO TOT.')
     A                                      COLHDG('QTA' 'IMP.TOT')
     A                                      EDTCDE(Z)
     A            ORARRI         4  0       TEXT('ORA ARRIVO TRASP.')
     A                                      COLHDG('ORA' 'ARRIVO TRASP')
     A                                      EDTCDE(Z)
     A            ORABOL         4  0       TEXT('ORA BOLLA')
     A                                      COLHDG('ORA' 'BOLLA')
     A                                      EDTCDE(Z)
     A            ORULTL         4  2       TEXT('ORA ULTIMA LAVORAZIONE')
     A                                      COLHDG('ORA' 'ULT.LAV.')
     A                                      EDTCDE(Z)
     A            PACPAL         3  0       TEXT('PACCHI PER PALLET')
     A                                      COLHDG('PACCHI' 'PALL.')
     A                                      EDTCDE(Z)
     A            NSFUSI         4  0       TEXT('SFUSI PER PALLET')
     A                                      COLHDG('SFUSI' 'PALL.')
     A                                      EDTCDE(Z)
     A            PERCON         1          TEXT('SPEDIZIONE PER CONTO')
     A                                      COLHDG('X CONTO')
     A            PLISN1         7  2       TEXT('NUOVO PREZZO 1 AL KG')
     A                                      COLHDG('PRZ.1' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN2         7  2       TEXT('NUOVO PREZZO 2 AL KG')
     A                                      COLHDG('PRZ.2' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN3         7  2       TEXT('NUOVO PREZZO 3 AL KG')
     A                                      COLHDG('PRZ.3' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN4         7  2       TEXT('NUOVO PREZZO 4 AL KG')
     A                                      COLHDG('PRZ.4' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN5         7  2       TEXT('NUOVO PREZZO 5 AL KG')
     A                                      COLHDG('PRZ.5' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN6         7  2       TEXT('NUOVO PREZZO 6 AL KG')
     A                                      COLHDG('PRZ.6' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN7         7  2       TEXT('NUOVO PREZZO 7 AL KG')
     A                                      COLHDG('PRZ.7' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN8         7  2       TEXT('NUOVO PREZZO 8 AL KG')
     A                                      COLHDG('PRZ.8' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISN9         7  2       TEXT('NUOVO PREZZO 9 AL KG')
     A                                      COLHDG('PRZ.9' 'NUOVO')
     A                                      EDTCDE(4)
     A            PLISV1         7  2       TEXT('VECCHIO PREZZO 1 AL KG')
     A                                      COLHDG('PRZ.1' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV2         7  2       TEXT('VECCHIO PREZZO 2 AL KG')
     A                                      COLHDG('PRZ.2' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV3         7  2       TEXT('VECCHIO PREZZO 3 AL KG')
     A                                      COLHDG('PRZ.3' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV4         7  2       TEXT('VECCHIO PREZZO 4 AL KG')
     A                                      COLHDG('PRZ.4' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV5         7  2       TEXT('VECCHIO PREZZO 5 AL KG')
     A                                      COLHDG('PRZ.5' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV6         7  2       TEXT('VECCHIO PREZZO 6 AL KG')
     A                                      COLHDG('PRZ.6' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV7         7  2       TEXT('VECCHIO PREZZO 7 AL KG')
     A                                      COLHDG('PRZ.7' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV8         7  2       TEXT('VECCHIO PREZZO 8 AL KG')
     A                                      COLHDG('PRZ.8' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PLISV9         7  2       TEXT('VECCHIO PREZZO 9 AL KG')
     A                                      COLHDG('PRZ.9' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISN1         7  2       TEXT('NUOVO PREZZO 1 AL KG')
     A                                      COLHDG('PRZ.1' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN2         7  2       TEXT('NUOVO PREZZO 2 AL KG')
     A                                      COLHDG('PRZ.2' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN3         7  2       TEXT('NUOVO PREZZO 3 AL KG')
     A                                      COLHDG('PRZ.3' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN4         7  2       TEXT('NUOVO PREZZO 4 AL KG')
     A                                      COLHDG('PRZ.4' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN5         7  2       TEXT('NUOVO PREZZO 5 AL KG')
     A                                      COLHDG('PRZ.5' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN6         7  2       TEXT('NUOVO PREZZO 6 AL KG')
     A                                      COLHDG('PRZ.6' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN7         7  2       TEXT('NUOVO PREZZO 7 AL KG')
     A                                      COLHDG('PRZ.7' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN8         7  2       TEXT('NUOVO PREZZO 8 AL KG')
     A                                      COLHDG('PRZ.8' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISN9         7  2       TEXT('NUOVO PREZZO 9 AL KG')
     A                                      COLHDG('PRZ.9' 'NUOVO')
     A                                      EDTCDE(4)
     A            ELISV1         7  2       TEXT('VECCHIO PREZZO 1 AL KG')
     A                                      COLHDG('PRZ.1' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV2         7  2       TEXT('VECCHIO PREZZO 2 AL KG')
     A                                      COLHDG('PRZ.2' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV3         7  2       TEXT('VECCHIO PREZZO 3 AL KG')
     A                                      COLHDG('PRZ.3' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV4         7  2       TEXT('VECCHIO PREZZO 4 AL KG')
     A                                      COLHDG('PRZ.4' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV5         7  2       TEXT('VECCHIO PREZZO 5 AL KG')
     A                                      COLHDG('PRZ.5' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV6         7  2       TEXT('VECCHIO PREZZO 6 AL KG')
     A                                      COLHDG('PRZ.6' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV7         7  2       TEXT('VECCHIO PREZZO 7 AL KG')
     A                                      COLHDG('PRZ.7' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV8         7  2       TEXT('VECCHIO PREZZO 8 AL KG')
     A                                      COLHDG('PRZ.8' 'VECCHIO')
     A                                      EDTCDE(4)
     A            ELISV9         7  2       TEXT('VECCHIO PREZZO 9 AL KG')
     A                                      COLHDG('PRZ.9' 'VECCHIO')
     A                                      EDTCDE(4)
     A            PORTAT         2  0       TEXT('PORTATA')
     A                                      COLHDG('PORTATA')
     A                                      EDTCDE(Z)
     A            PORTMC         3  0       TEXT('PORTATA METRI CUBI')
     A                                      COLHDG('PORT. MC.')
     A                                      EDTCDE(Z)
     A            PORTQL         3  0       TEXT('PORTATA QUINTALI')
     A                                      COLHDG('PORT. Q.LI')
     A                                      EDTCDE(Z)
     A            POSFIS         2S 0       TEXT('POSIZIONE FISICA')
     A                                      COLHDG('POS.FIS.')
     A                                      EDTCDE(Z)
     A            POSIZ1         1  0       TEXT('POSIZIONE 1° SOTTOTIPO')
     A                                      COLHDG('1°' 'POS')
     A                                      EDTCDE(Z)
     A            POSIZ2         1  0       TEXT('POSIZIONE 2° SOTTOTIPO')
     A                                      COLHDG('2°' 'POS')
     A                                      EDTCDE(Z)
     A            POSIZ3         1  0       TEXT('POSIZIONE 3° SOTTOTIPO')
     A                                      COLHDG('3°' 'POS')
     A                                      EDTCDE(Z)
     A            POSIZ4         1  0       TEXT('POSIZIONE 4° SOTTOTIPO')
     A                                      COLHDG('4°' 'POS')
     A                                      EDTCDE(Z)
     A            POSIZS         1  0       TEXT('POSIZIONE SOTTOTIPO')
     A                                      COLHDG('POS')
     A                                      EDTCDE(Z)
     A            PROABB         1  0       TEXT('PROGR.RIGHE ABBINAMENTI')
     A                                      COLHDG('PRO' 'ABB')
     A                                      EDTCDE(Z)
     A            PRCER          3  0       TEXT('PROGR.RIGHE CERT.COLLAUDO')
     A                                      COLHDG('PRO' 'CER')
     A                                      EDTCDE(Z)
     A            PROCLD         1  0       TEXT('PROGR.DESCRI.SUPPL.CLI./FOR.')
     A                                      COLHDG('PROG' 'CLID')
     A                                      EDTCDE(Z)
     A            PRODES         2          TEXT('PROVINCIA DESTINATARIO')
     A                                      COLHDG('PROV.')
     A            PROLAV         2  0       TEXT('PROGRESSIVO ORDINE DI LAVORO')
     A                                      COLHDG('PROG' 'ORD.')
     A                                      EDTCDE(Z)
     A            PROGEN         2  0       TEXT('PROGRESSIVO DI PROVENIENZA')
     A                                      COLHDG('PROG' 'PROV.')
     A                                      EDTCDE(Z)
     A            PROTNI         5  0       TEXT('N° PROTOCOLLO DICH. IVA')
     A                                      COLHDG('PROT' 'IVA')
     A                                      EDTCDE(Z)
     A            PROCL     R               REFFLD(PROCL DIZACGV3)
     A            PRIORI         2  0       TEXT('PRIORITA" DI LAVORAZIONE')
     A                                      COLHDG('PRIORITA''')
     A                                      EDTCDE(Z)
     A            PROCON         2  0       TEXT('PROGRESSIVO CONSUMI')
     A                                      COLHDG('PROG' 'CON.')
     A                                      EDTCDE(Z)
     A            PRORCO         3  0       TEXT('PROGRESSIVO RIGHE CONFERME')
     A                                      COLHDG('PROG' 'CONF')
     A                                      EDTCDE(Z)
     A            PROVG     R               REFFLD(PROVG DIZACGV3)
     A            PRZACS        11  2       TEXT('PREZZO SU CONFERMA')
     A                                      COLHDG('PREZZO' 'CONFERMA')
     A                                      EDTCDE(4)
     A            EURACS        11  2       TEXT('PREZZO SU CONFERMA')
     A                                      COLHDG('PREZZO' 'CONFERMA')
     A                                      EDTCDE(4)
     A            PRZACQ        11  2       TEXT('PREZZO DI ACQUISTO')
     A                                      COLHDG('PREZZO' 'ACQUISTO')
     A                                      EDTCDE(4)
     A            EURACQ        11  2       TEXT('PREZZO DI ACQUISTO')
     A                                      COLHDG('PREZZO' 'ACQUISTO')
     A                                      EDTCDE(4)
     A            PRZC01         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 1')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 1')
     A                                      EDTCDE(Z)
     A            PRZC02         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 2')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 2')
     A                                      EDTCDE(Z)
     A            PRZC03         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 3')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 3')
     A                                      EDTCDE(Z)
     A            PRZC04         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 4')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 4')
     A                                      EDTCDE(Z)
     A            PRZC05         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 5')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 5')
     A                                      EDTCDE(Z)
     A            PRZC06         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 6')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 6')
     A                                      EDTCDE(Z)
     A            PRZC07         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 7')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 7')
     A                                      EDTCDE(Z)
     A            PRZC08         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 8')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 8')
     A                                      EDTCDE(Z)
     A            PRZC09         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 9')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 9')
     A                                      EDTCDE(Z)
     A            PRZC10         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 10')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC11         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 11')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC12         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 12')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC13         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 13')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC14         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 14')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC15         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 15')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC16         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 16')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC17         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 17')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC18         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 18')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC19         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 19')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PRZC20         7  0       TEXT('PRZ. TRASP. CLASSIFICAZIONE M-
     A                                      EZZO 20')
     A                                      COLHDG('PRZ.TRAS.' 'MEZZO 0')
     A                                      EDTCDE(Z)
     A            PZALVE         2  0       TEXT('PEZZI ALVEARE')
     A                                      COLHDG('PZ.' 'ALV.')
     A                                      EDTCDE(Z)
     A            PZFUS1         2  0       TEXT('PEZZI 1à FUSTELLA')
     A                                      COLHDG('PZ.' 'FUS1')
     A                                      EDTCDE(Z)
     A            PZFUS2         2  0       TEXT('PEZZI 2à FUSTELLA')
     A                                      COLHDG('PZ' 'FUS2')
     A                                      EDTCDE(Z)
     A            PZINTE         2  0       TEXT('PEZZI INTERNO SCATOLA')
     A                                      COLHDG('PZ.' 'INT')
     A                                      EDTCDE(Z)
     A            PZFUST         2  0       TEXT('PEZZI FUSTELLA')
     A                                      COLHDG('PZ' 'FUST')
     A                                      EDTCDE(Z)
     A            PRZCOS        11  2       TEXT('PREZZO DI COSTO')
     A                                      COLHDG('PREZZO' 'COSTO')
     A                                      EDTCDE(4)
     A            EURCOS        11  2       TEXT('PREZZO DI COSTO')
     A                                      COLHDG('PREZZO' 'COSTO')
     A                                      EDTCDE(4)
     A            PRZLIS        11  2       TEXT('PREZZO DI LISTINO')
     A                                      COLHDG('PREZZO' 'LISTINO')
     A                                      EDTCDE(4)
     A            EURLIS        11  2       TEXT('PREZZO DI LISTINO')
     A                                      COLHDG('PREZZO' 'LISTINO')
     A                                      EDTCDE(4)
     A            PRZCAR        11  2       TEXT('COSTO DELLE CARTE')
     A                                      COLHDG('COSTO' 'CARTE')
     A                                      EDTCDE(4)
     A            EURCAR        11  2       TEXT('COSTO DELLE CARTE')
     A                                      COLHDG('COSTO' 'CARTE')
     A                                      EDTCDE(4)
     A            PRZTRA        11  2       TEXT('COSTO TRASPORTO EX.£.TRASF.')
     A                                      COLHDG('COSTO' 'TRASP.')
     A                                      EDTCDE(4)
     A            EURTRA        11  2       TEXT('COSTO TRASFORMAZ.')
     A                                      COLHDG('COSTO' 'TRASF.')
     A                                      EDTCDE(4)
     A            PRZAGG        11  2       TEXT('COSTO AGGIUNTIVI')
     A                                      COLHDG('COSTO' 'AGG. ')
     A                                      EDTCDE(4)
     A            EURAGG        11  2       TEXT('COSTO AGGIUNTIVI')
     A                                      COLHDG('COSTO' 'AGG. ')
     A                                      EDTCDE(4)
     A            PRZSCP        11  2       TEXT('IMP. SCONTO PAGAM.')
     A                                      COLHDG('SCONTO' 'PAGAM.')
     A                                      EDTCDE(4)
     A            EURSCP        11  2       TEXT('IMP. SCONTO PAGAM.')
     A                                      COLHDG('SCONTO' 'PAGAM.')
     A                                      EDTCDE(4)
     A            PZLUNG         2  0       TEXT('PEZZI PER LUNGHEZZA')
     A                                      COLHDG('PZ X' 'LGT')
     A                                      EDTCDE(Z)
     A            PZALTE         2  0       TEXT('PEZZI PER ALTEZZA')
     A                                      COLHDG('PZ X' 'ALT')
     A                                      EDTCDE(Z)
     A            PRZVEN        11  2       TEXT('PREZZO DI VENDITA')
     A                                      COLHDG('PRZ.VEND.')
     A                                      EDTCDE(4)
     A            EURVEN        11  2       TEXT('PREZZO DI VENDITA')
     A                                      COLHDG('PRZ.VEND.')
     A                                      EDTCDE(4)
     A            PRZORI        11  2       TEXT('PREZZO ORIGINARIO')
     A                                      COLHDG('PRZ.ORIG.')
     A                                      EDTCDE(4)
     A            EURORI        11  2       TEXT('PREZZO ORIGINARIO')
     A                                      COLHDG('PRZ.ORIG.')
     A                                      EDTCDE(4)
     A            PRZVGG         9  2       TEXT('PREZZO VIAGGIO')
     A                                      COLHDG('PREZZO' 'VIAGGIO')
     A                                      EDTCDE(4)
     A            EURVGG         9  2       TEXT('PREZZO VIAGGIO')
     A                                      COLHDG('PREZZO' 'VIAGGIO')
     A                                      EDTCDE(4)
     A            QTDAFA         7  0       TEXT('QUANTITA'' DA FATTURARE')
     A                                      COLHDG('QTA''' 'DA FATT')
     A                                      EDTCDE(4)
     A            QTORIG         7  0       TEXT('QUANTITA'' ORIGINARIA')
     A                                      COLHDG('QTA''' 'ORIGINE')
     A                                      EDTCDE(4)
     A            QTCONS         7  0       TEXT('QUANTITA'' CONSEGNATA')
     A                                      COLHDG('QT.' 'CONS.')
     A                                      EDTCDE(4)
     A            QTCONO         7  0       TEXT('QUANTITA''ORDINE ORIGINE')
     A                                      COLHDG('QT.' 'ORIG.')
     A            QTDISP         7  0       TEXT('QUANTITA'' DISPOSTA')
     A                                      COLHDG('QT. DISPOSTA')
     A                                      EDTCDE(4)
     A            QTGCKG        11  2       TEXT('GIACENZA CARTA IN U/M')
     A                                      COLHDG('GIAC. KG.')
     A                                      EDTCDE(L)
     A            QTINVE        11  2       TEXT('Q.TA INVENT. IN U/M')
     A                                      COLHDG('Q.TA INV.')
     A                                      EDTCDE(L)
     A            QTGCBO         7  0       TEXT('GIAC.BOBINE/KG PESO PALL.')
     A                                      COLHDG('GIA.BOB/KG PALL.')
     A                                      EDTCDE(L)
     A            BOINVE         7  0       TEXT('Q.TA INVENT.IN BOBINE')
     A                                      COLHDG('INV.BOB.')
     A                                      EDTCDE(L)
     A            QTIMAB         7  0       TEXT('Q.TA IMP.ABB./MMC X PALLET')
     A                                      COLHDG('IMP.ABB/MMC PALL.')
     A                                      EDTCDE(4)
     A            QTGIAC         9  0       TEXT('QUANTITA'' GIACENZA')
     A                                      COLHDG('GIACENZA')
     A                                      EDTCDE(L)
     A            QTGIAA         9  0       TEXT('GIACENZA ACQUISTATA')
     A                                      COLHDG('GIAC.ACQ.')
     A                                      EDTCDE(L)
     A            QTGIAR         9  0       TEXT('GIACENZA RESI')
     A                                      COLHDG('GIAC.RESI')
     A                                      EDTCDE(L)
     A            QTGIAP         7  0       TEXT('QTA'' GIAC. PARTI  ')
     A                                      COLHDG('GIAC.PAR.')
     A                                      EDTCDE(L)
     A            QTGISA         7  0       TEXT('QTA'' GIAC.SEM.ACQ.')
     A                                      COLHDG('SEM.ACQ.')
     A                                      EDTCDE(L)
     A            QTCOL1         7  0       TEXT('QUANTITA'' COLORE 1 ')
     A                                      COLHDG('QT.' 'COL1')
     A                                      EDTCDE(4)
     A            QTCOL2         7  0       TEXT('QUANTITA'' COLORE 2 ')
     A                                      COLHDG('QT.' 'COL1')
     A                                      EDTCDE(4)
     A            QTCOL3         7  0       TEXT('QUANTITA'' COLORE 3 ')
     A                                      COLHDG('QT.' 'COL1')
     A                                      EDTCDE(4)
     A            QTCOL4         7  0       TEXT('QUANTITA'' COLORE 4 ')
     A                                      COLHDG('QT.' 'COL1')
     A                                      EDTCDE(4)
     A            QTLAVO         7  0       TEXT('QUANTITA'' IN LAV.NE / CONFER-
     A                                      MA')
     A                                      COLHDG('QT.IN' 'LAV.NE')
     A                                      EDTCDE(4)
     A            QTORD     R               REFFLD(QTORD DIZACGV3)
     A            QTORDL         7  0       TEXT('QUANTITA'' ORDINE LAVORO')
     A                                      COLHDG('QT.ORD' 'LAV.')
     A                                      EDTCDE(4)
     A            QTRIC     R               REFFLD(QTRIC DIZACGV3)
     A            QTTOOR         7  0       TEXT('QUANTITA'' TOTALE ORDINE')
     A                                      COLHDG('QT.' 'TOT')
     A                                      EDTCDE(4)
     A            QTREOR         7  0       TEXT('QUANTITA'' RESIDUO ORDINE')
     A                                      COLHDG('QT.' 'RES')
     A                                      EDTCDE(4)
     A            QTRCON         7  0       TEXT('Q.TA RES. ORD.SPEDIZIONE')
     A                                      COLHDG('QT.' 'SPE')
     A            QTRIMM         7  0       TEXT('Q.TA RES. ORD.IMMESSI')
     A                                      COLHDG('QT.' 'IMM')
     A            QTTCON         7  0       TEXT('QUANTITA'' TESTATA CONF.')
     A                                      COLHDG('QT.' 'TES')
     A            QTSCE1         7  0       TEXT('Q.SCATOLE 1° ESTR.')
     A                                      COLHDG('Q.SCAT.' '1° ESTR')
     A                                      EDTCDE(4)
     A            QTPALL         7  0       TEXT('QUANTITA'' PIANALI')
     A                                      COLHDG('QTA''' 'PIANALI')
     A                                      EDTCDE(4)
     A            QTSOTT         7  0       TEXT('QUANTITA'' DA SOTTRARRE')
     A                                      COLHDG('QTA''' 'DA SOTT')
     A                                      EDTCDE(4)
     A            QTSOMM         7  0       TEXT('QUANTITA'' DA SOMMARE')
     A                                      COLHDG('QTA''' 'DA SOMM')
     A                                      EDTCDE(4)
     A            QTTOTF         9  0       TEXT('TOTALE QUANTITA'' FATTURATA')
     A                                      COLHDG('Q.TOT.' 'FATT.')
     A                                      EDTCDE(4)
     A            QTTOTO         9  0       TEXT('TOTALE QUANTITA'' ORDINATA')
     A                                      COLHDG('Q.TOT.' 'ORD.')
     A                                      EDTCDE(4)
     A            QTTOTP         9  0       TEXT('TOTALE QUANTITA'' PRODOTTA')
     A                                      COLHDG('Q.TOT.' 'PROD.')
     A                                      EDTCDE(4)
     A            QTTOTS         9  0       TEXT('TOTALE QUANTITA'' SPEDITA')
     A                                      COLHDG('Q.TOT.' 'SPED.')
     A                                      EDTCDE(4)
     A            QTTRSF         7  0       TEXT('QUANTITA'' TRASFERITA')
     A                                      COLHDG('QT.' 'TRASF.')
     A                                      EDTCDE(4)
     A            QTRILA         7  0       TEXT('QTA RIPASSATA IN PROD.')
     A                                      COLHDG('QT.' 'RILAV.')
     A            QTPFRI         7  0       TEXT('QTA RILAV. VERSATA A P.F.')
     A                                      COLHDG('QT.RIL' 'A P.F.')
     A            QTMOVC         7  0       TEXT('QTA MOVIMENTATA CARTONE')
     A                                      COLHDG('MOV.' 'CART.')
     A            QTMOVS         7  0       TEXT('QTA MOVIMENTATA SEMILAV.')
     A                                      COLHDG('MOV.' 'SEMIL.')
     A            QTSCMO         7  0       TEXT('QTA SCARTO DEL MONTATORE')
     A                                      COLHDG('SCAR' 'MONT.')
     A            QTSPMO         7  0       TEXT('QTA SPEDITA DAL MONTATORE')
     A                                      COLHDG('SPEDITA' 'DAL MONT')
     A            QTCARI         7  0       TEXT('CARTONE RICEVUTO DA ALTRO OL')
     A                                      COLHDG('CARTONE' 'RICEV.')
     A            QTCACE         7  0       TEXT('CARTONE CEDUTO AD ALTRO O/L')
     A                                      COLHDG('CARTONE' 'CEDUTO')
     A            QTSPCO         7  0       TEXT('QUANTITA'' SPEDITA CONSERVIER-
     A                                      I')
     A                                      COLHDG('QT.SPED' 'CONSER')
     A                                      EDTCDE(4)
     A            QTABBI         7  0       TEXT('QUANTITA'' ABBINATA')
     A                                      COLHDG('QTA''' 'ABBINATA')
     A                                      EDTCDE(4)
     A            QTMAC1         7  0       TEXT('QUANTITA'' MACCHINA 1')
     A                                      COLHDG('QTA''' 'MACC1')
     A                                      EDTCDE(4)
     A            QTMAC2         7  0       TEXT('QUANTITA'' MACCHINA 2')
     A                                      COLHDG('QTA''' 'MACC2')
     A                                      EDTCDE(4)
     A            QTMAC3         7  0       TEXT('QUANTITA'' MACCHINA 3')
     A                                      COLHDG('QTA''' 'MACC3')
     A                                      EDTCDE(4)
     A            QTMAC4         7  0       TEXT('QUANTITA'' MACCHINA 4')
     A                                      COLHDG('QTA''' 'MACC4')
     A                                      EDTCDE(4)
     A            QTMAC5         7  0       TEXT('QUANTITA'' MACCHINA 5')
     A                                      COLHDG('QTA''' 'MACC5')
     A                                      EDTCDE(L)
     A            QTSEMI         7  0       TEXT('QUANTITA'' SEMILAV.')
     A                                      COLHDG('QTA''' 'SEMI')
     A                                      EDTCDE(4)
     A            QTSPED         7  0       TEXT('QUANTITA'' SPEDITA')
     A                                      COLHDG('QTA''' 'SPED')
     A                                      EDTCDE(4)
     A            QTSCE2         7  0       TEXT('Q.SCATOLE 2° ESTR.')
     A                                      COLHDG('Q.SCAT.' '2° ESTR')
     A                                      EDTCDE(4)
     A            QTSCE3         7  0       TEXT('Q.SCATOLE 3° ESTR.')
     A                                      COLHDG('Q.SCAT.' '3° ESTR')
     A                                      EDTCDE(4)
     A            QTSCE4         7  0       TEXT('Q.SCATOLE 4° ESTR.')
     A                                      COLHDG('Q.SCAT.' '4° ESTR')
     A                                      EDTCDE(4)
     A            QTPAL1         3  0       TEXT('QUANTITA'' PALLET 1')
     A                                      COLHDG('QT.' 'PAL1')
     A                                      EDTCDE(4)
     A            QTPAL2         3  0       TEXT('QUANTITA'' PALLET 2')
     A                                      COLHDG('QT.' 'PAL2')
     A                                      EDTCDE(4)
     A            QTPAL3         3  0       TEXT('QUANTITA'' PALLET 3')
     A                                      COLHDG('QT.' 'PAL3')
     A                                      EDTCDE(4)
     A            QTPAL4         3  0       TEXT('QUANTITA'' PALLET 4')
     A                                      COLHDG('QT.' 'PAL4')
     A                                      EDTCDE(4)
     A            QTPAL5         3  0       TEXT('QUANTITA'' PALLET 5')
     A                                      COLHDG('QT.' 'PAL5')
     A            QTPAL6         3  0       TEXT('QUANTITA'' PALLET 6')
     A                                      COLHDG('QT.' 'PAL6')
     A            QTPAL7         3  0       TEXT('QUANTITA'' PALLET 7')
     A                                      COLHDG('QT.' 'PAL7')
     A            QTPAL8         3  0       TEXT('QUANTITA'' PALLET 8')
     A                                      COLHDG('QT.' 'PAL8')
     A            QTPAL9         3  0       TEXT('QUANTITA'' PALLET 9')
     A                                      COLHDG('QT.' 'PAL9')
     A            QTPA10         3  0       TEXT('QUANTITA''PALLET 10')
     A                                      COLHDG('QT.' 'PAL10')
     A            QTPAC1         5  0       TEXT('QUANTITA'' PACCHI 1')
     A                                      COLHDG('QT.' 'PAC1')
     A                                      EDTCDE(4)
     A            QTPAC2         5  0       TEXT('QUANTITA'' PACCHI 2')
     A                                      COLHDG('QT.' 'PAC2')
     A                                      EDTCDE(4)
     A            QTPAC3         5  0       TEXT('QUANTITA'' PACCHI 3')
     A                                      COLHDG('QT.' 'PAC3')
     A                                      EDTCDE(4)
     A            QTPAC4         5  0       TEXT('QUANTITA'' PACCHI 4')
     A                                      COLHDG('QT.' 'PAC4')
     A                                      EDTCDE(4)
     A            QTVARI         7  0       TEXT('QUANTITA'' PER VARIAZIONI')
     A                                      COLHDG('QT. X' 'VARIAZ.')
     A                                      EDTCDE(4)
     A            QTACQU         7  0       TEXT('QUANTITA'' ACQUISTATA P.F.')
     A                                      COLHDG('QT. ACQ.''P.F.')
     A                                      EDTCDE(4)
     A            QTACQS         7  0       TEXT('Q.TA'' ACQUISTATA SPEDITA')
     A                                      COLHDG('QT. ACQ.' 'SPEDITA')
     A                                      EDTCDE(4)
     A            QTACSE         7  0       TEXT('Q.TA'' SEMILAV.ACQUISTATA')
     A                                      COLHDG('QT. ACQ.' 'SEMILAV')
     A                                      EDTCDE(4)
     A            QTRESA         7  0       TEXT('QUANTITA'' RESA DA CLIENTE')
     A                                      COLHDG('QT.A' 'RESA')
     A                                      EDTCDE(4)
     A            QTTRAS         7  0       TEXT('QUANTITA'' TRASFERITA')
     A                                      COLHDG('QT.A' 'TRASF.')
     A                                      EDTCDE(4)
     A            QTREFI         7  0       TEXT('QUANTITA'' A REFILI/SCARTI')
     A                                      COLHDG('QT.A' 'REF/SC.')
     A                                      EDTCDE(4)
     A            QTBOLL         7  0       TEXT('QUANTITA'' BOLLA')
     A                                      COLHDG('QT.' 'BOLLA')
     A                                      EDTCDE(4)
     A            QTFOGL         7  0       TEXT('QUANTITA'' FOGLI PRODOTTI')
     A                                      COLHDG('FOGLI' 'PROD.')
     A                                      EDTCDE(4)
     A            QTPROD         7  0       TEXT('QUANTITA'' PRODOTTA')
     A                                      COLHDG('QTA''' 'PROD.')
     A                                      EDTCDE(4)
     A            RASVET        20          TEXT('RAGIONE SOCIALE VETTORE')
     A                                      COLHDG('RAG.SOC. VETTORE')
     A            RASCL     R               REFFLD(RASCL DIZACGV3)
     A            RASFO     R               REFFLD(RASCL DIZACGV3)
     A            RASDES        35          TEXT('RAGIONE SOCIALE DESTINATARIO')
     A                                      COLHDG('DESTINATARIO')
     A            RBMAT          3          TEXT('MATRICOLA CONTO ORDINANTE DEL-
     A                                       CREDITORE')
     A                                      COLHDG('MATR')
     A            RBCAT          2          TEXT('CATEGORIA CONTO ORDINANTE DEL-
     A                                       CREDITORE')
     A                                      COLHDG('CAT')
     A            RBNCC          6          TEXT('NUMERO    CONTO ORDINANTE DEL-
     A                                       CREDITORE')
     A                                      COLHDG('N° C/C')
     A            RBABI          5S 0       TEXT('CODICE ABI')
     A                                      COLHDG('COD.' 'ABI')
     A            RBCAB          5S 0       TEXT('CODICE C.A.B. SPORTELLO')
     A                                      COLHDG('COD.' 'C.A.B.')
     A            RBDES         20          TEXT('DESCR.BANCA/NOME SUPPORTO')
     A                                      COLHDG('BANCA/SUPPORTO')
     A            RBFLG          1          TEXT('FLAG BANCA SCONTO/APPOGG.')
     A                                      COLHDG('SC./APP')
     A            RIFCLI        12          TEXT('RIFERIMENTO ORDINE CLIENTE')
     A                                      COLHDG('ORDINE CLI.')
     A            RIGH12        12          TEXT('STRINGA A DISPOSIZ.')
     A                                      COLHDG('STRINGA')
     A            RAGART        15          TEXT('COD.SU CUI RAGGRUP.')
     A                                      COLHDG('COD.RAG')
     A            CUBART         5  0       TEXT('CUBATURA UNITARIA MCX1000')
     A                                      COLHDG('CUBATURA')
     A            PESART         7  2       TEXT('PESO IN KG.')
     A                                      COLHDG('PESO')
     A            DECAR2        25          TEXT('DESCRIZIONE AGGIUNT.')
     A                                      COLHDG('DES.AGG.')
     A            CDFOA1         6          TEXT('1° FORNITORE ABITUALE')
     A                                      COLHDG('1° FORN.AB.')
     A            CDFOA2         6          TEXT('2° FORNITORE ABITUALE')
     A                                      COLHDG('2° FORN.AB.')
     A            CDFOA3         6          TEXT('3° FORNITORE ABITUALE')
     A                                      COLHDG('3° FORN.AB.')
     A            TEMRIO         3  0       TEXT('GG.PER CONSEGNA')
     A                                      COLHDG('GG.CONS.')
     A            SEZION         3          TEXT('SEZIONE MACCHINA')
     A                                      COLHDG('SEZIONE')
     A            RIFDIS        20          TEXT('RIFERIM.DISEGNO')
     A                                      COLHDG('RIF.DIS.')
     A            DAULCA         8  0       TEXT('DATA ULTIMO CARICO')
     A                                      COLHDG('ULT.CARICO')
     A            DAULSC         8  0       TEXT('DATA ULTIMO SCARICO/PRELIEVO')
     A                                      COLHDG('ULT.SCAR.')
     A            TEMDUR         3  0       TEXT('GG.DURATA PER SOSTITUZIONE')
     A                                      COLHDG('GG.DUR.')
     A            QTSERI         5          TEXT('N°PEZZI IN MACCHINA SERIE COM-
     A                                       PLETA')
     A                                      COLHDG('PZ.SERIE')
     A            TEMSOS         3  0       TEXT('ORE X SOSTITUZIONE')
     A                                      COLHDG('ORE.SOS')
     A            CODUBI         5          TEXT('COD.UBICAZIONE')
     A                                      COLHDG('COD.UBI')
     A            QTINOR         9  2       TEXT('Q.TA IN ORDINE')
     A                                      COLHDG('IN ORD.')
     A            PRECON         7  0       TEXT('PREVISIONE CONSUMO')
     A                                      COLHDG('PREVIS.')
     A            PRCONA         7  0       TEXT('PROGRESS.CONSUMI ANNO')
     A                                      COLHDG('PROGRESS.')
     A            MEDCON         7  0       TEXT('CONSUMO MEDIO ANNO/SCORTA')
     A                                      COLHDG('CONS.MED./SCORTA')
     A            NUMERO        12          TEXT('NUMERO ARCH.S/F X RIFERIM.')
     A                                      COLHDG('NUM.ARCH.')
     A            RIFPAL         6  0       TEXT('RIFERIMENTO RESTITUZIONE PALL-
     A                                      ET')
     A                                      COLHDG('RIF.REST' 'PALLET')
     A                                      EDTCDE(Z)
     A            RRNBSC         5  0       TEXT('NUMERO RELATIVO RECORD X BSC')
     A                                      COLHDG('RRN' 'BSC')
     A                                      EDTCDE(Z)
     A            SCABAT         1          TEXT('CONTEGGIO IN SCATOLE O IN BAT-
     A                                      TUTE')
     A                                      COLHDG('SCA' 'BAT')
     A**                                    VALUES('S' 'B')
     A            SCTOFU         5  2       TEXT('PERCENTUALE DI SCONTO')
     A                                      COLHDG('%' 'SCT')
     A                                      EDTCDE(4)
     A            SCTOFS         5  2       TEXT('PERCENTUALE DI SCONTO')
     A                                      COLHDG('%' 'SCT')
     A                                      EDTCDE(4)
     A            SCTOIN         5  2       TEXT('PERCENTUALE DI SCONTO')
     A                                      COLHDG('%' 'SCT')
     A                                      EDTCDE(4)
     A            SCTOCA         5  2       TEXT('PERCENTUALE DI SCONTO')
     A                                      COLHDG('%' 'SCT')
     A                                      EDTCDE(4)
     A            SCTOAM         5  2       TEXT('PERCENTUALE DI SCONTO')
     A                                      COLHDG('%' 'SCT')
     A                                      EDTCDE(4)
     A            SPECON        27          TEXT('SPECIFICA PER CONFERMA')
     A                                      COLHDG('SPECIF. X CONFERMA')
     A            SPEORI        27          TEXT('SPECIFICA ORIGINARIA')
     A                                      COLHDG('SPECIF.ORIGINE')
     A            SPELAV        27          TEXT('SPECIFICA DI LAVORAZ.')
     A                                      COLHDG('SPECIF.LAVORAZ.')
     A            SPEDAT         8  0       TEXT('DATA X SPEDIZIONE')
     A                                      COLHDG('DATA SPED.')
     A            SPEUM          2          TEXT('U.M. X SPEDIZIONE')
     A                                      COLHDG('UM SPED.')
     A            SPEQTA         7  0       TEXT('QTA X SPEDIZIONE')
     A                                      COLHDG('QT SPED.')
     A            SPESAL         1          TEXT('FL X SPEDITO')
     A                                      COLHDG('FL SPE.')
     A            SPENOT        25          TEXT('NOTE X SPEDIZIONE')
     A                                      COLHDG('NOTE SPED.')
     A            SQANAD         1  0       TEXT('SEQUANZA ANADES')
     A                                      COLHDG('SEQ.' 'ANADE')
     A                                      EDTCDE(Z)
     A            SQMACC         2  0       TEXT('SEQUANZA MACCHINA')
     A                                      COLHDG('SEQ.' 'MACC.')
     A                                      EDTCDE(Z)
     A            SQSTAM         2  0       TEXT('SEQUANZA DI STAMPA')
     A                                      COLHDG('SEQ.' 'STAMPA')
     A                                      EDTCDE(Z)
     A            STACA1         1          TEXT('STAMPA GRAMM.1 SU LISTINO')
     A                                      COLHDG('ST.1')
     A            STACA2         1          TEXT('STAMPA GRAMM.2 SU LISTINO')
     A                                      COLHDG('ST.2')
     A            STACA3         1          TEXT('STAMPA GRAMM.3 SU LISTINO')
     A                                      COLHDG('ST.3')
     A            STACA4         1          TEXT('STAMPA GRAMM.4 SU LISTINO')
     A                                      COLHDG('ST.4')
     A            STACA5         1          TEXT('STAMPA GRAMM.5 SU LISTINO')
     A                                      COLHDG('ST.5')
     A            STACA6         1          TEXT('STAMPA GRAMM.6 SU LISTINO')
     A                                      COLHDG('ST.6')
     A            STACA7         1          TEXT('STAMPA GRAMM.7 SU LISTINO')
     A                                      COLHDG('ST.7')
     A            STACA8         1          TEXT('STAMPA GRAMM.8 SU LISTINO')
     A                                      COLHDG('ST.8')
     A            STACA9         1          TEXT('STAMPA GRAMM.9 SU LISTINO')
     A                                      COLHDG('ST.9')
     A            STFATT         1          TEXT('STATO AVANZAMENTO FATTURA')
     A                                      COLHDG('STATO')
     A            STLAVO         1          TEXT('STATO AVANZAMENTO')
     A                                      COLHDG('STATO')
     A**                                    VALUES('0' '1' '2' '3' '4' '5' '9')
     A            STPROG         1          TEXT('STATO PROGRAMMAZ. O/L')
     A                                      COLHDG('STATO' 'PROGR.')
     A            STRIGA         1          TEXT('STATO DELLA RIGA')
     A                                      COLHDG('STATO' 'RIGA')
     A**                                    VALUES('0' '1' '2')
     A            STORDI         1          TEXT('STATO ORDINE')
     A                                      COLHDG('STATO' 'ORD.')
     A**                                    VALUES(' ' '1' '2' '9')
     A            SVILC1         5  0       TEXT('1° SVIL.COMM.SCAT.')
     A                                      COLHDG('1° SVIL' 'COMM.LE')
     A                                      EDTCDE(Z)
     A            SVILC2         5  0       TEXT('2° SVIL.COMM.SCAT.')
     A                                      COLHDG('2° SVIL' 'COMM.LE')
     A                                      EDTCDE(Z)
     A            STABBI         1          TEXT('STATO ABBINAMENTO')
     A                                      COLHDG('ST.' 'ABB')
     A**                                    VALUES(' ' '1' '2' '3' 'A')
     A            SEQABB         4  0       TEXT('SEQUENZA INVIO ABBINAMENTO')
     A                                      COLHDG('SEQ.INV' 'ABBIN.')
     A                                      EDTCDE(Z)
     A            SEQLAV         4  0       TEXT('SEQUENZA LAVORAZ. O/L')
     A                                      COLHDG('SEQ.LAV.')
     A                                      EDTCDE(Z)
     A            SEQGEN         6  0       TEXT('SEQ.LAVORAZ.GENERATRICE')
     A                                      COLHDG('SEQ.LAV' 'GENER.')
     A                                      EDTCDE(Z)
     A            SEQPRO         6  0       TEXT('SEQUENZA LAVORAZ.SCATOLIF.')
     A                                      COLHDG('SEQ.LAV' 'SCAT.')
     A                                      EDTCDE(Z)
     A            STCARL         1          TEXT('STAMPA CARTA SU LISTINO')
     A                                      COLHDG('ST. SU' 'LIST.')
     A**                                    VALUES('Y' 'N' 'P')
     A            STCER          1          TEXT('STATO CERTIFICATO')
     A                                      COLHDG('ST.' 'CER')
     A            SCAPAC         3  0       TEXT('SCATOLE PER PACCO')
     A                                      COLHDG('SCAT.' 'PACCO')
     A                                      EDTCDE(Z)
     A            SALCON        11  0       TEXT('SALDO CONTABILE')
     A                                      COLHDG('SALDO' 'CONT.')
     A                                      EDTCDE(Z)
     A            SCADUT        11  0       TEXT('SCADUTO')
     A                                      COLHDG('SCADUTO')
     A                                      EDTCDE(Z)
     A            SPECA1         4          TEXT('1à CARTA SPECIFICA')
     A                                      COLHDG('1à' 'CARTA')
     A            SPECA2         4          TEXT('2à CARTA SPECIFICA')
     A                                      COLHDG('2à' 'CARTA')
     A            SPECA3         4          TEXT('3à CARTA SPECIFICA')
     A                                      COLHDG('3à' 'CARTA')
     A            SPECA4         4          TEXT('4à CARTA SPECIFICA')
     A                                      COLHDG('4à' 'CARTA')
     A            SPECA5         4          TEXT('5à CARTA SPECIFICA')
     A                                      COLHDG('5à' 'CARTA')
     A            SPEGR1         1          TEXT('1à GRAMMATURA SPECIFICA')
     A                                      COLHDG('GRAM' '1')
     A            SPEGR2         1          TEXT('2à GRAMMATURA SPECIFICA')
     A                                      COLHDG('GRAM' '2')
     A            SPEGR3         1          TEXT('3à GRAMMATURA SPECIFICA')
     A                                      COLHDG('GRAM' '3')
     A            SPEGR4         1          TEXT('4à GRAMMATURA SPECIFICA')
     A                                      COLHDG('GRAM' '4')
     A            SPEGR5         1          TEXT('5à GRAMMATURA SPECIFICA')
     A                                      COLHDG('GRAM' '5')
     A            SPEOND         2          TEXT('ONDA SPECIFICA')
     A                                      COLHDG('ONDA')
     A            SPESSO         3  0       TEXT('DMM. SPESSORE ONDA')
     A                                      COLHDG('DMM.' 'SPESS.')
     A            SVILU1         5  0       TEXT('1° SVILUPPO SCATOLA')
     A                                      COLHDG('1°' 'SVIL.')
     A                                      EDTCDE(Z)
     A            SVILU2         5  0       TEXT('2° SVILUPPO SCATOLA')
     A                                      COLHDG('2°' 'SVIL.')
     A                                      EDTCDE(Z)
     A            SCOCL     R               REFFLD(SCOCL DIZACGV3)
     A            STBOLL         1          TEXT('STATO AVANZAMENTO BOLLA')
     A                                      COLHDG('STATO')
     A            SIRGIO         3          TEXT('IDENT.GIORNO')
     A                                      COLHDG('GIORNO')
     A            SIRPRO         2S 0       TEXT('PROGRESSIVO')
     A                                      COLHDG('PROGR.')
     A                                      EDTCDE(Z)
     A            SIRORA         4S 0       TEXT('ORARIO HHMM')
     A                                      COLHDG('ORA')
     A                                      EDTCDE(Z)
     A            SIRDUR         3S 0       TEXT('DURATA')
     A                                      COLHDG('DUR.')
     A                                      EDTCDE(Z)
     A            SOTTI1        15          TEXT('1° SOTTOTIPO')
     A                                      COLHDG('1° SOT.')
     A            SOTTI2        15          TEXT('2° SOTTOTIPO')
     A                                      COLHDG('2° SOT.')
     A            SOTTI3        15          TEXT('3° SOTTOTIPO')
     A                                      COLHDG('3° SOT.')
     A            SOTTI4        15          TEXT('4° SOTTOTIPO')
     A                                      COLHDG('4° SOT.')
     A            TPACCR         4  0       TEXT('TOTALE PACCHI PER RIGA BOLLA')
     A                                      COLHDG('PACCHI' 'RIGA')
     A                                      EDTCDE(Z)
     A            TPALLR         3  0       TEXT('TOTALE PALLET PER RIGA BOLLA')
     A                                      COLHDG('PALLET' 'RIGA')
     A                                      EDTCDE(Z)
     A            TIMOUT         4S 0       TEXT('TIME OUT')
     A                                      COLHDG('T.OUT')
     A                                      EDTCDE(Z)
     A            TIPCAM         1          TEXT('TIPO CAMICIA')
     A                                      COLHDG('TIPO' 'CAMICIA')
     A            TIPCER         1          TEXT('TIPO CER.COLL.')
     A                                      COLHDG('TIPO' 'CER.COL.')
     A            TIPBOL         1          TEXT('TIPO BOLLA')
     A                                      COLHDG('TIPO' 'BOLLA')
     A            TIPGIO         1          TEXT('TIPO GIORNO')
     A                                      COLHDG('TIPO' 'GIORNO')
     A            TIPLAV         1          TEXT('TURNO/GIORN.')
     A                                      COLHDG('TURNO' 'GIORN.')
     A            TIPPAL         1          TEXT('TIPO PALLET')
     A                                      COLHDG('TIPO' 'PALLET')
     A            TURNO          1          TEXT('TURNO 0,1,2')
     A                                      COLHDG('TURNO')
     A            TIPMOV         2          TEXT('TIPO MOVIMENTO')
     A                                      COLHDG('TIP' 'MOV')
     A            TPDSPF         1          TEXT('FORMATO VIDEO DA USARE')
     A                                      COLHDG('TIPO' 'DSPF')
     A            TPARCH         1          TEXT('ARCHIVIO DI BASE DA USARE')
     A                                      COLHDG('TIPO' 'ARCH')
     A            TIPMAG         2          TEXT('TIPO MAGAZZINO')
     A                                      COLHDG('TIP' 'MAG')
     A            TPLIST         1          TEXT('TIPO LISTINO')
     A                                      COLHDG('TP.' 'LIST')
     A**                                    VALUES('N' 'V')
     A            TESRIC         1          TEXT('TESTATA RICHIESTA')
     A                                      COLHDG('TESTA' 'RICH.')
     A**                                    VALUES(' ' 'T')
     A            TNLSOA         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'SOA')
     A                                      EDTCDE(4)
     A            TNLSOB         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'SOB')
     A                                      EDTCDE(4)
     A            TNLSOT         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'SOT')
     A                                      EDTCDE(4)
     A            TNLSOE         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA E')
     A                                      COLHDG('TNL' 'SOT')
     A                                      EDTCDE(4)
     A            TNLSOM         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA EB')
     A                                      COLHDG('TNL' 'SOT')
     A                                      EDTCDE(4)
     A            TNLSOO         5  2       TEXT('TRASF.NUOVO LISTINO SCATOLE O-
     A                                      NDA BA')
     A                                      COLHDG('TNL' 'SOT')
     A                                      EDTCDE(4)
     A            TNLCOA         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'COA')
     A                                      EDTCDE(4)
     A            TNLCOB         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'COB')
     A                                      EDTCDE(4)
     A            TNLCOT         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA ALTA')
     A                                      COLHDG('TNL' 'COT')
     A                                      EDTCDE(4)
     A            TNLCOE         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA E')
     A                                      COLHDG('TNL' 'COT')
     A                                      EDTCDE(4)
     A            TNLCOM         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA EB')
     A                                      COLHDG('TNL' 'COT')
     A                                      EDTCDE(4)
     A            TNLCOO         5  2       TEXT('TRASF.NUOVO LISTINO CARTONE O-
     A                                      NDA BA')
     A                                      COLHDG('TNL' 'COT')
     A                                      EDTCDE(4)
     A            TVLSOA         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'SOA')
     A                                      EDTCDE(4)
     A            TVLSOB         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'SOB')
     A                                      EDTCDE(4)
     A            TVLSOT         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'SOT')
     A                                      EDTCDE(4)
     A            TVLSOE         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA E')
     A                                      COLHDG('TVL' 'SOT')
     A                                      EDTCDE(4)
     A            TVLSOM         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA EB')
     A                                      COLHDG('TVL' 'SOT')
     A                                      EDTCDE(4)
     A            TVLSOO         5  2       TEXT('TRASF.VECCHIO LISTINO SCATOLE-
     A                                       ONDA BA')
     A                                      COLHDG('TVL' 'SOT')
     A                                      EDTCDE(4)
     A            TVLCOA         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'COA')
     A                                      EDTCDE(4)
     A            TVLCOB         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'COB')
     A                                      EDTCDE(4)
     A            TVLCOT         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA ALTA')
     A                                      COLHDG('TVL' 'COT')
     A                                      EDTCDE(4)
     A            TVLCOE         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA E')
     A                                      COLHDG('TVL' 'COT')
     A                                      EDTCDE(4)
     A            TVLCOM         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA EB')
     A                                      COLHDG('TVL' 'COT')
     A                                      EDTCDE(4)
     A            TVLCOO         5  2       TEXT('TRASF.VECCHIO LISTINO CARTONE-
     A                                       ONDA BA')
     A                                      COLHDG('TVL' 'COT')
     A                                      EDTCDE(4)
     A            TIPMER         1          TEXT('TIPO MERCE')
     A                                      COLHDG('T.' 'MERCE')
     A            TMSTDU         7  4       TEXT('TEMPO MEDIO STANDARD UNITARIO-
     A                                      ')
     A                                      COLHDG('STD.' 'UNIT.')
     A                                      EDTCDE(4)
     A            TPSTAM         1          TEXT('TIPO STAMPO')
     A                                      COLHDG('TP.' 'STAM')
     A            TOPOND         2          TEXT('ONDULATORE DA PC_TOPP')
     A                                      COLHDG('ON.' 'PCT')
     A            TOPABB         4          TEXT('N.ABB.PC_TOPP')
     A                                      COLHDG('AB.' 'PCT')
     A            TOPRIG         3          TEXT('RIGA ABB.PC_TOPP')
     A                                      COLHDG('RI.' 'TCP')
     A            TPCERT         1          TEXT('TIPO CERTIF.')
     A                                      COLHDG('TP.' 'CERT')
     A            TBCER          2          TEXT('TAB. CERTIF.')
     A                                      COLHDG('TAB' 'CERT')
     A            TIPSTA         1          TEXT('TIPO STAMPO')
     A                                      COLHDG('TIP' 'STAM')
     A            TIPFUS         1          TEXT('TIPO FUST.')
     A                                      COLHDG('TIP' 'FUS')
     A            TOTFAN        11  0       TEXT('TOTALE QUANTITA'' FATTURATA')
     A                                      COLHDG('Q.TOT.' 'FATT.ANN')
     A                                      EDTCDE(4)
     A            TOTMQF        11  0       TEXT('TOTOLE QUANTITA'' MQ.')
     A                                      COLHDG('MQ.TOT.' 'MQ.ANN')
     A                                      EDTCDE(4)
     A            TOTFAT        11  0       TEXT('TOTALE FATTURA EURO X 100')
     A                                      COLHDG('TOT.FATT.' 'EURO X 100')
     A                                      EDTCDE(4)
     A            UMCART         2          TEXT('UNITA'' DI MISURA DELLA CARTA-
     A                                      ')
     A                                      COLHDG('UM')
     A            UMPROD         2          TEXT('UNITA'' DI MISURA DEL PRODOTT-
     A                                      O')
     A                                      COLHDG('UM')
     A            UMCERT         6          TEXT('UNITA'' MISURA DEL CERTIF.')
     A                                      COLHDG('UM')
     A            UMTBS          3          TEXT('UNITA'' DI MISURA DEL PRODOTT-
     A                                      O')
     A                                      COLHDG('UM')
     A            UTENTE        10          TEXT('UTENTE')
     A                                      COLHDG('UTENTE')
     A            VALMER         9  0       TEXT('VALORE DELLA MERCE RIGA BOLLA-
     A                                      ')
     A                                      EDTCDE(4)
     A                                      COLHDG('VALORE' 'MERCE')
     A            VELBAS         5  0       TEXT('VELOCITA'' ORARIA ONDA BASSA')
     A                                      COLHDG('VEL.ONDA' 'BASSA')
     A                                      EDTCDE(Z)
     A            VELALT         5  0       TEXT('VELOCITA'' ORARIA ONDA ALTA')
     A                                      COLHDG('VEL.ONDA' 'ALTA ')
     A                                      EDTCDE(Z)
     A            VELTRI         5  0       TEXT('VELOCITA'' ORARIA ONDA TRIPLA-
     A                                      ')
     A                                      COLHDG('VEL.ONDA' 'TRIPLA')
     A                                      EDTCDE(Z)
     A            VELMTL         3  0       TEXT('VELOCITA'' MT.LIN X MINUTO')
     A                                      COLHDG('MT. X' 'MIN.')
     A                                      EDTCDE(4)
     A            VELMAC         5  0       TEXT('VELOCITA'' SC/BA ORA')
     A                                      COLHDG('SC/BA' 'ORA')
     A                                      EDTCDE(Z)
     A            VELMA2         5  0       TEXT('VELOCITA'' SC/BA ORA')
     A                                      COLHDG('SC/BA' 'ORA')
     A                                      EDTCDE(Z)
     A            VELMA3         5  0       TEXT('VELOCITA'' SC/BA ORA')
     A                                      COLHDG('SC/BA' 'ORA')
     A                                      EDTCDE(Z)
     A            VELMA4         5  0       TEXT('VELOCITA'' SC/BA ORA')
     A                                      COLHDG('SC/BA' 'ORA')
     A                                      EDTCDE(Z)
     A            VCMIN          7  0       TEXT('COSTO MACCH.MINUTO')
     A                                      COLHDG('COSTO MIN.')
     A                                      EDTCDE(Z)
     A            VCOL0          3  0       TEXT('MIN.AVV.ANONIME')
     A                                      COLHDG('MIN.AVV.0C')
     A                                      EDTCDE(Z)
     A            VCOL1          3  0       TEXT('MIN.AVV.1 COLORE')
     A                                      COLHDG('MIN.AVV.1C')
     A                                      EDTCDE(Z)
     A            VCOL2          3  0       TEXT('MIN.AVV.2 COLORI')
     A                                      COLHDG('MIN.AVV.2C')
     A                                      EDTCDE(Z)
     A            VCOL3          3  0       TEXT('MIN.AVV.3 COLORI')
     A                                      COLHDG('MIN.AVV.3C')
     A                                      EDTCDE(Z)
     A            VCOL4          3  0       TEXT('MIN.AVV.4 COLORI')
     A                                      COLHDG('MIN.AVV.4C')
     A                                      EDTCDE(Z)
     A            VFUST          3  0       TEXT('MIN.AVV.AMERIC.FUST')
     A                                      COLHDG('MIN.AVV.FUST.')
     A                                      EDTCDE(Z)
     A            VMQ1           5  0       TEXT('MQ FASCIA 1')
     A                                      COLHDG('MQ 1')
     A                                      EDTCDE(Z)
     A            VMQ2           5  0       TEXT('MQ FASCIA 2')
     A                                      COLHDG('MQ 2')
     A                                      EDTCDE(Z)
     A            VMQ3           5  0       TEXT('MQ FASCIA 3')
     A                                      COLHDG('MQ 3')
     A                                      EDTCDE(Z)
     A            VMQ4           5  0       TEXT('MQ FASCIA 4')
     A                                      COLHDG('MQ 4')
     A                                      EDTCDE(Z)
     A            VMQ5           5  0       TEXT('MQ FASCIA 5')
     A                                      COLHDG('MQ 5')
     A                                      EDTCDE(Z)
     A            VMQ6           5  0       TEXT('MQ FASCIA 6')
     A                                      COLHDG('MQ 6')
     A                                      EDTCDE(Z)
     A            VMQ7           5  0       TEXT('MQ FASCIA 7')
     A                                      COLHDG('MQ 7')
     A                                      EDTCDE(Z)
     A            VMQ8           5  0       TEXT('MQ FASCIA 8')
     A                                      COLHDG('MQ 8')
     A                                      EDTCDE(Z)
     A            VMQ9           5  0       TEXT('MQ FASCIA 9')
     A                                      COLHDG('MQ 9')
     A                                      EDTCDE(Z)
     A            VMQA           5  0       TEXT('MQ FASCIA 11')
     A                                      COLHDG('MQ 11')
     A                                      EDTCDE(Z)
     A            VMQB           5  0       TEXT('MQ FASCIA 12')
     A                                      COLHDG('MQ 12')
     A                                      EDTCDE(Z)
     A            VMQ1B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ1B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ1C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ1EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ1EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ1EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ1E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ2B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ2C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ2EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ2EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ2EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ2E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ3B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ3C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ3EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ3EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ3EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ3E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ4B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ4C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ4EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ4EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ4EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ4E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ5B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ5C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ5EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ5EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ5EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ5E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ6B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ6C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ6EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ6EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ6EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ6E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ7B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ7C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ7EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ7EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ7EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ7E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ8B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ8C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ8EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ8EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ8EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ8E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ9B1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQ9C1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQ9EC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQ9EA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQ9EP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQ9E1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQAB1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQAC1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQAEC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQAEA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQAEP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQAE1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQBB1         5  0       TEXT('VEL ONDA B1')
     A                                      COLHDG('VEL.B1')
     A                                      EDTCDE(Z)
     A            VMQBC1         5  0       TEXT('VEL ONDA C1')
     A                                      COLHDG('VEL.C1')
     A                                      EDTCDE(Z)
     A            VMQBEC         5  0       TEXT('VEL ONDA EC')
     A                                      COLHDG('VEL.EC')
     A                                      EDTCDE(Z)
     A            VMQBEA         5  0       TEXT('VEL ONDA EA')
     A                                      COLHDG('VEL.EA')
     A                                      EDTCDE(Z)
     A            VMQBEP         5  0       TEXT('VEL ONDA EP')
     A                                      COLHDG('VEL.EP')
     A                                      EDTCDE(Z)
     A            VMQBE1         5  0       TEXT('VEL ONDA E1')
     A                                      COLHDG('VEL.E1')
     A                                      EDTCDE(Z)
     A            VMQ1C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ1T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ1E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ1M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ1O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ2B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ2C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ2T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ2E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ2M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ2O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ3B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ3C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ3T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ3E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ3M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ3O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ4B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ4C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ4T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ4E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ4M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ4O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ5B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ5C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ5T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ5E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ5M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ5O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ6B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ6C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ6T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ6E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ6M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ6O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ7B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ7C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ7T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ7E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ7M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ7O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ8B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ8C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ8T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ8E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ8M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ8O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ9B          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQ9C          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQ9T          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQ9E          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQ9M          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQ9O          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQAB          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQAC          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQAT          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQAE          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQAM          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQAO          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQBB          5  0       TEXT('VEL ONDA B')
     A                                      COLHDG('VEL.B')
     A                                      EDTCDE(Z)
     A            VMQBC          5  0       TEXT('VEL ONDA C')
     A                                      COLHDG('VEL.C')
     A                                      EDTCDE(Z)
     A            VMQBT          5  0       TEXT('VEL ONDA BC')
     A                                      COLHDG('VEL.BC')
     A                                      EDTCDE(Z)
     A            VMQBE          5  0       TEXT('VEL ONDA E')
     A                                      COLHDG('VEL.E')
     A                                      EDTCDE(Z)
     A            VMQBM          5  0       TEXT('VEL ONDA EB')
     A                                      COLHDG('VEL.EB')
     A                                      EDTCDE(Z)
     A            VMQBO          5  0       TEXT('VEL ONDA BA')
     A                                      COLHDG('VEL.BA')
     A                                      EDTCDE(Z)
     A            VMQ1R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ1R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ1R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ1R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ2R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ2R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ2R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ2R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ3R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ3R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ3R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ3R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ4R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ4R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ4R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ4R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ5R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ5R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ5R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ5R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ6R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ6R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ6R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ6R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ7R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ7R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ7R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ7R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ8R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ8R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ8R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ8R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQ9R1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQ9R2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQ9R3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQ9R4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQAR1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQAR2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQAR3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQAR4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VMQBR1         5  0       TEXT('VEL. RESA 1')
     A                                      COLHDG('VEL.''RESA 1')
     A                                      EDTCDE(Z)
     A            VMQBR2         5  0       TEXT('VEL. RESA 2')
     A                                      COLHDG('VEL.''RESA 2')
     A                                      EDTCDE(Z)
     A            VMQBR3         5  0       TEXT('VEL. RESA 3')
     A                                      COLHDG('VEL.''RESA 3')
     A                                      EDTCDE(Z)
     A            VMQBR4         5  0       TEXT('VEL. RESA 4')
     A                                      COLHDG('VEL.''RESA 4')
     A                                      EDTCDE(Z)
     A            VTRMQB         3  0       TEXT('£.TRASF.MQ.ONDULATORE ONDA B')
     A                                      COLHDG('£.TR.''ONDA B')
     A                                      EDTCDE(Z)
     A            VTRMQC         3  0       TEXT('£.TRASF.MQ.ONDULATORE ONDA C')
     A                                      COLHDG('£.TR.''ONDA C')
     A                                      EDTCDE(Z)
     A            VTRMQT         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA BC')
     A                                      COLHDG('£.TR.''ONDA BC')
     A                                      EDTCDE(Z)
     A            VTRMQE         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA E')
     A                                      COLHDG('£.TR.''ONDA E')
     A                                      EDTCDE(Z)
     A            VTRMQM         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA EB')
     A                                      COLHDG('£.TR.''ONDA EB')
     A                                      EDTCDE(Z)
     A            VTRMQO         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA BA')
     A                                      COLHDG('£.TR.''ONDA BA')
     A                                      EDTCDE(Z)
     A            VTRMB1         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA B1')
     A                                      COLHDG('£.TR.''ONDA B1')
     A                                      EDTCDE(Z)
     A            VTRMC1         3  0       TEXT('£.TRASF.MQ.ONDULAT. ONDA C1')
     A                                      COLHDG('£.TR.''ONDA C1')
     A                                      EDTCDE(Z)
     A            VTREQB         5  2       TEXT('¤.TRASF.MQ.ONDULATORE ONDA B')
     A                                      COLHDG('¤.TR.''ONDA B')
     A                                      EDTCDE(Z)
     A            VTREQC         5  2       TEXT('¤.TRASF.MQ.ONDULATORE ONDA C')
     A                                      COLHDG('¤.TR.''ONDA C')
     A                                      EDTCDE(Z)
     A            VTREQT         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA BC')
     A                                      COLHDG('¤.TR.''ONDA BC')
     A                                      EDTCDE(Z)
     A            VTREQE         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA E')
     A                                      COLHDG('¤.TR.''ONDA E')
     A                                      EDTCDE(Z)
     A            VTREQM         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA EB')
     A                                      COLHDG('¤.TR.''ONDA EB')
     A                                      EDTCDE(Z)
     A            VTREQO         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA BA')
     A                                      COLHDG('¤.TR.''ONDA BA')
     A                                      EDTCDE(Z)
     A            VTREB1         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA B1')
     A                                      COLHDG('¤.TR.''ONDA B1')
     A                                      EDTCDE(Z)
     A            VTREC1         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA C1')
     A                                      COLHDG('¤.TR.''ONDA C1')
     A                                      EDTCDE(Z)
     A            VTREEC         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA EC')
     A                                      COLHDG('¤.TR.''ONDA EC')
     A                                      EDTCDE(Z)
     A            VTREEA         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA EA')
     A                                      COLHDG('¤.TR.''ONDA EA')
     A                                      EDTCDE(Z)
     A            VTREEP         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA EP')
     A                                      COLHDG('¤.TR.''ONDA EP')
     A                                      EDTCDE(Z)
     A            VTREE1         5  2       TEXT('¤.TRASF.MQ.ONDULAT. ONDA E1')
     A                                      COLHDG('¤.TR.''ONDA E1')
     A                                      EDTCDE(Z)
     A            VTRTRB         3  0       TEXT('£.TRAS.MQ.TRATTAMENTO ONDA B')
     A                                      COLHDG('£.TR.TR.''ONDA B')
     A                                      EDTCDE(Z)
     A            VTRTRA         3  0       TEXT('£.TRAS.MQ.TRATTAMENTO ONDA A')
     A                                      COLHDG('£.TR.TR.''ONDA A')
     A                                      EDTCDE(Z)
     A            VTRTRI         3  0       TEXT('£.TRAS.MQ.TRATTAM.COPER.INT.')
     A                                      COLHDG('£.TR.TR.''COP.INT.')
     A                                      EDTCDE(Z)
     A            VTRTRE         3  0       TEXT('£.TRAS.MQ.TRATTAM.COPER.EST.')
     A                                      COLHDG('£.TR.TR.''COP.EST.')
     A                                      EDTCDE(Z)
     A            VTRTRT         3  0       TEXT('£.TRAS.MQ.TRATTAM.TESO')
     A                                      COLHDG('£.TR.TR.''TESO')
     A                                      EDTCDE(Z)
     A            VTRTEB         5  2       TEXT('¤.TRAS.MQ.TRATTAMENTO ONDA B')
     A                                      COLHDG('¤.TR.TR.''ONDA B')
     A                                      EDTCDE(Z)
     A            VTRTEA         5  2       TEXT('¤.TRAS.MQ.TRATTAMENTO ONDA A')
     A                                      COLHDG('¤.TR.TR.''ONDA A')
     A                                      EDTCDE(Z)
     A            VTRTE          5  2       TEXT('¤.TRAS.MQ.TRATTAMENTO ONDA E')
     A                                      COLHDG('¤.TR.TR.''ONDA E')
     A                                      EDTCDE(Z)
     A            VTRTEI         5  2       TEXT('¤.TRAS.MQ.TRATTAM.COPER.INT.')
     A                                      COLHDG('¤.TR.TR.''COP.INT.')
     A                                      EDTCDE(Z)
     A            VTRTEE         5  2       TEXT('¤.TRAS.MQ.TRATTAM.COPER.EST.')
     A                                      COLHDG('¤.TR.TR.''COP.EST.')
     A                                      EDTCDE(Z)
     A            VTRTET         5  2       TEXT('¤.TRAS.MQ.TRATTAM.TESO')
     A                                      COLHDG('¤.TR.TR.''TESO')
     A                                      EDTCDE(Z)
     A            VEL500         3  0       TEXT('LIMITE LUNGHEZZA 500')
     A                                      COLHDG('LIM' '500')
     A                                      EDTCDE(Z)
     A            VEL550         3  0       TEXT('LIMITE LUNGHEZZA 550')
     A                                      COLHDG('LIM' '550')
     A                                      EDTCDE(Z)
     A            VEL600         3  0       TEXT('LIMITE LUNGHEZZA 600')
     A                                      COLHDG('LIM' '600')
     A                                      EDTCDE(Z)
     A            VEL650         3  0       TEXT('LIMITE LUNGHEZZA 650')
     A                                      COLHDG('LIM' '650')
     A                                      EDTCDE(Z)
     A            VEL700         3  0       TEXT('LIMITE LUNGHEZZA 700')
     A                                      COLHDG('LIM' '700')
     A                                      EDTCDE(Z)
     A            VEL750         3  0       TEXT('LIMITE LUNGHEZZA 750')
     A                                      COLHDG('LIM' '750')
     A                                      EDTCDE(Z)
     A            VEL800         3  0       TEXT('LIMITE LUNGHEZZA 800')
     A                                      COLHDG('LIM' '800')
     A                                      EDTCDE(Z)
     A            VEL850         3  0       TEXT('LIMITE LUNGHEZZA 850')
     A                                      COLHDG('LIM' '850')
     A                                      EDTCDE(Z)
     A            VEL900         3  0       TEXT('LIMITE LUNGHEZZA 900')
     A                                      COLHDG('LIM' '900')
     A                                      EDTCDE(Z)
     A            VEL950         3  0       TEXT('LIMITE LUNGHEZZA 950')
     A                                      COLHDG('LIM' '950')
     A                                      EDTCDE(Z)
     A            VE1000         3  0       TEXT('LIMITE LUNGHEZZA 1000')
     A                                      COLHDG('LIM' '1000')
     A                                      EDTCDE(Z)
     A            VUOTAM         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. VUOTO -
     A                                      ')
     A                                      COLHDG('VUOT')
     A                                      EDTCDE(4)
     A            VUOTFU         5  2       TEXT('ALTRI AGGIUNTIVI X PZ. VUOTO -
     A                                      ')
     A                                      COLHDG('VUOT')
     A                                      EDTCDE(4)
     A            WSIDEN        10          TEXT('TERMINALE')
     A            RESCON        25          TEXT('RESP.CONTR.QUALITA"')
     A            RESPON        10          TEXT('RESP.CLIENTE')
     A            INTCER        50          TEXT('INTESTAZ.CERTIF.Q.')
     A            VSCER         20          TEXT('LIBERO 1        ')
     A            VRCER         20          TEXT('LIBERO 2        ')
     A            VSCERQ         7  2       TEXT('VALORE RICHIESTO /INF.')
     A            VRCERQ         7  2       TEXT('VAL.RICH.SUP./%TOLL.')
     A            COMUNE        25          TEXT('COMUNE')
     A            COMPRO         7  2       TEXT('COMPRESSIONE RICHIESTA')
     A                                      COLHDG('COMPRESS.')
     A                                      EDTCDE(Z)
     A            SCOPRO         5  2       TEXT('SCOPPIO RICHIESTO')
     A                                      COLHDG('SCOPPIO')
     A                                      EDTCDE(Z)
     A            PESPRO         5  0       TEXT('GR. PESO SCATOLA RICHIESTO')
     A                                      COLHDG('PESO' 'RICH.')
     A                                      EDTCDE(Z)
     A            ECT            3  1       TEXT('VALORE ECT')
     A                                      COLHDG('ECT')
     A                                      EDTCDE(Z)
     A            PESCAL         5  3       TEXT('PESO SCATOLA CALCOLATO')
     A                                      COLHDG('PESO' 'CALC.')
     A                                      EDTCDE(Z)
     A            PESOAR         5  3       TEXT('PESO ARTICOLO')
     A                                      COLHDG('PESO' 'ART.')
     A                                      EDTCDE(Z)
     A            ARTFOR        25          TEXT('ARTICOLO FORNITORE')
     A                                      COLHDG('ART.' 'FORN.')
     A            SCOB           3  0       TEXT('SCONTO £.ONDA B           ')
     A                                      COLHDG('SC. ' 'ON.B ')
     A                                      EDTCDE(Z)
     A            SCOC           3  0       TEXT('SCONTO £.ONDA C')
     A                                      COLHDG('SC.''ON.C ')
     A                                      EDTCDE(Z)
     A            SCOT           3  0       TEXT('£. SCONTO ONDA BC')
     A                                      COLHDG('SC. ' 'ON.BC')
     A                                      EDTCDE(Z)
     A            SCOE           3  0       TEXT('£. SCONTO ONDA E')
     A                                      COLHDG('SC. ' 'ON.E')
     A                                      EDTCDE(Z)
     A            SCOM           3  0       TEXT('£. SCONTO ONDA EB')
     A                                      COLHDG('SC. ' 'ON.EB')
     A                                      EDTCDE(Z)
     A            SCOO           3  0       TEXT('£.SCONTO ONDA BA')
     A                                      COLHDG('SC. ' 'ON.BA')
     A                                      EDTCDE(Z)
