      ****************************************************************
      *   TABELLA       : LOG136F0                                   *
      ****************************************************************
     A          R LOG136
      *
     A            RIGO        2600A         COLHDG('Stringa record...')
