      ****************************************************************
      *   TABELLA       : LOG132F0                                   *
      ****************************************************************
     A          R LOG132F0
      *
     A            LOG132F0     132A         COLHDG('Stato ...........')
