      ****************************************************************
      *   TABELLA       : LOG132F0                                   *
      ****************************************************************
     A          R LOG134
      *
     A            RIGO        1000A         COLHDG('Stato ...........')
