      ****************************************************************
      *   TABELLA       : LOG135F0                                   *
      ****************************************************************
     A          R LOG135
      *
     A            RIGO        2600A         COLHDG('Stringa record...')
