     * =============================================================== *
     *  ARCHIVIO      : LOGMAIF0                                     *
     *  DESCRIZIONE   : LOG MAIL                                     *
     *  PREFISSO      : LMA                                          *
     * =============================================================== *
     A          R LOGMAI
     *
     A            LMASTAT0       1A         TEXT('Stato.......................')
     A                                      COLHDG('Stato...............')
     A            LMAIMUT0      10A         TEXT('Immissione utente...........')
     A                                      COLHDG('Immissione utente...')
     A            LMAIMDA0       8S 0       TEXT('Immissione data ............')
     A                                      COLHDG('Immissione data.....')
     A            LMAIMOR0       6S 0       TEXT('Immissione ora .............')
     A                                      COLHDG('Immissione ora......')
     A            LMAIMPG0      10A         TEXT('Immissione programma........')
     A                                      COLHDG('Immissione programma')
     A            LMAPRGS0       9S 0       TEXT('Progressivo ................')
     A                                      COLHDG('Progressivo.........')
     A            LMARIGA0       4S 0       TEXT('Riga interna ...............')
     A                                      COLHDG('Riga interna........')
     A            LMAMITT0     100A         TEXT('Mittente email .............')
     A                                      COLHDG('Mittente email......')
     A            LMANOME0     100A         TEXT('Destinatario nome ..........')
     A                                      COLHDG('Destinatario nome...')
     A            LMAMAIL0     100A         TEXT('Destinatario email........ .')
     A                                      COLHDG('Destinatario email..')
     A            LMASOGG0     200A         TEXT('Oggetto ....................')
     A                                      COLHDG('Oggetto ............')
     A            LMATEST0    2000A         TEXT('Testo ......................')
     A                                      COLHDG('Testo ..............')
     A            LMAALPT0     200A         TEXT('Path + nome allegato........')
     A                                      COLHDG('Path + nome allegato')
     A            LMAFG010       2A         TEXT('Flag 01  ...................')
     A                                      COLHDG('Flag 01  ...........')
     A            LMAFG020       2A         TEXT('Flag 02  ...................')
     A                                      COLHDG('Flag 02  ...........')
     A            LMAFG030       2A         TEXT('Flag 03  ...................')
     A                                      COLHDG('Flag 03  ...........')
     A            LMAFG040       2A         TEXT('Flag 04  ...................')
     A                                      COLHDG('Flag 04  ...........')
     A            LMAFG050       2A         TEXT('Flag 05  ...................')
     A                                      COLHDG('Flag 05  ...........')
     A            LMAFG060      10A         TEXT('Flag 06  ...................')
     A                                      COLHDG('Flag 06  ...........')
     A            LMAFG070      10A         TEXT('Flag 07  ...................')
     A                                      COLHDG('Flag 07  ...........')
     A            LMAFG080      10A         TEXT('Flag 08  ...................')
     A                                      COLHDG('Flag 08  ...........')
     A            LMAFG090      10A         TEXT('Flag 09  ...................')
     A                                      COLHDG('Flag 09  ...........')
     A            LMAFG100      10A         TEXT('Flag 10  ...................')
     A                                      COLHDG('Flag 10  ...........')
