     * =============================================================== *
     *  ARCHIVIO      : LOGMAVF0                                     *
     *  DESCRIZIONE   : LOG MAIL                                     *
     *  PREFISSO      : LMV                                          *
     * =============================================================== *
     A          R LOGMAV
     *
     A            LMVSTAT0       1A         TEXT('Stato.......................')
     A                                      COLHDG('Stato...............')
     A            LMVIMUT0      10A         TEXT('Immissione utente...........')
     A                                      COLHDG('Immissione utente...')
     A            LMVIMDA0       8S 0       TEXT('Immissione data ............')
     A                                      COLHDG('Immissione data.....')
     A            LMVIMOR0       6S 0       TEXT('Immissione ora .............')
     A                                      COLHDG('Immissione ora......')
     A            LMVIMPG0      10A         TEXT('Immissione programma........')
     A                                      COLHDG('Immissione programma')
     A            LMVPRGS0       9S 0       TEXT('Progressivo ................')
     A                                      COLHDG('Progressivo.........')
     A            LMVRIGA0       4S 0       TEXT('Riga interna ...............')
     A                                      COLHDG('Riga interna........')
     A            LMVCFO10       1A         TEXT('C=cliente F=fornitore.......')
     A                                      COLHDG('C=cliente F=fornitor')
     A            LMVCOD10       6A         TEXT('C=codice ...................')
     A                                      COLHDG('Codice .............')
     A            LMVMITT0     100A         TEXT('Mittente email .............')
     A                                      COLHDG('Mittente email......')
     A            LMVNOME0     100A         TEXT('Destinatario nome ..........')
     A                                      COLHDG('Destinatario nome...')
     A            LMVMAIL0     100A         TEXT('Destinatario email........ .')
     A                                      COLHDG('Destinatario email..')
     A            LMVINV10       2A         TEXT('Inviata SI/NO...............')
     A                                      COLHDG('Inviata SI/NO.......')
     A            LMVFG010       2A         TEXT('Flag 01  ...................')
     A                                      COLHDG('Flag 01  ...........')
     A            LMVFG020       2A         TEXT('Flag 02  ...................')
     A                                      COLHDG('Flag 02  ...........')
     A            LMVFG030       2A         TEXT('Flag 03  ...................')
     A                                      COLHDG('Flag 03  ...........')
     A            LMVFG040       2A         TEXT('Flag 04  ...................')
     A                                      COLHDG('Flag 04  ...........')
     A            LMVFG050       2A         TEXT('Flag 05  ...................')
     A                                      COLHDG('Flag 05  ...........')
     A            LMVFG060      10A         TEXT('Flag 06  ...................')
     A                                      COLHDG('Flag 06  ...........')
     A            LMVFG070      10A         TEXT('Flag 07  ...................')
     A                                      COLHDG('Flag 07  ...........')
     A            LMVFG080      10A         TEXT('Flag 08  ...................')
     A                                      COLHDG('Flag 08  ...........')
     A            LMVFG090      10A         TEXT('Flag 09  ...................')
     A                                      COLHDG('Flag 09  ...........')
     A            LMVFG100      10A         TEXT('Flag 10  ...................')
     A                                      COLHDG('Flag 10  ...........')
